var weekdayArr = [
    {
        "id": "11",
        "name": "北京市",
        "option": [
            {"id": "10050", "name": "(10050)北京电影学院"},
            {"id": "10012", "name": "(10012)北京服装学院"},
            {"id": "10011", "name": "(10011)北京工商大学"},
            {"id": "80401", "name": "(80401)北京国家会计学院"},
            {"id": "10006", "name": "(10006)北京航空航天大学"},
            {"id": "82703", "name": "(82703)北京机电研究所"},
            {"id": "10016", "name": "(10016)北京建筑大学"},
            {"id": "10007", "name": "(10007)北京理工大学"},
            {"id": "11417", "name": "(11417)北京联合大学"},
            {"id": "10017", "name": "(10017)北京石油化工学院"},
            {"id": "10043", "name": "(10043)北京体育大学"},
            {"id": "10023", "name": "(10023)北京协和医学院"},
            {"id": "10191", "name": "(11232)北京信息科技大学"},
            {"id": "86403", "name": "(86403)北京有色金属研究总院"},
            {"id": "16402", "name": "(16402)长江商学院"},
            {"id": "10036", "name": "(10036)对外经济贸易大学"},
            {"id": "82601", "name": "(82601)钢铁研究总院"},
            {"id": "91001", "name": "(91001)国防大学"},
            {"id": "80202", "name": "(80202)国家行政学院"},
            {"id": "10054", "name": "(10054)华北电力大学"},
            {"id": "83001", "name": "(83001)华北计算机系统工程研究所"},
            {"id": "83902", "name": "(83902)交通运输部公路科学研究所"},
            {"id": "91011", "name": "(91011)陆军防化学院"},
            {"id": "91008", "name": "(91008)陆军航空兵学院"},
            {"id": "91006", "name": "(91006)陆军装甲兵学院"},
            {"id": "83301", "name": "(83301)煤炭科学研究总院"},
            {"id": "10003", "name": "(10003)清华大学"},
            {"id": "82001", "name": "(82001)商务部国际贸易经济合作研究院"},
            {"id": "87120", "name": "(87120)首都儿科研究所"},
            {"id": "10028", "name": "(10028)首都师范大学"},
            {"id": "10040", "name": "(10040)外交学院"},
            {"id": "84512", "name": "(84512)卫生部北京老年医学研究所"},
            {"id": "89611", "name": "(89611)中共北京市委党校"},
            {"id": "80000", "name": "(80000)中共中央党校"},
            {"id": "83107", "name": "(83107)中国北方车辆研究所"},
            {"id": "81601", "name": "(81601)中国财政科学研究院"},
            {"id": "85405", "name": "(85405)中国地震局地震预测研究所"},
            {"id": "11415", "name": "(11415)中国地质大学(北京)"},
            {"id": "82501", "name": "(82501)中国地质科学院"},
            {"id": "82817", "name": "(82817)中国工程物理研究院"},
            {"id": "82405", "name": "(82405)中国环境科学研究院"},
            {"id": "84501", "name": "(84501)中国疾病预防控制中心"},
            {"id": "82401", "name": "(82401)中国建筑科学研究院"},
            {"id": "82403", "name": "(82403)中国建筑设计研究院"},
            {"id": "80901", "name": "(80901)中国科学技术信息研究所"},
            {"id": "83266", "name": "(83266)中国空间技术研究院(航天五院)"},
            {"id": "11413", "name": "(11413)中国矿业大学(北京)"},
            {"id": "12453", "name": "(12453)中国劳动关系学院"},
            {"id": "82201", "name": "(82201)中国林业科学研究院"},
            {"id": "82715", "name": "(82715)中国农业机械化科学研究院"},
            {"id": "82101", "name": "(82101)中国农业科学院"},
            {"id": "11625", "name": "(11625)中国青年政治学院"},
            {"id": "10002", "name": "(10002)中国人民大学"},
            {"id": "10041", "name": "(10041)中国人民公安大学"},
            {"id": "82110", "name": "(82110)中国兽医药品监察所"},
            {"id": "82301", "name": "(82301)中国水利水电科学研究院"},
            {"id": "83801", "name": "(83801)中国铁道科学研究院"},
            {"id": "10046", "name": "(10046)中国音乐学院"},
            {"id": "10053", "name": "(10053)中国政法大学"},
            {"id": "83706", "name": "(83706)中国制浆造纸研究院"},
            {"id": "84502", "name": "(84502)中国中医科学院"},
            {"id": "11149", "name": "(11149)中华女子学院"},
            {"id": "10034", "name": "(10034)中央财经大学"},
            {"id": "10045", "name": "(10045)中央音乐学院"}
        ]
    },
    {
        "id": "12",
        "name": "天津市",
        "option": [
            {"id": "82804", "name": "(82804)核工业理化工程研究院"}
        ]
    },
    {
        "id": "14",
        "name": "山西省",
        "option": [
            {"id": "10117", "name": "(10117)长治医学院"}
        ]
    },
    {
        "id": "21",
        "name": "辽宁省",
        "option": [
            {"id": "10152", "name": "(10152)大连工业大学"},
            {"id": "10150", "name": "(10150)大连交通大学"},
            {"id": "10172", "name": "(10172)大连外国语大学"},
            {"id": "10145", "name": "(10145)东北大学"},
            {"id": "10146", "name": "(10146)辽宁科技大学"},
            {"id": "10162", "name": "(10162)辽宁中医药大学"},
            {"id": "10149", "name": "(10149)沈阳化工大学"},
            {"id": "10153", "name": "(10153)沈阳建筑大学"},
            {"id": "10144", "name": "(10144)沈阳理工大学"},
            {"id": "10163", "name": "(10163)沈阳药科大学"},
            {"id": "82903", "name": "(82903)中国航空研究院601所"}
        ]
    },
    {
        "id": "22",
        "name": "吉林省",
        "option": [
            {"id": "10201", "name": "(10201)北华大学"},
            {"id": "11726", "name": "(11726)长春大学"},
            {"id": "11437", "name": "(11437)长春工程学院"},
            {"id": "10190", "name": "(10190)长春工业大学"},
            {"id": "10186", "name": "(10186)长春理工大学"},
            {"id": "84509", "name": "(84509)长春生物制品研究所"},
            {"id": "10188", "name": "(10188)东北电力大学"},
            {"id": "10207", "name": "(10207)吉林财经大学"},
            {"id": "10183", "name": "(10183)吉林大学"},
            {"id": "10191", "name": "(10191)吉林建筑大学"},
            {"id": "10203", "name": "(10203)吉林师范大学"},
            {"id": "10208", "name": "(10208)吉林体育学院"},
            {"id": "89622", "name": "(89622)中共吉林省委党校"}
        ]
    },
    {
        "id": "31",
        "name": "上海市",
        "option": [
            {"id": "83009", "name": "(83009)华东计算技术研究所"},
            {"id": "10274", "name": "(10274)上海海关学院"},
            {"id": "10264", "name": "(10264)上海海洋大学"},
            {"id": "10259", "name": "(10259)上海应用技术大学"},
            {"id": "10268", "name": "(10268)上海中医药大学"}
        ]
    },
    {
        "id": "33",
        "name": "浙江省",
        "option": [
            {"id": "11646", "name": "(11646)宁波大学"},
            {"id": "11647", "name": "(11647)浙江传媒学院"},
            {"id": "10345", "name": "(10345)浙江师范大学"}
        ]
    },
    {
        "id": "34",
        "name": "安徽省",
        "option": [
            {"id": "10378", "name": "(10378)安徽财经大学"},
            {"id": "10357", "name": "(10357)安徽大学"},
            {"id": "10878", "name": "(10878)安徽建筑大学"},
            {"id": "10879", "name": "(10879)安徽科技学院"},
            {"id": "10364", "name": "(10364)安徽农业大学"},
            {"id": "10369", "name": "(10369)安徽中医药大学"},
            {"id": "10372", "name": "(10372)安庆师范大学"},
            {"id": "10367", "name": "(10367)蚌埠医学院"},
            {"id": "10371", "name": "(10371)阜阳师范学院"},
            {"id": "14098", "name": "(14098)合肥师范学院"},
            {"id": "11059", "name": "(11059)合肥学院"},
            {"id": "91007", "name": "(91007)陆军炮兵防空兵学院"},
            {"id": "10368", "name": "(10368)皖南医学院"},
            {"id": "82604", "name": "(82604)中钢集团马鞍山矿山研究院"}
        ]
    },
    {
        "id": "35",
        "name": "福建省",
        "option": [
            {"id": "10394", "name": "(10394)福建师范大学"},
            {"id": "10392", "name": "(10392)福建医科大学"},
            {"id": "85303", "name": "(85303)国家海洋局第三海洋研究所"},
            {"id": "10385", "name": "(10385)华侨大学"},
            {"id": "10390", "name": "(10390)集美大学"},
            {"id": "10395", "name": "(10395)闽江学院"},
            {"id": "10399", "name": "(10399)泉州师范学院"},
            {"id": "10384", "name": "(10384)厦门大学"},
            {"id": "80403", "name": "(80403)厦门国家会计学院"},
            {"id": "11062", "name": "(11062)厦门理工学院"}
        ]
    },
    {
        "id": "37",
        "name": "山东省",
        "option": [
            {"id": "10440", "name": "(10440)滨州医学院"},
            {"id": "10427", "name": "(10427)济南大学"},
            {"id": "10443", "name": "(10443)济宁医学院"},
            {"id": "10447", "name": "(10447)聊城大学"},
            {"id": "10431", "name": "(10431)齐鲁工业大学"},
            {"id": "10429", "name": "(10429)青岛理工大学"},
            {"id": "10435", "name": "(10435)青岛农业大学"},
            {"id": "83115", "name": "(83115)山东非金属材料研究所"},
            {"id": "10908", "name": "(10908)山东工艺美术学院"},
            {"id": "11510", "name": "(11510)山东交通学院"},
            {"id": "10433", "name": "(10433)山东理工大学"},
            {"id": "10434", "name": "(10434)山东农业大学"},
            {"id": "14100", "name": "(14100)山东政法学院"},
            {"id": "10441", "name": "(10441)山东中医药大学"},
            {"id": "10438", "name": "(10438)潍坊医学院"},
            {"id": "10423", "name": "(10423)中国海洋大学"}
        ]
    },
    {
        "id": "41",
        "name": "河南省",
        "option": [
            {"id": "10479", "name": "(10479)安阳师范学院"},
            {"id": "10484", "name": "(10484)河南财经政法大学"},
            {"id": "10475", "name": "(10475)河南大学"},
            {"id": "10464", "name": "(10464)河南科技大学"},
            {"id": "10467", "name": "(10467)河南科技学院"},
            {"id": "10460", "name": "(10460)河南理工大学"},
            {"id": "10471", "name": "(10471)河南中医药大学"},
            {"id": "10078", "name": "(10078)华北水利水电大学"},
            {"id": "10481", "name": "(10481)南阳师范学院"},
            {"id": "10485", "name": "(10485)郑州航空工业管理学院"},
            {"id": "10462", "name": "(10462)郑州轻工业学院"},
            {"id": "86601", "name": "(86601)郑州烟草研究院"},
            {"id": "82907", "name": "(82907)中国空空导弹研究院"},
            {"id": "10465", "name": "(10465)中原工学院"}
        ]
    },
    {
        "id": "42",
        "name": "湖北省",
        "option": [
            {"id": "10489", "name": "(10489)长江大学"},
            {"id": "91016", "name": "(91016)海军工程大学"},
            {"id": "11600", "name": "(11600)湖北经济学院"},
            {"id": "10525", "name": "(10525)湖北汽车工业学院"},
            {"id": "10513", "name": "(10513)湖北师范大学"},
            {"id": "10929", "name": "(10929)湖北医药学院"},
            {"id": "10507", "name": "(10507)湖北中医药大学"},
            {"id": "91026", "name": "(91026)空军预警学院"},
            {"id": "11075", "name": "(11075)三峡大学"},
            {"id": "82709", "name": "(82709)武汉材料保护研究所"},
            {"id": "86217", "name": "(86217)武汉船舶通信研究所"},
            {"id": "10495", "name": "(10495)武汉纺织大学"},
            {"id": "10490", "name": "(10490)武汉工程大学"},
            {"id": "10522", "name": "(10522)武汉体育学院"},
            {"id": "89642", "name": "(89642)中共湖北省委党校"},
            {"id": "10520", "name": "(10520)中南财经政法大学"},
            {"id": "10524", "name": "(10524)中南民族大学"}
        ]
    },
    {
        "id": "44",
        "name": "广东省",
        "option": [
            {"id": "11847", "name": "(11847)佛山科学技术学院"},
            {"id": "10592", "name": "(10592)广东财经大学"},
            {"id": "11845", "name": "(11845)广东工业大学"},
            {"id": "10566", "name": "(10566)广东海洋大学"},
            {"id": "10588", "name": "(10588)广东技术师范学院"},
            {"id": "10588", "name": "(10588)广东技术师范学院"},
            {"id": "11540", "name": "(11540)广东金融学院"},
            {"id": "88901", "name": "(88901)广东省社会科学院"},
            {"id": "88911", "name": "(88911)广东省心血管病研究所"},
            {"id": "10573", "name": "(10573)广东药科大学"},
            {"id": "10571", "name": "(10571)广东医科大学"},
            {"id": "11078", "name": "(11078)广州大学"},
            {"id": "10570", "name": "(10570)广州医科大学"},
            {"id": "10572", "name": "(10572)广州中医药大学"},
            {"id": "10561", "name": "(10561)华南理工大学"},
            {"id": "12121", "name": "(12121)南方医科大学"},
            {"id": "10564", "name": "(10564)华南农业大学"},
            {"id": "10560", "name": "(10560)汕头大学"},
            {"id": "11349", "name": "(11349)五邑大学"},
            {"id": "10587", "name": "(10587)星海音乐学院"},
            {"id": "89644", "name": "(89644)中共广东省委党校"},
            {"id": "10558", "name": "(10558)中山大学"},
            {"id": "11347", "name": "(11347)仲恺农业工程学院"}
        ]
    },
    {
        "id": "45",
        "name": "广西壮族自治区",
        "option": [
            {"id": "11548", "name": "(11548)广西财经学院"},
            {"id": "10593", "name": "(10593)广西大学"},
            {"id": "10608", "name": "(10608)广西民族大学"},
            {"id": "10602", "name": "(10602)广西师范大学"},
            {"id": "10600", "name": "(10600)广西中医药大学"},
            {"id": "10600", "name": "(10600)广西中医药大学"},
            {"id": "10596", "name": "(10596)桂林理工大学"},
            {"id": "10595", "name": "(10595)桂林电子科技大学"}
        ]
    },
    {
        "id": "51",
        "name": "四川省",
        "option": [
            {"id": "1062", "name": "(10621)成都信息工程大学"},
            {"id": "10639", "name": "(10639)绵阳师范学院"},
            {"id": "10622", "name": "(10622)四川理工学院"},
            {"id": "10636", "name": "(10636)四川师范大学"},
            {"id": "10656", "name": "(10656)西南民族大学"},
            {"id": "83008", "name": "(83008)西南通信研究所(30所)"},
            {"id": "82906", "name": "(82906)中国航空研究院611所"},
            {"id": "10624", "name": "(10624)中国民用航空飞行学院"}
        ]
    },
    {
        "id": "52",
        "name": "贵州省",
        "option": [
            {"id": "10671", "name": "(10671)贵州财经大学"},
            {"id": "10672", "name": "(10672)贵州民族大学"},
            {"id": "10663", "name": "(10663)贵州师范大学"},
            {"id": "83286", "name": "(83286)中国航天科工集团第十研究院"}
        ]
    },
    {
        "id": "61",
        "name": "陕西省",
        "option": [
            {"id": "10710", "name": "(10710)长安大学"},
            {"id": "10708", "name": "(10708)陕西科技大学"},
            {"id": "10718", "name": "(10718)陕西师范大学"},
            {"id": "10716", "name": "(10716)陕西中医药大学"},
            {"id": "11560", "name": "(11560)西安财经学院"},
            {"id": "10701", "name": "(10701)西安电子科技大学"},
            {"id": "10709", "name": "(10709)西安工程大学"},
            {"id": "83109", "name": "(83109)西安机电信息技术研究所(212所)"},
            {"id": "83101", "name": "(83101)西安近代化学研究所(204所)"},
            {"id": "10700", "name": "(10700)西安理工大学"},
            {"id": "10729", "name": "(10729)西安美术学院"},
            {"id": "10727", "name": "(10727)西安体育学院"},
            {"id": "10724", "name": "(10724)西安外国语大学"},
            {"id": "83276", "name": "(83276)西安微电子技术研究所（航天771所）"},
            {"id": "11664", "name": "(11664)西安邮电大学"},
            {"id": "10697", "name": "(10697)西北大学"},
            {"id": "10699", "name": "(10699)西北工业大学"},
            {"id": "10726", "name": "(10726)西北政法大学"},
            {"id": "89661", "name": "(89661)中共陕西省委党校"},
            {"id": "83269", "name": "(83269)中国航天科技集团公司第五研究院西安分院"}

        ]
    },
    {
        "id": "62",
        "name": "甘肃省",
        "option": [
            {"id": "10735", "name": "(10735)甘肃中医药大学"},
            {"id": "10741", "name": "(10741)兰州财经大学"},
            {"id": "10732", "name": "(10732)兰州交通大学"},
            {"id": "10742", "name": "(10742)西北民族大学"},
            {"id": "10736", "name": "(10736)西北师范大学"}
        ]
    },
    {
        "id": "63",
        "name": "青海省",
        "option": [
            {"id": "10743", "name": "(10743)青海大学"},
            {"id": "10748", "name": "(10748)青海民族大学"},
            {"id": "10746", "name": "(10746)青海师范大学"}
        ]
    },
    {
        "id": "65",
        "name": "新疆维吾尔自治区",
        "option": [
            {"id": "10766", "name": "(10766)新疆财经大学"},
            {"id": "10755", "name": "(10755)新疆大学"},
            {"id": "10758", "name": "(10758)新疆农业大学"}
        ]
    }
]