$('#reportQuestionIdTrigger,#reportQuestionId').on("click", function () {
    if(!$('#reportQuestionId1Trigger').attr("data_id")){
        maskTip("请选择问题类别");
        return;
    }
    var level_code = $('#reportLevelTrigger').attr("data_id");
    var v= $('#reportQuestionId1Trigger').html();
    var reportLevel = $('#reportLevelTrigger').text();
    if(v == '违反政治纪律行为') {
        weekdayArr = [
            {name: "在重大原则问题上不同党中央保持一致", id: "1801"},
            {name: "公开发表危害党的言论", id: "54"},
            {name: "诋毁、诬蔑党和国家领导人、英模，歪曲历史", id: "1802"},
            {name: "在党内搞团团伙伙", id: "56"},
            {name: "自行其是搞山头主义拒不执行中央大政方针", id: "1803"},
            {name: "落实党中央决策部署打折扣、搞变通", id: "57"},
            {name: "对党不忠诚不老实、搞两面派、做两面人", id: "1804"},
            {name: "制造散布传播政治谣言，搞诬告陷害", id: "1805"},
            {name: "不按规定请示报告重大事项", id: "1806"},
            {name: "干扰巡视巡察或不落实整改要求", id: "1807"},
            {name: "对抗组织审查", id: "58"},
            {name: "参加反对党和政府的活动或组织", id: "55"},
            {name: "违反党和国家民族、宗教政策", id: "1808"},
            {name: "信仰宗教或组织参加迷信活动", id: "59"},
            {name: "叛逃及涉外活动中损害党和国家利益", id: "60"},
            {name: "不履行“两个责任”或履行不力", id: "1809"},
            {name: "无原则一团和气和违反政治规矩", id: "61"},
            {name: "违反党的优良传统和工作惯例", id: "1810"}
        ]
    } else if(v == '违反组织纪律行为') {
        if(reportLevel == '农村' || reportLevel == '社区'|| reportLevel == '其他') {
            weekdayArr = [
                {name: "违反民主集中制原则", id: "62"},
                {name: "不按要求请示报告个人有关事项", id: "63"},
                {name: "违规组织参加老乡会校友会战友会", id: "64"},
                {name: "在投票和选举中搞非组织活动", id: "66"},
                {name: "在人事劳动工作中违规谋利", id: "68"},
                {name: "侵犯党员权利", id: "65"},
                {name: "违规发展党员", id: "69"},
                {name: "违规办理出国证件和在境外脱离组织", id: "70"}
            ]
        } else {
            weekdayArr = [
                {name: "违反民主集中制原则", id: "62"},
                {name: "不按要求请示报告个人有关事项", id: "63"},
                {name: "违规组织参加老乡会校友会战友会", id: "64"},
                {name: "在投票和选举中搞非组织活动", id: "66"},
                {name: "违反干部选拔任用规定", id: "67"},
                {name: "在人事劳动工作中违规谋利", id: "68"},
                {name: "侵犯党员权利", id: "65"},
                {name: "违规发展党员", id: "69"},
                {name: "违规办理出国证件和在境外脱离组织", id: "70"}
            ]
        }
    } else if(v == '违反廉洁纪律行为') {
        if(reportLevel == '一般干部' || reportLevel == '农村' || reportLevel == '社区'|| reportLevel == '其他') {
            weekdayArr = [
                {name: "权权交易和纵容特定关系人以权谋私", id: "71"},
                {name: "违规收送礼品礼金、金融产品及宴请服务等", id: "72"},
                {name: "借用管理服务对象财物或通过民间借贷等获取大额回报", id: "1811"},
                {name: "违规操办婚丧喜庆事宜", id: "73"},
                {name: "违规从事营利活动", id: "74"},
                {name: "违规占有使用公私财物", id: "76"},
                {name: "违规参与公款宴请消费", id: "77"},
                {name: "违规自定薪酬和发放津贴补贴奖金", id: "78"},
                {name: "公款旅游", id: "79"},
                {name: "违反公务接待管理规定", id: "80"},
                {name: "违反公务用车管理规定", id: "81"},
                {name: "违反会议活动管理规定", id: "82"},
                {name: "违反办公用房管理规定", id: "83"},
                {name: "权色钱色交易", id: "84"},
                {name: "其他违反廉洁纪律行为", id: "85"}
            ]
        } else {
            weekdayArr = [
                {name: "权权交易和纵容特定关系人以权谋私", id: "71"},
                {name: "违规收送礼品礼金、金融产品及宴请服务等", id: "72"},
                {name: "借用管理服务对象财物或通过民间借贷等获取大额回报", id: "1811"},
                {name: "违规操办婚丧喜庆事宜", id: "73"},
                {name: "违规从事营利活动", id: "74"},
                {name: "违反工作生活待遇规定", id: "75"},
                {name: "违规占有使用公私财物", id: "76"},
                {name: "违规参与公款宴请消费", id: "77"},
                {name: "违规自定薪酬和发放津贴补贴奖金", id: "78"},
                {name: "公款旅游", id: "79"},
                {name: "违反公务接待管理规定", id: "80"},
                {name: "违反公务用车管理规定", id: "81"},
                {name: "违反会议活动管理规定", id: "82"},
                {name: "违反办公用房管理规定", id: "83"},
                {name: "权色钱色交易", id: "84"},
                {name: "其他违反廉洁纪律行为", id: "85"}
            ]
        }
    } else if(v == '违反群众纪律行为') {
        weekdayArr = [
            {name: "侵害群众利益", id: "86"},
            {name: "利用宗族黑恶势力等欺压群众或充当“保护伞”", id: "1812"},
            {name: "漠视群众利益", id: "87"},
            {name: "搞形象工程、政绩工程", id: "106"},
            {name: "侵犯群众知情权", id: "88"},
            {name: "其他违反群众纪律行为", id: "89"}
        ]
    } else if(v == '违反工作纪律行为') {
        if(reportLevel == '一般干部' || reportLevel == '农村' || reportLevel == '社区'|| reportLevel == '其他') {
            weekdayArr = [
                {name: "工作中搞形式主义、官僚主义", id: "1813"},
                {name: "泄露扩散窃取私存党的秘密", id: "93"},
                {name: "违反考试录取工作规定", id: "94"},
                {name: "其他违反工作纪律行为", id: "95"}
            ]
        } else {
            weekdayArr = [
                {name: "工作中搞形式主义、官僚主义", id: "1813"},
                {name: "违规干预市场经济活动", id: "91"},
                {name: "违规干预司法活动执纪执法活动", id: "92"},
                {name: "泄露扩散窃取私存党的秘密", id: "93"},
                {name: "违反考试录取工作规定", id: "94"},
                {name: "其他违反工作纪律行为", id: "95"}
            ]
        }
    } else if(v == '违反生活纪律行为') {
        weekdayArr = [
            {name: "生活奢靡、贪图享受、追求低级趣味", id: "96"},
            {name: "不正当性关系", id: "97"},
            {name: "不重视家风建设、对配偶、子女及其配偶失管失教", id: "1814"},
            {name: "违背公序良俗", id: "1815"},
            {name: "其他违反生活纪律行为", id: "98"}
        ]
    } else if(v == '贪污贿赂类行为') {
        weekdayArr = [
            {name: "贪污", id: "107"},
            {name: "挪用公款", id: "108"},
            {name: "受贿", id: "109"},
            {name: "行贿", id: "110"},
            {name: "巨额财产来源不明", id: "111"},
            {name: "非国家工作人员受贿", id: "1816"},
            {name: "其他贪污贿赂行为", id: "112"}
        ]
    } else if(v == '滥用职权类行为') {
        weekdayArr = [
            {name: "滥用职权", id: "113"},
            {name: "国有企事业人员滥用职权", id: "1817"},
            {name: "报复陷害", id: "1818"},
            {name: "挪用特定款物", id: "1819"},
            {name: "其他滥用职权类行为", id: "117"}
        ]
    }else if(v == '玩忽职守类行为') {
        weekdayArr = [
            {name: "玩忽职守", id: "114"},
            {name: "国有企事业人员失职", id: "1820"},
            {name: "环境监管失职", id: "1821"},
            {name: "其他玩忽职守类行为", id: "1822"}
        ]
    }else if(v == '徇私舞弊类行为') {
        weekdayArr = [
            {name: "徇私舞弊低价折股、出售国有资产", id: "1823"},
            {name: "非法批准征收、征用、占用土地", id: "1824"},
            {name: "非法低价出让国有土地使用权", id: "1825"},
            {name: "非法经营同类营业和为亲友非法牟利", id: "120"},
            {name: "招收公务员、学生徇私舞弊", id: "1826"},
            {name: "其他徇私舞弊类行为", id: "1827"}
        ]
    } else if(v == '重大责任事故类行为') {
        weekdayArr = [
            {name: "重大责任事故", id: "1828"},
            {name: "不报、谎报安全事故", id: "1829"},
            {name: "工程重大安全事故", id: "1830"},
            {name: "其他重大责任事故类行为", id: "1831"}
        ]
    } else if(v == '行使公权力过程中发生的其他违法犯罪行为') {
        weekdayArr = [
            {name: "破坏选举", id: "1832"},
            {name: "非法转让、倒卖土地使用权", id: "1833"},
            {name: "职务侵占", id: "118"},
            {name: "挪用资金", id: "1834"},
            {name: "其他行使公权力过程中发生的其他违法犯罪行为", id: "1835"}
        ]
    } else if(v == '其他违法犯罪行为') {
        weekdayArr = [
            {name: "其他违法犯罪行为", id: "124"}
        ]
    }
    mobileSelect('#reportQuestionIdTrigger', '选择问题细类',weekdayArr)
})

