__ucap__ = {
  "service": [
    {
      "id": "ZAE0001",
      "n": "林木种子生产经营许可证申请",
      "t": 2,
      "c": "360000",
      "s": "提供江西省南昌市林木种子生产经营许可在线申请办理的功能",
      "i": "100"
    },
    {
      "id": "ZAA0001",
      "n": "律师事务所查询",
      "t": 2,
      "c": "all",
      "s": "提供查询全国范围内的律师事务所地址以及联系方式",
      "i": "96"
    },
    {
      "id": "HAB0005",
      "n": "领事保护-应急电话",
      "t": 2,
      "c": "all",
      "s": "提供驻外领事馆及应急电话查询服务。",
      "i": "95"
    },
    {
      "id": "IAC0017",
      "n": "知识产权投诉举报",
      "t": 2,
      "c": "all",
      "s": "提供全国知识产权举报与维权援助服务",
      "i": "94"
    },
    {
      "id": "CAG0005",
      "n": "国（境）外学历学位认证证书查询",
      "t": 2,
      "c": "all",
      "s": "可以对国（境）外学历学位认证结果进行查询",
      "i": "93"
    },
    {
      "id": "IAC0016",
      "n": "非法出版活动举报",
      "t": 2,
      "c": "all",
      "s": "对违法违规行为的出版物进行举报。",
      "i": "92"
    },
    {
      "id": "IAC0011",
      "n": "涉枪涉爆犯罪举报",
      "t": 2,
      "c": "all",
      "s": "对涉枪涉爆犯罪线索进行举报服务",
      "i": "91"
    },
    {
      "id": "IAC0013",
      "n": "住房城乡建设违法举报",
      "t": 2,
      "c": "all",
      "s": "对住房城乡建设领域违法违规行为进行举报",
      "i": "87"
    },
    {
      "id": "IAC0007",
      "n": "中央网信办违法和不良信息举报",
      "t": 2,
      "c": "all",
      "s": "对互联网上违法内容和不良信息进行举报及查看举报处理情况的服务。",
      "i": "86"
    },
    {
      "id": "IAC0014",
      "n": "检察干警违法违纪举报",
      "t": 2,
      "c": "all",
      "s": "对检察机关和检察干警违法违纪的举报服务",
      "i": "85"
    },
    {
      "id": "IAC0015",
      "n": "最高人民检察院职务犯罪举报",
      "t": 2,
      "c": "all",
      "s": "对检察机关管辖的职务犯罪举报服务",
      "i": "84"
    },
    {
      "id": "HAB0004",
      "n": "恢复中国国籍审批初审",
      "t": 2,
      "c": "110000",
      "s": "提供恢复中国国籍审批初审预约及查询服务",
      "i": "83"
    },
    {
      "id": "HAB0003",
      "n": "退出中国国籍审批初审",
      "t": 2,
      "c": "110000",
      "s": "提供退出中国国籍审批初审预约及查询服务",
      "i": "82"
    },
    {
      "id": "HAB0002",
      "n": "加入中国国籍审批初审预约",
      "t": 2,
      "c": "110000",
      "s": "提供加入中国国籍审批初审预约及查询服务",
      "i": "81"
    },
    {
      "id": "IAC0012",
      "n": "境外非政府组织办事违法举报",
      "t": 2,
      "c": "all",
      "s": "提供对境外非政府违法组织、活动、人员、地点、网站等办事服务举报服务",
      "i": "80"
    },
    {
      "id": "IAC0009",
      "n": "反腐败国际追逃追赃线索举报",
      "t": 2,
      "c": "all",
      "s": "提供反腐败国际追逃追赃线索举报服务",
      "i": "78"
    },
    {
      "id": "IAG0010",
      "n": "网络违法犯罪举报",
      "t": 2,
      "c": "all",
      "s": "对利用互联网或针对网络信息系统从事违法犯罪行为进行举报",
      "i": "79"
    },
    {
      "id": "IAC0008",
      "n": "全国文化市场举报平台",
      "t": 2,
      "c": "all",
      "s": "提供违反文化市场法律法规的违法行为进行举报投诉的服务。",
      "i": "13"
    },
    {
      "id": "IAG0001",
      "n": "纪检监察机关举报网站",
      "t": 2,
      "c": "all",
      "s": "提供对党组织、党员违反党的纪律行为的检举控告服务。",
      "i": "75"
    },
    {
      "id": "HAB0001",
      "n": "外国人在华永久居留身份证",
      "t": 2,
      "c": "110000",
      "s": "提供外国人在华永久居留身份证初审预约及查询服务",
      "i": "11"
    },
    {
      "id": "DAA0009",
      "n": "安徽省预约挂号平台",
      "t": 2,
      "c": "340000",
      "s": "提供对安徽省在线预约挂号服务。包括注册、登录、医院查询、余号量查询、预约挂号、预约记录查询等服务。",
      "i": "50"
    },
    {
      "id": "DAA0008",
      "n": "山西省预约挂号平台",
      "t": 2,
      "c": "140000",
      "s": "提供对山西省在线预约挂号服务。包括注册、登录、医院查询、余号量查询、预约挂号、预约记录查询等服务。",
      "i": "74"
    },
    {
      "id": "DAA0007",
      "n": "江西省预约挂号平台",
      "t": 2,
      "c": "360000",
      "s": "提供对江西省在线预约挂号服务。包括注册、登录、医院查询、余号量查询、预约挂号、预约记录查询等服务。",
      "i": "69"
    },
    {
      "id": "BAF0001",
      "n": "人力资源和社会保障办事大厅",
      "t": 2,
      "c": "310000",
      "s": "提供对上海市城镇职工养老保险信息，公共服务信息、人事人才以及其他信息的查询。",
      "i": "73"
    },
    {
      "id": "HAA0001",
      "n": "护照办理",
      "t": 2,
      "c": "130000,320000,460000,610000,650000,230000,510000,520000,420000,340000,360000,530000,630000,540000,640000,410000",
      "s": "提供16个省出入境护照办理预约申请、申请信息查询服务",
      "i": "72"
    },
    {
      "id": "GAB0003",
      "n": "景区查询",
      "t": 2,
      "c": "460000",
      "s": "提供海南省旅游景点查询服务",
      "i": "71"
    },
    {
      "id": "BAE0001",
      "n": "社保费缴费计算器",
      "t": 2,
      "c": "460000",
      "s": "海南省社保缴费计算器",
      "i": "70"
    },
    {
      "id": "BAB0002",
      "n": "上海市公积金查询",
      "t": 2,
      "c": "310000",
      "s": "提供对上海市行政区域内职工公积金缴纳信息查询。",
      "i": "68"
    },
    {
      "id": "AAC0004",
      "n": "火车正晚点查询",
      "t": 2,
      "c": "all",
      "s": "提供对火车正晚点信息的查询",
      "i": "67"
    },
    {
      "id": "DAA0006",
      "n": "内蒙古预约挂号平台",
      "t": 2,
      "c": "150000",
      "s": "提供对内蒙古自治区在线预约挂号服务。包括注册、登录、医院查询、余号量查询、预约挂号、预约记录查询等服务。",
      "i": "66"
    },
    {
      "id": "DAA0005",
      "n": "甘肃省预约挂号平台",
      "t": 2,
      "c": "620000",
      "s": "提供对甘肃省在线预约挂号服务。包括注册、登录、医院查询、余号量查询、预约挂号、预约记录查询等服务。",
      "i": "65"
    },
    {
      "id": "DAA0004",
      "n": "陕西省预约挂号平台",
      "t": 2,
      "c": "610000",
      "s": "提供对陕西省在线预约挂号服务。包括注册、登录、医院查询、余号量查询、预约挂号、预约记录查询等服务。",
      "i": "64"
    },
    {
      "id": "DAA0003",
      "n": "山东省预约挂号平台",
      "t": 2,
      "c": "370000",
      "s": "提供对山东省在线预约挂号服务。包括注册、登录、医院查询、余号量查询、预约挂号、预约记录查询等服务。",
      "i": "63"
    },
    {
      "id": "KAD0003",
      "n": "企业税计算",
      "t": 2,
      "c": "all",
      "s": "提供全国范围内，企业所得税应纳税所得额计算服务。",
      "i": "53"
    },
    {
      "id": "KAD0004",
      "n": "个人所得税计算",
      "t": 2,
      "c": "all",
      "s": "提供对个人所得税的计算服务",
      "i": "54"
    },
    {
      "id": "KAD0005",
      "n": "营业税计算",
      "t": 2,
      "c": "all",
      "s": "提供对营业税的计算服务",
      "i": "55"
    },
    {
      "id": "KAD0002",
      "n": "房产税计算",
      "t": 2,
      "c": "all",
      "s": "提供对房产税计算的服务",
      "i": "52"
    },
    {
      "id": "IAJ0001",
      "n": "侵权盗版举报",
      "t": 2,
      "c": "all",
      "s": "提供侵权盗版的违法行为举报服务。",
      "i": "56"
    },
    {
      "id": "KAD0001",
      "n": "湖南省个税计算器",
      "t": 2,
      "c": "430000",
      "s": "提供湖南省个税缴纳计算器（工资薪酬）在线计算服务。",
      "i": "51"
    },
    {
      "id": "LAC0001",
      "n": "建筑业企业资质审批结果查询",
      "t": 2,
      "c": "all",
      "s": "可查询建筑业企业资质审批结果信息",
      "i": "57"
    },
    {
      "id": "CAG0003",
      "n": "建设工程企业资质证书查询",
      "t": 2,
      "c": "all",
      "s": "提供对北京市建设工程企业资质证书的查询",
      "i": "58"
    },
    {
      "id": "CAG0004",
      "n": "工程监理企业资质证书查询",
      "t": 2,
      "c": "all",
      "s": "可查询建筑业企业资质审批结果信息",
      "i": "59"
    },
    {
      "id": "LAD0001",
      "n": "国务院已公布取消的职业资格许可和认定事项查询",
      "t": 2,
      "c": "all",
      "s": "可查询国务院已公布取消的职业资格许可和认定事项信息",
      "i": "60"
    },
    {
      "id": "ZAQ0001",
      "n": "重名查询",
      "t": 2,
      "c": "220000,320000,460000,410000,140000",
      "s": "提供同名查询的服务",
      "i": "50"
    },
    {
      "id": "LAD0002",
      "n": "国务院取消和下放的行政审批事项",
      "t": 2,
      "c": "all",
      "s": "可查询国务院取消和下放的行政审批事项信息",
      "i": "61"
    },
    {
      "id": "YAB0001",
      "n": "司法所查询",
      "t": 2,
      "c": "110000",
      "s": "提供北京市16个市辖区司法所查询。",
      "i": "62"
    },
    {
      "id": "LAB0001",
      "n": "全国行政区划信息查询",
      "t": 2,
      "c": "all",
      "s": "可查询全国行政区划信息",
      "i": "49"
    },
    {
      "id": "AAD0002",
      "n": "河南省高速公路通行费查询",
      "t": 2,
      "c": "410000",
      "s": "提供对河南省高速公路通行费用信息的计算查询",
      "i": "48"
    },
    {
      "id": "AAD0001",
      "n": "青海客运班线信息查询",
      "t": 2,
      "c": "630000",
      "s": "提供对青海省的客运班线信息的查询",
      "i": "47"
    },
    {
      "id": "LAA0001",
      "n": "贵州省网上办事大厅",
      "t": 2,
      "c": "520000",
      "s": "提供对贵州省的政务网上预约及预约查服务",
      "i": "46"
    },
    {
      "id": "DAA0002",
      "n": "河南省预约挂号平台",
      "t": 2,
      "c": "410000",
      "s": "提供对河南省在线预约挂号服务。包括注册、登录、医院查询、余号量查询、预约挂号、预约记录查询等服务。",
      "i": "44"
    },
    {
      "id": "AAA0004",
      "n": "机动车报废查询",
      "t": 2,
      "c": "all",
      "s": "提供全国31个省市的车辆报废信息查询服务",
      "i": "43"
    },
    {
      "id": "BAD0001",
      "n": "北京市积分落户",
      "t": 2,
      "c": "110000",
      "s": "提供北京市行政区域内职工积分落户计算器。",
      "i": "42"
    },
    {
      "id": "DAB0003",
      "n": "全国医疗机构查询",
      "t": 2,
      "c": "all",
      "s": "提供对全国范围内医疗机构信息的查询",
      "i": "40"
    },
    {
      "id": "KAC0001",
      "n": "税务事务所查询",
      "t": 2,
      "c": "all",
      "s": "对全国税务事务所进行查询",
      "i": "39"
    },
    {
      "id": "DAB0002",
      "n": "异地就医经办机构查询",
      "t": 2,
      "c": "all",
      "s": "提供对全国范围内的异地就医经办机构信息的查询",
      "i": "38"
    },
    {
      "id": "DAB0001",
      "n": "异地定点医疗机构查询",
      "t": 2,
      "c": "all",
      "s": "提供对全国范围内的异地定点医疗机构信息的查询",
      "i": "37"
    },
    {
      "id": "AAA0002",
      "n": "车检计算器",
      "t": 2,
      "c": "all",
      "s": "提供对车检政策的24小时在线查询计算服务",
      "i": "36"
    },
    {
      "id": "CAF0003",
      "n": "全国计算机等级考试（NCRE）成绩查询",
      "t": 2,
      "c": "all",
      "s": "可查询全国计算机等级考试信息",
      "i": "35"
    },
    {
      "id": "CAC0001",
      "n": "学位查询",
      "t": 2,
      "c": "all",
      "s": "查询中国境内各学位授予单位颁发的各级各类学位证书相关信息。",
      "i": "19"
    },
    {
      "id": "XAB0001",
      "n": "失信被执行人查询",
      "t": 2,
      "c": "all",
      "s": "对失信被执行人进行查询",
      "i": "26"
    },
    {
      "id": "CAJ0001",
      "n": "中小学教师资格考试合格证明(NTCE)查询",
      "t": 2,
      "c": "all",
      "s": "对中小学教师资格考试合格证明查询",
      "i": "20"
    },
    {
      "id": "KAB0001",
      "n": "重大税收违法案件当事人名单查询",
      "t": 2,
      "c": "all",
      "s": "对政府采购严重违法失信名单进行查询",
      "i": "27"
    },
    {
      "id": "IAE0002",
      "n": "旅游投诉查询",
      "t": 2,
      "c": "all",
      "s": "为游客提供7x24专业、高效的旅游投诉服务",
      "i": "33"
    },
    {
      "id": "GAB0002",
      "n": "北京A级景区虚拟旅游",
      "t": 2,
      "c": "110000",
      "s": "提供对北京A级景区虚拟旅游在线视频观看的服务",
      "i": "32"
    },
    {
      "id": "KAA0001",
      "n": "出口退税率查询",
      "t": 2,
      "c": "all",
      "s": "可进行商品的出口退税率在线查询服务。",
      "i": "31"
    },
    {
      "id": "EAC0001",
      "n": "上海市结婚登记网上预约",
      "t": 2,
      "c": "310000",
      "s": "提供上海市结婚登记预约服务包括国内、涉外，可对预约信息信息查询",
      "i": "29"
    },
    {
      "id": "EAA0001",
      "n": "北京市婚姻登记预约",
      "t": 2,
      "c": "110000",
      "s": "提供北京市婚姻登记预约服务",
      "i": "13"
    },
    {
      "id": "AAE0001",
      "n": "北京市停车场位查询",
      "t": 2,
      "c": "110000",
      "s": "提供对北京市备案停车场位信息的查询",
      "i": "28"
    },
    {
      "id": "CAF0001",
      "n": "全国普通话考试成绩查询",
      "t": 2,
      "c": "all",
      "s": "提供全国普通话测试成绩结果查询",
      "i": "11"
    },
    {
      "id": "BAB0001",
      "n": "北京公积金服务",
      "t": 2,
      "c": "110000",
      "s": "提供对北京市行政区域内职工公积金缴纳信息查询。",
      "i": "07"
    },
    {
      "id": "CAG0001",
      "n": "全国普通话考试证书查询",
      "t": 2,
      "c": "all",
      "s": "提供全国普通话证书查询",
      "i": "13"
    },
    {
      "id": "AAG0000",
      "n": "小客车摇号查询",
      "t": 2,
      "c": "110000,120000,330100,440300,440100,520100",
      "s": "提供对小客车摇号中签结果的查询",
      "i": "05"
    },
    {
      "id": "DAA0001",
      "n": "北京市预约挂号服务",
      "t": 2,
      "c": "110000",
      "s": "提供对北京市在线预约挂号服务。包括注册、登录、医院查询、余号量查询、预约挂号、预约记录查询等服务。",
      "i": "02"
    },
    {
      "id": "XAA0003",
      "n": "政府采购严重违法失信名单查询 ",
      "t": 2,
      "c": "all",
      "s": "对重大税收违法案件当事人名单进行查询",
      "i": "25"
    },
    {
      "id": "XAA0002",
      "n": "企业经营异常名录",
      "t": 2,
      "c": "all",
      "s": "对企业经营异常名录进行查询",
      "i": "15"
    },
    {
      "id": "XAA0001",
      "n": "统一社会信用代码查询",
      "t": 2,
      "c": "all",
      "s": "对统一社会信用代码进行查询",
      "i": "07"
    },
    {
      "id": "IAC0006",
      "n": "举报垃圾短信进度查询",
      "t": 2,
      "c": "all",
      "s": "提供互联网、电信网等各种形式信息通信网络及电信业务中举报垃圾短信的服务。",
      "i": "24"
    },
    {
      "id": "IAC0005",
      "n": "举报个人信息泄露",
      "t": 2,
      "c": "all",
      "s": "提供互联网、电信网等各种形式信息通信网络及电信业务中举报不良网站的服务。",
      "i": "23"
    },
    {
      "id": "IAC0004",
      "n": "举报网站",
      "t": 2,
      "c": "all",
      "s": "提供互联网、电信网等各种形式信息通信网络及电信业务中举报不良网站的服务。",
      "i": "22"
    },
    {
      "id": "IAC0003",
      "n": "举报骚扰电话",
      "t": 2,
      "c": "all",
      "s": "提供互联网、电信网等各种形式信息通信网络及电信业务中举报骚扰电话的服务。",
      "i": "21"
    },
    {
      "id": "IAC0002",
      "n": "举报诈骗电话",
      "t": 2,
      "c": "all",
      "s": "提供互联网、电信网等各种形式信息通信网络及电信业务中举报诈骗电话的服务。",
      "i": "16"
    },
    {
      "id": "IAI0001",
      "n": "全国12315互联网平台查询",
      "t": 2,
      "c": "all",
      "s": "提供消费者投诉或举报互联网经营者的服务。",
      "i": "12"
    },
    {
      "id": "IAC0001",
      "n": "举报垃圾短信",
      "t": 2,
      "c": "all",
      "s": "提供互联网、电信网等各种形式信息通信网络及电信业务中举报垃圾短信的服务。",
      "i": "14"
    },
    {
      "id": "AAC0003",
      "n": "火车余票查询",
      "t": 2,
      "c": "all",
      "s": "提供对火车票余票信息的查询",
      "i": "10"
    },
    {
      "id": "AAC0001",
      "n": "火车时刻表查询",
      "t": 2,
      "c": "all",
      "s": "提供对火车时刻表信息的查询",
      "i": "08"
    },
    {
      "id": "AAC0002",
      "n": "火车票起售时间查询",
      "t": 2,
      "c": "all",
      "s": "提供各地车站车票起售时间的查询。",
      "i": "09"
    },
    {
      "id": "YAA0001",
      "n": "商务行政法规查询",
      "t": 2,
      "c": "all",
      "s": "针对全国商务行政法规查询",
      "i": "17"
    },
    {
      "id": "CAB0001",
      "n": "学历证书查询",
      "t": 2,
      "c": "all",
      "s": "查询国家承认的高等教育学历信息",
      "i": "06"
    },
    {
      "id": "BAA0001",
      "n": "北京社保信息查询",
      "t": 2,
      "c": "110000",
      "s": "提供对北京市行政区域内职工社会保险信息的查询。",
      "i": "01"
    },
    {
      "id": "AAA0001",
      "n": "车辆违章查询",
      "t": 2,
      "c": "all",
      "s": "提供全国31个省市的车辆违章情况查询服务",
      "i": "03"
    },
    {
      "id": "AAB0001",
      "n": "驾照扣分查询",
      "t": 2,
      "c": "all",
      "s": "提供全国31个省市驾驶证扣分查询服务",
      "i": "04"
    }
  ],
  "$version": 1555999584734,
  "serviceCategory": [
    {
      "category": "A",
      "name": "交通"
    },
    {
      "category": "B",
      "name": "社会保障"
    },
    {
      "category": "C",
      "name": "教育"
    },
    {
      "category": "D",
      "name": "医疗卫生"
    },
    {
      "category": "E",
      "name": "民政"
    },
    {
      "category": "H",
      "name": "出境入境"
    },
    {
      "category": "G",
      "name": "旅游"
    },
    {
      "category": "I",
      "name": "举报投诉"
    },
    {
      "category": "K",
      "name": "税收服务"
    },
    {
      "category": "X",
      "name": "信用"
    },
    {
      "category": "Y",
      "name": "法规查询"
    },
    {
      "category": "L",
      "name": "政务服务"
    },
    {
      "category": "Z",
      "name": "其他"
    }
  ],
  "serviceKeywords": [
    {
      "id": "BAA0001",
      "name": "北京社保信息查询"
    },
    {
      "id": "AAA0001",
      "name": "机动车违章查询"
    },
    {
      "id": "DAA0001",
      "name": "北京市预约挂号服务"
    },
    {
      "id": "AAB0001",
      "name": "驾照扣分查询"
    },
    {
      "id": "DAB0003",
      "name": "全国医疗机构查询"
    }
  ]
};