let areaList = [{
    "name": "北京",
    "id": "0001",
    "childs": [{
        "name": "北京市",
        "id": "000101",
        "childs": [{"name": "东城区", "id": "00010101"}, {"name": "西城区", "id": "00010102"}, {
            "name": "朝阳区",
            "id": "00010103"
        }, {"name": "石景山区", "id": "00010104"}, {"name": "海淀区", "id": "00010105"}, {
            "name": "门头沟区",
            "id": "00010106"
        }, {"name": "房山区", "id": "00010107"}, {"name": "通州区", "id": "00010108"}, {
            "name": "顺义区",
            "id": "00010109"
        }, {"name": "昌平区", "id": "00010110"}, {"name": "大兴区", "id": "00010111"}, {
            "name": "怀柔区",
            "id": "00010112"
        }, {"name": "平谷区", "id": "00010113"}, {"name": "密云县", "id": "00010114"}, {"name": "延庆县", "id": "00010115"}]
    }]
}, {
    "name": "天津",
    "id": "0002",
    "childs": [{
        "name": "天津市",
        "id": "000201",
        "childs": [{"name": "和平区", "id": "00020101"}, {"name": "河东区", "id": "00020102"}, {
            "name": "河西区",
            "id": "00020103"
        }, {"name": "南开区", "id": "00020104"}, {"name": "河北区", "id": "00020105"}, {
            "name": "红桥区",
            "id": "00020106"
        }, {"name": "东丽区", "id": "00020107"}, {"name": "西青区", "id": "00020108"}, {
            "name": "津南区",
            "id": "00020109"
        }, {"name": "北辰区", "id": "00020110"}, {"name": "武清区", "id": "00020111"}, {
            "name": "宝坻区",
            "id": "00020112"
        }, {"name": "滨海新区", "id": "00020113"}, {"name": "宁河县", "id": "00020114"}, {
            "name": "静海县",
            "id": "00020115"
        }, {"name": "蓟县", "id": "00020116"}]
    }]
}, {
    "name": "上海",
    "id": "0009",
    "childs": [{
        "name": "上海市",
        "id": "000901",
        "childs": [{"name": "黄浦区", "id": "00090101"}, {"name": "徐汇区", "id": "00090102"}, {
            "name": "长宁区",
            "id": "00090103"
        }, {"name": "静安区", "id": "00090104"}, {"name": "普陀区", "id": "00090105"}, {
            "name": "闸北区",
            "id": "00090106"
        }, {"name": "虹口区", "id": "00090107"}, {"name": "杨浦区", "id": "00090108"}, {
            "name": "闵行区",
            "id": "00090109"
        }, {"name": "宝山区", "id": "00090110"}, {"name": "嘉定区", "id": "00090111"}, {
            "name": "浦东新区",
            "id": "00090112"
        }, {"name": "金山区", "id": "00090113"}, {"name": "松江区", "id": "00090114"}, {
            "name": "青浦区",
            "id": "00090115"
        }, {"name": "奉贤区", "id": "00090116"}, {"name": "崇明县", "id": "00090117"}]
    }]
}, {
    "name": "重庆",
    "id": "0022",
    "childs": [{
        "name": "重庆市",
        "id": "002201",
        "childs": [{"name": "万州区", "id": "00220101"}, {"name": "涪陵区", "id": "00220102"}, {
            "name": "渝中区",
            "id": "00220103"
        }, {"name": "大渡口区", "id": "00220104"}, {"name": "江北区", "id": "00220105"}, {
            "name": "沙坪坝区",
            "id": "00220106"
        }, {"name": "九龙坡区", "id": "00220107"}, {"name": "南岸区", "id": "00220108"}, {
            "name": "北碚区",
            "id": "00220109"
        }, {"name": "綦江区", "id": "00220110"}, {"name": "大足区", "id": "00220111"}, {
            "name": "渝北区",
            "id": "00220112"
        }, {"name": "巴南区", "id": "00220113"}, {"name": "黔江区", "id": "00220114"}, {
            "name": "长寿区",
            "id": "00220115"
        }, {"name": "江津区", "id": "00220116"}, {"name": "合川区", "id": "00220117"}, {
            "name": "永川区",
            "id": "00220118"
        }, {"name": "南川区", "id": "00220119"}, {"name": "璧山区", "id": "00220120"}, {
            "name": "铜梁区",
            "id": "00220121"
        }, {"name": "潼南县", "id": "00220122"}, {"name": "荣昌县", "id": "00220123"}, {
            "name": "梁平县",
            "id": "00220124"
        }, {"name": "城口县", "id": "00220125"}, {"name": "丰都县", "id": "00220126"}, {
            "name": "垫江县",
            "id": "00220127"
        }, {"name": "武隆县", "id": "00220128"}, {"name": "忠县", "id": "00220129"}, {
            "name": "开县",
            "id": "00220130"
        }, {"name": "云阳县", "id": "00220131"}, {"name": "奉节县", "id": "00220132"}, {
            "name": "巫山县",
            "id": "00220133"
        }, {"name": "巫溪县", "id": "00220134"}, {"name": "石柱土家族自治县", "id": "00220135"}, {
            "name": "秀山土家族苗族自治县",
            "id": "00220136"
        }, {"name": "酉阳土家族苗族自治县", "id": "00220137"}, {"name": "彭水苗族土家族自治县", "id": "00220138"}]
    }]
}, {
    "name": "河北省",
    "id": "0003",
    "childs": [{
        "name": "石家庄市",
        "id": "000301",
        "childs": [{"name": "长安区", "id": "00030101"}, {"name": "桥西区", "id": "00030102"}, {
            "name": "新华区",
            "id": "00030103"
        }, {"name": "井陉矿区", "id": "00030104"}, {"name": "裕华区", "id": "00030105"}, {
            "name": "藁城区",
            "id": "00030106"
        }, {"name": "鹿泉区", "id": "00030107"}, {"name": "栾城区", "id": "00030108"}, {
            "name": "井陉县",
            "id": "00030109"
        }, {"name": "正定县", "id": "00030110"}, {"name": "行唐县", "id": "00030111"}, {
            "name": "灵寿县",
            "id": "00030112"
        }, {"name": "高邑县", "id": "00030113"}, {"name": "深泽县", "id": "00030114"}, {
            "name": "赞皇县",
            "id": "00030115"
        }, {"name": "无极县", "id": "00030116"}, {"name": "平山县", "id": "00030117"}, {
            "name": "元氏县",
            "id": "00030118"
        }, {"name": "赵县", "id": "00030119"}, {"name": "辛集市", "id": "00030120"}, {
            "name": "晋州市",
            "id": "00030121"
        }, {"name": "新乐市", "id": "00030122"}]
    }, {
        "name": "唐山市",
        "id": "000302",
        "childs": [{"name": "路南区", "id": "00030201"}, {"name": "路北区", "id": "00030202"}, {
            "name": "古冶区",
            "id": "00030203"
        }, {"name": "开平区", "id": "00030204"}, {"name": "丰南区", "id": "00030205"}, {
            "name": "丰润区",
            "id": "00030206"
        }, {"name": "曹妃甸区", "id": "00030207"}, {"name": "滦县", "id": "00030208"}, {
            "name": "滦南县",
            "id": "00030209"
        }, {"name": "乐亭县", "id": "00030210"}, {"name": "迁西县", "id": "00030211"}, {
            "name": "玉田县",
            "id": "00030212"
        }, {"name": "遵化市", "id": "00030213"}, {"name": "迁安市", "id": "00030214"}]
    }, {
        "name": "秦皇岛市",
        "id": "000303",
        "childs": [{"name": "海港区", "id": "00030301"}, {"name": "山海关区", "id": "00030302"}, {
            "name": "北戴河区",
            "id": "00030303"
        }, {"name": "青龙满族自治县", "id": "00030304"}, {"name": "昌黎县", "id": "00030305"}, {
            "name": "抚宁县",
            "id": "00030306"
        }, {"name": "卢龙县", "id": "00030307"}]
    }, {
        "name": "邯郸市",
        "id": "000304",
        "childs": [{"name": "邯山区", "id": "00030401"}, {"name": "丛台区", "id": "00030402"}, {
            "name": "复兴区",
            "id": "00030403"
        }, {"name": "峰峰矿区", "id": "00030404"}, {"name": "邯郸县", "id": "00030405"}, {
            "name": "临漳县",
            "id": "00030406"
        }, {"name": "成安县", "id": "00030407"}, {"name": "大名县", "id": "00030408"}, {
            "name": "涉县",
            "id": "00030409"
        }, {"name": "磁县", "id": "00030410"}, {"name": "肥乡县", "id": "00030411"}, {
            "name": "永年县",
            "id": "00030412"
        }, {"name": "邱县", "id": "00030413"}, {"name": "鸡泽县", "id": "00030414"}, {
            "name": "广平县",
            "id": "00030415"
        }, {"name": "馆陶县", "id": "00030416"}, {"name": "魏县", "id": "00030417"}, {
            "name": "曲周县",
            "id": "00030418"
        }, {"name": "武安市", "id": "00030419"}]
    }, {
        "name": "邢台市",
        "id": "000305",
        "childs": [{"name": "桥东区", "id": "00030501"}, {"name": "桥西区", "id": "00030502"}, {
            "name": "邢台县",
            "id": "00030503"
        }, {"name": "临城县", "id": "00030504"}, {"name": "内丘县", "id": "00030505"}, {
            "name": "柏乡县",
            "id": "00030506"
        }, {"name": "隆尧县", "id": "00030507"}, {"name": "任县", "id": "00030508"}, {
            "name": "南和县",
            "id": "00030509"
        }, {"name": "宁晋县", "id": "00030510"}, {"name": "巨鹿县", "id": "00030511"}, {
            "name": "新河县",
            "id": "00030512"
        }, {"name": "广宗县", "id": "00030513"}, {"name": "平乡县", "id": "00030514"}, {
            "name": "广平县",
            "id": "00030515"
        }, {"name": "威县", "id": "00030516"}, {"name": "清河县", "id": "00030517"}, {
            "name": "临西县",
            "id": "00030518"
        }, {"name": "南宫市", "id": "00030519"}, {"name": "沙河市", "id": "00030520"}]
    }, {
        "name": "保定市",
        "id": "000306",
        "childs": [{"name": "新市区", "id": "00030601"}, {"name": "北市区", "id": "00030602"}, {
            "name": "南市区",
            "id": "00030603"
        }, {"name": "满城县", "id": "00030604"}, {"name": "清苑县", "id": "00030605"}, {
            "name": "涞水县",
            "id": "00030606"
        }, {"name": "阜平县", "id": "00030607"}, {"name": "徐水县", "id": "00030608"}, {
            "name": "定兴县",
            "id": "00030609"
        }, {"name": "唐县", "id": "00030610"}, {"name": "高阳县", "id": "00030611"}, {
            "name": "容城县",
            "id": "00030612"
        }, {"name": "涞源县", "id": "00030613"}, {"name": "望都县", "id": "00030614"}, {
            "name": "安新县",
            "id": "00030615"
        }, {"name": "易县", "id": "00030616"}, {"name": "曲阳县", "id": "00030617"}, {
            "name": "蠡县",
            "id": "00030618"
        }, {"name": "顺平县", "id": "00030619"}, {"name": "博野县", "id": "00030620"}, {
            "name": "雄县",
            "id": "00030621"
        }, {"name": "涿州市", "id": "00030622"}, {"name": "定州市", "id": "00030623"}, {
            "name": "安国市",
            "id": "00030624"
        }, {"name": "高碑店市", "id": "00030625"}]
    }, {
        "name": "张家口市",
        "id": "000307",
        "childs": [{"name": "桥东区", "id": "00030701"}, {"name": "桥西区", "id": "00030702"}, {
            "name": "宣化区",
            "id": "00030703"
        }, {"name": "下花园区", "id": "00030704"}, {"name": "宣化县", "id": "00030705"}, {
            "name": "张北县",
            "id": "00030706"
        }, {"name": "康保县", "id": "00030707"}, {"name": "沽源县", "id": "00030708"}, {
            "name": "尚义县",
            "id": "00030709"
        }, {"name": "蔚县", "id": "00030710"}, {"name": "阳原县", "id": "00030711"}, {
            "name": "怀安县",
            "id": "00030712"
        }, {"name": "万全县", "id": "00030713"}, {"name": "怀来县", "id": "00030714"}, {
            "name": "涿鹿县",
            "id": "00030715"
        }, {"name": "赤城县", "id": "00030716"}, {"name": "崇礼县", "id": "00030717"}]
    }, {
        "name": "承德市",
        "id": "000308",
        "childs": [{"name": "双桥区", "id": "00030801"}, {"name": "双滦区", "id": "00030802"}, {
            "name": "鹰手营子矿区",
            "id": "00030803"
        }, {"name": "承德县", "id": "00030804"}, {"name": "兴隆县", "id": "00030805"}, {
            "name": "平泉县",
            "id": "00030806"
        }, {"name": "滦平县", "id": "00030807"}, {"name": "隆化县", "id": "00030808"}, {
            "name": "丰宁满族自治县",
            "id": "00030809"
        }, {"name": "宽城满族自治县", "id": "00030810"}, {"name": "围场满族蒙古族自治县", "id": "00030811"}]
    }, {
        "name": "沧州市",
        "id": "000309",
        "childs": [{"name": "新华区", "id": "00030901"}, {"name": "运河区", "id": "00030902"}, {
            "name": "沧县",
            "id": "00030903"
        }, {"name": "青县", "id": "00030904"}, {"name": "东光县", "id": "00030905"}, {
            "name": "海兴县",
            "id": "00030906"
        }, {"name": "盐山县", "id": "00030907"}, {"name": "肃宁县", "id": "00030908"}, {
            "name": "南皮县",
            "id": "00030909"
        }, {"name": "吴桥县", "id": "00030910"}, {"name": "献县", "id": "00030911"}, {
            "name": "孟村回族自治县",
            "id": "00030912"
        }, {"name": "泊头市", "id": "00030913"}, {"name": "任丘市", "id": "00030914"}, {
            "name": "黄骅市",
            "id": "00030915"
        }, {"name": "河间市", "id": "00030916"}]
    }, {
        "name": "廊坊市",
        "id": "000310",
        "childs": [{"name": "安次区", "id": "00031001"}, {"name": "广阳区", "id": "00031002"}, {
            "name": "固安县",
            "id": "00031003"
        }, {"name": "永清县", "id": "00031004"}, {"name": "香河县", "id": "00031005"}, {
            "name": "大城县",
            "id": "00031006"
        }, {"name": "文安县", "id": "00031007"}, {"name": "大厂回族自治县", "id": "00031008"}, {
            "name": "霸州市",
            "id": "00031009"
        }, {"name": "三河市", "id": "00031010"}]
    }, {
        "name": "衡水市",
        "id": "000311",
        "childs": [{"name": "桃城区", "id": "00031101"}, {"name": "枣强县", "id": "00031102"}, {
            "name": "武邑县",
            "id": "00031103"
        }, {"name": "武强县", "id": "00031104"}, {"name": "饶阳县", "id": "00031105"}, {
            "name": "安平县",
            "id": "00031106"
        }, {"name": "故城县", "id": "00031107"}, {"name": "景县", "id": "00031108"}, {
            "name": "阜城县",
            "id": "00031109"
        }, {"name": "冀州市", "id": "00031110"}, {"name": "深州市", "id": "00031111"}]
    }, {"name": "其他", "id": "000312", "childs": [{"name": "其他地区", "id": "00031201"}]}]
}, {
    "name": "山西省",
    "id": "0004",
    "childs": [{
        "name": "太原市",
        "id": "000401",
        "childs": [{"name": "小店区", "id": "00040101"}, {"name": "迎泽区", "id": "00040102"}, {
            "name": "杏花岭区",
            "id": "00040103"
        }, {"name": "尖草坪区", "id": "00040104"}, {"name": "万柏林区", "id": "00040105"}, {
            "name": "晋源区",
            "id": "00040106"
        }, {"name": "清徐县", "id": "00040107"}, {"name": "阳曲县", "id": "00040108"}, {
            "name": "娄烦县",
            "id": "00040109"
        }, {"name": "古交市", "id": "00040110"}]
    }, {
        "name": "大同市",
        "id": "000402",
        "childs": [{"name": "城区", "id": "00040201"}, {"name": "矿区", "id": "00040202"}, {
            "name": "南郊区",
            "id": "00040203"
        }, {"name": "新荣区", "id": "00040204"}, {"name": "阳高县", "id": "00040205"}, {
            "name": "天镇县",
            "id": "00040206"
        }, {"name": "广灵县", "id": "00040207"}, {"name": "灵丘县", "id": "00040208"}, {
            "name": "浑源县",
            "id": "00040209"
        }, {"name": "左云县", "id": "00040210"}, {"name": "大同县", "id": "00040211"}]
    }, {
        "name": "阳泉市",
        "id": "000403",
        "childs": [{"name": "城区", "id": "00040301"}, {"name": "矿区", "id": "00040302"}, {
            "name": "郊区",
            "id": "00040303"
        }, {"name": "平定县", "id": "00040304"}, {"name": "盂县", "id": "00040305"}]
    }, {
        "name": "长治市",
        "id": "000404",
        "childs": [{"name": "城区", "id": "00040401"}, {"name": "郊区", "id": "00040402"}, {
            "name": "长治县",
            "id": "00040403"
        }, {"name": "襄垣县", "id": "00040404"}, {"name": "屯留县", "id": "00040405"}, {
            "name": "平顺县",
            "id": "00040406"
        }, {"name": "黎城县", "id": "00040407"}, {"name": "壶关县", "id": "00040408"}, {
            "name": "长子县",
            "id": "00040409"
        }, {"name": "武乡县", "id": "00040410"}, {"name": "沁县", "id": "00040411"}, {
            "name": "沁源县",
            "id": "00040412"
        }, {"name": "潞城市", "id": "00040413"}]
    }, {
        "name": "晋城市",
        "id": "000405",
        "childs": [{"name": "城区", "id": "00040501"}, {"name": "沁水县", "id": "00040502"}, {
            "name": "阳城县",
            "id": "00040503"
        }, {"name": "陵川县", "id": "00040504"}, {"name": "泽州县", "id": "00040505"}, {"name": "高平市", "id": "00040506"}]
    }, {
        "name": "朔州市",
        "id": "000406",
        "childs": [{"name": "朔城区", "id": "00040601"}, {"name": "平鲁区", "id": "00040602"}, {
            "name": "山阴县",
            "id": "00040603"
        }, {"name": "应县", "id": "00040604"}, {"name": "右玉县", "id": "00040605"}, {"name": "怀仁县", "id": "00040606"}]
    }, {
        "name": "晋中市",
        "id": "000407",
        "childs": [{"name": "榆次区", "id": "00040701"}, {"name": "榆社县", "id": "00040702"}, {
            "name": "左权县",
            "id": "00040703"
        }, {"name": "和顺县", "id": "00040704"}, {"name": "昔阳县", "id": "00040705"}, {
            "name": "寿阳县",
            "id": "00040706"
        }, {"name": "太谷县", "id": "00040707"}, {"name": "祁县", "id": "00040708"}, {
            "name": "平遥县",
            "id": "00040709"
        }, {"name": "灵石县", "id": "00040710"}, {"name": "介休市", "id": "00040711"}]
    }, {
        "name": "运城市",
        "id": "000408",
        "childs": [{"name": "盐湖区", "id": "00040801"}, {"name": "临猗县", "id": "00040802"}, {
            "name": "万荣县",
            "id": "00040803"
        }, {"name": "闻喜县", "id": "00040804"}, {"name": "稷山县", "id": "00040805"}, {
            "name": "新绛县",
            "id": "00040806"
        }, {"name": "绛县", "id": "00040807"}, {"name": "垣曲县", "id": "00040808"}, {
            "name": "夏县",
            "id": "00040809"
        }, {"name": "平陆县", "id": "00040810"}, {"name": "芮城县", "id": "00040811"}, {
            "name": "永济市",
            "id": "00040812"
        }, {"name": "河津市", "id": "00040813"}]
    }, {
        "name": "忻州市",
        "id": "000409",
        "childs": [{"name": "忻府区", "id": "00040901"}, {"name": "定襄县", "id": "00040902"}, {
            "name": "五台县",
            "id": "00040903"
        }, {"name": "代县", "id": "00040904"}, {"name": "繁峙县", "id": "00040905"}, {
            "name": "宁武县",
            "id": "00040906"
        }, {"name": "静乐县", "id": "00040907"}, {"name": "神池县", "id": "00040908"}, {
            "name": "五寨县",
            "id": "00040909"
        }, {"name": "岢岚县", "id": "00040910"}, {"name": "河曲县", "id": "00040911"}, {
            "name": "保德县",
            "id": "00040912"
        }, {"name": "偏关县", "id": "00040913"}, {"name": "原平市", "id": "00040914"}]
    }, {
        "name": "临汾市",
        "id": "000410",
        "childs": [{"name": "尧都区", "id": "00041001"}, {"name": "曲沃县", "id": "00041002"}, {
            "name": "翼城县",
            "id": "00041003"
        }, {"name": "襄汾县", "id": "00041004"}, {"name": "洪洞县", "id": "00041005"}, {
            "name": "古县",
            "id": "00041006"
        }, {"name": "安泽县", "id": "00041007"}, {"name": "浮山县", "id": "00041008"}, {
            "name": "吉县",
            "id": "00041009"
        }, {"name": "乡宁县", "id": "00041010"}, {"name": "大宁县", "id": "00041011"}, {
            "name": "隰县",
            "id": "00041012"
        }, {"name": "永和县", "id": "00041013"}, {"name": "蒲县", "id": "00041014"}, {
            "name": "汾西县",
            "id": "00041015"
        }, {"name": "侯马市", "id": "00041016"}, {"name": "霍州市", "id": "00041017"}]
    }, {
        "name": "吕梁市",
        "id": "000411",
        "childs": [{"name": "离石区", "id": "00041101"}, {"name": "文水县", "id": "00041102"}, {
            "name": "交城县",
            "id": "00041103"
        }, {"name": "兴县", "id": "00041104"}, {"name": "临县", "id": "00041105"}, {
            "name": "柳林县",
            "id": "00041106"
        }, {"name": "石楼县", "id": "00041107"}, {"name": "岚县", "id": "00041108"}, {
            "name": "方山县",
            "id": "00041109"
        }, {"name": "中阳县", "id": "00041110"}, {"name": "交口县", "id": "00041111"}, {
            "name": "孝义市",
            "id": "00041112"
        }, {"name": "汾阳市", "id": "00041113"}]
    }]
}, {
    "name": "内蒙古自治区",
    "id": "0005",
    "childs": [{
        "name": "呼和浩特市",
        "id": "000501",
        "childs": [{"name": "新城区", "id": "00050101"}, {"name": "回民区", "id": "00050102"}, {
            "name": "玉泉区",
            "id": "00050103"
        }, {"name": "赛罕区", "id": "00050104"}, {"name": "土默特左旗", "id": "00050105"}, {
            "name": "托克托县",
            "id": "00050106"
        }, {"name": "和林格尔县", "id": "00050107"}, {"name": "清水河县", "id": "00050108"}, {"name": "武川县", "id": "00050109"}]
    }, {
        "name": "包头市",
        "id": "000502",
        "childs": [{"name": "东河区", "id": "00050201"}, {"name": "昆都仑区", "id": "00050202"}, {
            "name": "青山区",
            "id": "00050203"
        }, {"name": "石拐区", "id": "00050204"}, {"name": "白云鄂博矿区", "id": "00050205"}, {
            "name": "九原区",
            "id": "00050206"
        }, {"name": "土默特右旗", "id": "00050207"}, {"name": "固阳县", "id": "00050208"}, {
            "name": "达尔罕茂明安联合旗",
            "id": "00050209"
        }]
    }, {
        "name": "乌海市",
        "id": "000503",
        "childs": [{"name": "海勃湾区", "id": "00050301"}, {"name": "海南区", "id": "00050302"}, {
            "name": "乌达区",
            "id": "00050303"
        }]
    }, {
        "name": "赤峰市",
        "id": "000504",
        "childs": [{"name": "红山区", "id": "00050401"}, {"name": "元宝山区", "id": "00050402"}, {
            "name": "松山区",
            "id": "00050403"
        }, {"name": "阿鲁科尔沁旗", "id": "00050404"}, {"name": "巴林左旗", "id": "00050405"}, {
            "name": "巴林右旗",
            "id": "00050406"
        }, {"name": "林西县", "id": "00050407"}, {"name": "克什克腾旗", "id": "00050408"}, {
            "name": "翁牛特旗",
            "id": "00050409"
        }, {"name": "喀喇沁旗", "id": "00050410"}, {"name": "宁城县", "id": "00050411"}, {"name": "敖汉旗", "id": "00050412"}]
    }, {
        "name": "通辽市",
        "id": "000505",
        "childs": [{"name": "科尔沁区", "id": "00050501"}, {"name": "科尔沁左翼中旗", "id": "00050502"}, {
            "name": "科尔沁左翼后旗",
            "id": "00050503"
        }, {"name": "开鲁县", "id": "00050504"}, {"name": "库伦旗", "id": "00050505"}, {
            "name": "奈曼旗",
            "id": "00050506"
        }, {"name": "扎鲁特旗", "id": "00050507"}, {"name": "霍林郭勒市", "id": "00050508"}]
    }, {
        "name": "鄂尔多斯市",
        "id": "000506",
        "childs": [{"name": "东胜区", "id": "00050601"}, {"name": "达拉特旗", "id": "00050602"}, {
            "name": "准格尔旗",
            "id": "00050603"
        }, {"name": "鄂托克前旗", "id": "00050604"}, {"name": "鄂托克旗", "id": "00050605"}, {
            "name": "杭锦旗",
            "id": "00050606"
        }, {"name": "乌审旗", "id": "00050607"}, {"name": "伊金霍洛旗", "id": "00050608"}]
    }, {
        "name": "呼伦贝尔市",
        "id": "000507",
        "childs": [{"name": "海拉尔区", "id": "00050701"}, {"name": "扎赉诺尔区", "id": "00050702"}, {
            "name": "阿荣旗",
            "id": "00050703"
        }, {"name": "莫力达瓦达斡尔族自治旗", "id": "00050704"}, {"name": "鄂伦春自治旗", "id": "00050705"}, {
            "name": "鄂温克族自治旗",
            "id": "00050706"
        }, {"name": "陈巴尔虎旗", "id": "00050707"}, {"name": "新巴尔虎左旗", "id": "00050708"}, {
            "name": "新巴尔虎右旗",
            "id": "00050709"
        }, {"name": "满洲里市", "id": "00050710"}, {"name": "牙克石市", "id": "00050711"}, {
            "name": "扎兰屯市",
            "id": "00050712"
        }, {"name": "额尔古纳市", "id": "00050713"}, {"name": "根河市", "id": "00050714"}]
    }, {
        "name": "兴安盟",
        "id": "000508",
        "childs": [{"name": "乌兰浩特市", "id": "00050801"}, {"name": "阿尔山市", "id": "00050802"}, {
            "name": "科尔沁右翼前旗",
            "id": "00050803"
        }, {"name": "科尔沁右翼中旗", "id": "00050804"}, {"name": "扎赉特旗", "id": "00050805"}, {"name": "突泉县", "id": "00050806"}]
    }, {
        "name": "锡林郭勒盟",
        "id": "000509",
        "childs": [{"name": "锡林浩特市", "id": "00050901"}, {"name": "二连浩特市", "id": "00050902"}, {
            "name": "阿巴嘎旗",
            "id": "00050903"
        }, {"name": "苏尼特左旗", "id": "00050904"}, {"name": "苏尼特右旗", "id": "00050905"}, {
            "name": "东乌珠穆沁旗",
            "id": "00050906"
        }, {"name": "西乌珠穆沁旗", "id": "00050907"}, {"name": "太仆寺旗", "id": "00050908"}, {
            "name": "镶黄旗",
            "id": "00050909"
        }, {"name": "正镶白旗", "id": "00050910"}, {"name": "正蓝旗", "id": "00050911"}, {"name": "多伦县", "id": "00050912"}]
    }, {
        "name": "乌兰察布市",
        "id": "000510",
        "childs": [{"name": "集宁区", "id": "00051001"}, {"name": "卓资县", "id": "00051002"}, {
            "name": "化德县",
            "id": "00051003"
        }, {"name": "商都县", "id": "00051004"}, {"name": "兴和县", "id": "00051005"}, {
            "name": "凉城县",
            "id": "00051006"
        }, {"name": "察哈尔右翼前旗", "id": "00051007"}, {"name": "察哈尔右翼中旗", "id": "00051008"}, {
            "name": "察哈尔右翼后旗",
            "id": "00051009"
        }, {"name": "四子王旗", "id": "00051010"}, {"name": "丰镇市", "id": "00051011"}]
    }, {
        "name": "巴彦淖尔市",
        "id": "000511",
        "childs": [{"name": "临河区", "id": "00051101"}, {"name": "五原县", "id": "00051102"}, {
            "name": "磴口县",
            "id": "00051103"
        }, {"name": "乌拉特前旗", "id": "00051104"}, {"name": "乌拉特中旗", "id": "00051105"}, {
            "name": "乌拉特后旗",
            "id": "00051106"
        }, {"name": "杭锦后旗", "id": "00051107"}]
    }, {
        "name": "阿拉善盟",
        "id": "000512",
        "childs": [{"name": "阿拉善左旗", "id": "00051201"}, {"name": "阿拉善右旗", "id": "00051202"}, {
            "name": "额济纳旗",
            "id": "00051203"
        }]
    }]
}, {
    "name": "辽宁省",
    "id": "0006",
    "childs": [{
        "name": "沈阳市",
        "id": "000601",
        "childs": [{"name": "和平区", "id": "00060101"}, {"name": "沈河区", "id": "00060102"}, {
            "name": "大东区",
            "id": "00060103"
        }, {"name": "皇姑区", "id": "00060104"}, {"name": "铁西区", "id": "00060105"}, {
            "name": "苏家屯区",
            "id": "00060106"
        }, {"name": "浑南区", "id": "00060107"}, {"name": "沈北新区", "id": "00060108"}, {
            "name": "于洪区",
            "id": "00060109"
        }, {"name": "辽中县", "id": "00060110"}, {"name": "康平县", "id": "00060111"}, {
            "name": "法库县",
            "id": "00060112"
        }, {"name": "新民市", "id": "00060113"}]
    }, {
        "name": "大连市",
        "id": "000602",
        "childs": [{"name": "中山区", "id": "00060201"}, {"name": "西岗区", "id": "00060202"}, {
            "name": "沙河口区",
            "id": "00060203"
        }, {"name": "甘井子区", "id": "00060204"}, {"name": "旅顺口区", "id": "00060205"}, {
            "name": "金州区",
            "id": "00060206"
        }, {"name": "长海县", "id": "00060207"}, {"name": "瓦房店市", "id": "00060208"}, {
            "name": "普兰店市",
            "id": "00060209"
        }, {"name": "庄河市", "id": "00060210"}]
    }, {
        "name": "鞍山市",
        "id": "000603",
        "childs": [{"name": "铁东区", "id": "00060301"}, {"name": "铁西区", "id": "00060302"}, {
            "name": "立山区",
            "id": "00060303"
        }, {"name": "千山区", "id": "00060304"}, {"name": "台安县", "id": "00060305"}, {
            "name": "岫岩满族自治县",
            "id": "00060306"
        }, {"name": "海城市", "id": "00060307"}]
    }, {
        "name": "抚顺市",
        "id": "000604",
        "childs": [{"name": "新抚区", "id": "00060401"}, {"name": "东洲区", "id": "00060402"}, {
            "name": "望花区",
            "id": "00060403"
        }, {"name": "顺城区", "id": "00060404"}, {"name": "抚顺县", "id": "00060405"}, {
            "name": "新宾满族自治县",
            "id": "00060406"
        }, {"name": "清原满族自治县", "id": "00060407"}]
    }, {
        "name": "本溪市",
        "id": "000605",
        "childs": [{"name": "平山区", "id": "00060501"}, {"name": "溪湖区", "id": "00060502"}, {
            "name": "明山区",
            "id": "00060503"
        }, {"name": "南芬区", "id": "00060504"}, {"name": "本溪满族自治县", "id": "00060505"}, {
            "name": "桓仁满族自治县",
            "id": "00060506"
        }]
    }, {
        "name": "丹东市",
        "id": "000606",
        "childs": [{"name": "元宝区", "id": "00060601"}, {"name": "振兴区", "id": "00060602"}, {
            "name": "振安区",
            "id": "00060603"
        }, {"name": "宽甸满族自治县", "id": "00060604"}, {"name": "东港市", "id": "00060605"}, {"name": "凤城市", "id": "00060606"}]
    }, {
        "name": "锦州市",
        "id": "000607",
        "childs": [{"name": "古塔区", "id": "00060701"}, {"name": "凌河区", "id": "00060702"}, {
            "name": "太和区",
            "id": "00060703"
        }, {"name": "黑山县", "id": "00060704"}, {"name": "义县", "id": "00060705"}, {
            "name": "凌海市",
            "id": "00060706"
        }, {"name": "北镇市", "id": "00060707"}]
    }, {
        "name": "营口市",
        "id": "000608",
        "childs": [{"name": "站前区", "id": "00060801"}, {"name": "西市区", "id": "00060802"}, {
            "name": "鲅鱼圈区",
            "id": "00060803"
        }, {"name": "老边区", "id": "00060804"}, {"name": "盖州市", "id": "00060805"}, {"name": "大石桥市", "id": "00060806"}]
    }, {
        "name": "阜新市",
        "id": "000609",
        "childs": [{"name": "海州区", "id": "00060901"}, {"name": "新邱区", "id": "00060902"}, {
            "name": "太平区",
            "id": "00060903"
        }, {"name": "清河门区", "id": "00060904"}, {"name": "细河区", "id": "00060905"}, {
            "name": "阜新蒙古族自治县",
            "id": "00060906"
        }, {"name": "彰武县", "id": "00060907"}]
    }, {
        "name": "辽阳市",
        "id": "000610",
        "childs": [{"name": "白塔区", "id": "00061001"}, {"name": "文圣区", "id": "00061002"}, {
            "name": "宏伟区",
            "id": "00061003"
        }, {"name": "弓长岭区", "id": "00061004"}, {"name": "太子河区", "id": "00061005"}, {
            "name": "辽阳县",
            "id": "00061006"
        }, {"name": "灯塔市", "id": "00061007"}]
    }, {
        "name": "盘锦市",
        "id": "000611",
        "childs": [{"name": "双台子区", "id": "00061101"}, {"name": "兴隆台区", "id": "00061102"}, {
            "name": "大洼县",
            "id": "00061103"
        }, {"name": "盘山县", "id": "00061104"}]
    }, {
        "name": "铁岭市",
        "id": "000612",
        "childs": [{"name": "银州区", "id": "00061201"}, {"name": "清河区", "id": "00061202"}, {
            "name": "铁岭县",
            "id": "00061203"
        }, {"name": "西丰县", "id": "00061204"}, {"name": "昌图县", "id": "00061205"}, {
            "name": "调兵山市",
            "id": "00061206"
        }, {"name": "开原市", "id": "00061207"}]
    }, {
        "name": "朝阳市",
        "id": "000613",
        "childs": [{"name": "双塔区", "id": "00061301"}, {"name": "龙城区", "id": "00061302"}, {
            "name": "朝阳县",
            "id": "00061303"
        }, {"name": "建平县", "id": "00061304"}, {"name": "喀喇沁左翼蒙古族自治县", "id": "00061305"}, {
            "name": "北票市",
            "id": "00061306"
        }, {"name": "凌源市", "id": "00061307"}]
    }, {
        "name": "葫芦岛市",
        "id": "000614",
        "childs": [{"name": "连山区", "id": "00061401"}, {"name": "龙港区", "id": "00061402"}, {
            "name": "南票区",
            "id": "00061403"
        }, {"name": "绥中县", "id": "00061404"}, {"name": "建昌县", "id": "00061405"}, {"name": "兴城市", "id": "00061406"}]
    }]
}, {
    "name": "吉林省",
    "id": "0007",
    "childs": [{
        "name": "长春市",
        "id": "000701",
        "childs": [{"name": "南关区", "id": "00070101"}, {"name": "宽城区", "id": "00070102"}, {
            "name": "朝阳区",
            "id": "00070103"
        }, {"name": "二道区", "id": "00070104"}, {"name": "绿园区", "id": "00070105"}, {
            "name": "双阳区",
            "id": "00070106"
        }, {"name": "九台区", "id": "00070107"}, {"name": "农安县", "id": "00070108"}, {
            "name": "榆树市",
            "id": "00070109"
        }, {"name": "德惠市", "id": "00070110"}]
    }, {
        "name": "吉林市",
        "id": "000702",
        "childs": [{"name": "昌邑区", "id": "00070201"}, {"name": "龙潭区", "id": "00070202"}, {
            "name": "船营区",
            "id": "00070203"
        }, {"name": "丰满区", "id": "00070204"}, {"name": "永吉县", "id": "00070205"}, {
            "name": "蛟河市",
            "id": "00070206"
        }, {"name": "桦甸市", "id": "00070207"}, {"name": "舒兰市", "id": "00070208"}, {"name": "磐石市", "id": "00070209"}]
    }, {
        "name": "四平市",
        "id": "000703",
        "childs": [{"name": "铁西区", "id": "00070301"}, {"name": "铁东区", "id": "00070302"}, {
            "name": "梨树县",
            "id": "00070303"
        }, {"name": "伊通满族自治县", "id": "00070304"}, {"name": "公主岭市", "id": "00070305"}, {"name": "双辽市", "id": "00070306"}]
    }, {
        "name": "辽源市",
        "id": "000704",
        "childs": [{"name": "龙山区", "id": "00070401"}, {"name": "西安区", "id": "00070402"}, {
            "name": "东丰县",
            "id": "00070403"
        }, {"name": "东辽县", "id": "00070404"}]
    }, {
        "name": "通化市",
        "id": "000705",
        "childs": [{"name": "东昌区", "id": "00070501"}, {"name": "二道江区", "id": "00070502"}, {
            "name": "通化县",
            "id": "00070503"
        }, {"name": "辉南县", "id": "00070504"}, {"name": "柳河县", "id": "00070505"}, {
            "name": "梅河口市",
            "id": "00070506"
        }, {"name": "集安市", "id": "00070507"}]
    }, {
        "name": "白山市",
        "id": "000706",
        "childs": [{"name": "浑江区", "id": "00070601"}, {"name": "江源区", "id": "00070602"}, {
            "name": "抚松县",
            "id": "00070603"
        }, {"name": "靖宇县", "id": "00070604"}, {"name": "长白朝鲜族自治县", "id": "00070605"}, {"name": "临江市", "id": "00070606"}]
    }, {
        "name": "松原市",
        "id": "000707",
        "childs": [{"name": "宁江区", "id": "00070701"}, {"name": "前郭尔罗斯蒙古族自治县", "id": "00070702"}, {
            "name": "长岭县",
            "id": "00070703"
        }, {"name": "乾安县", "id": "00070704"}, {"name": "扶余市", "id": "00070705"}]
    }, {
        "name": "白城市",
        "id": "000708",
        "childs": [{"name": "洮北区", "id": "00070801"}, {"name": "镇赉县", "id": "00070802"}, {
            "name": "通榆县",
            "id": "00070803"
        }, {"name": "洮南市", "id": "00070804"}, {"name": "大安市", "id": "00070805"}]
    }, {
        "name": "延边朝鲜族自治州",
        "id": "000709",
        "childs": [{"name": "延吉市", "id": "00070901"}, {"name": "图们市", "id": "00070902"}, {
            "name": "敦化市",
            "id": "00070903"
        }, {"name": "珲春市", "id": "00070904"}, {"name": "龙井市", "id": "00070905"}, {
            "name": "和龙市",
            "id": "00070906"
        }, {"name": "汪清县", "id": "00070907"}, {"name": "安图县", "id": "00070908"}]
    }]
}, {
    "name": "黑龙江省",
    "id": "0008",
    "childs": [{
        "name": "哈尔滨市",
        "id": "000801",
        "childs": [{"name": "道里区", "id": "00080101"}, {"name": "南岗区", "id": "00080102"}, {
            "name": "道外区",
            "id": "00080103"
        }, {"name": "平房区", "id": "00080104"}, {"name": "松北区", "id": "00080105"}, {
            "name": "香坊区",
            "id": "00080106"
        }, {"name": "呼兰区", "id": "00080107"}, {"name": "阿城区", "id": "00080108"}, {
            "name": "依兰县",
            "id": "00080109"
        }, {"name": "方正县", "id": "00080110"}, {"name": "宾县", "id": "00080111"}, {
            "name": "巴彦县",
            "id": "00080112"
        }, {"name": "木兰县", "id": "00080113"}, {"name": "通河县", "id": "00080114"}, {
            "name": "延寿县",
            "id": "00080115"
        }, {"name": "双城市", "id": "00080116"}, {"name": "尚志市", "id": "00080117"}, {"name": "五常市", "id": "00080118"}]
    }, {
        "name": "齐齐哈尔市",
        "id": "000802",
        "childs": [{"name": "龙沙区", "id": "00080201"}, {"name": "建华区", "id": "00080202"}, {
            "name": "铁锋区",
            "id": "00080203"
        }, {"name": "昂昂溪区", "id": "00080204"}, {"name": "富拉尔基区", "id": "00080205"}, {
            "name": "碾子山区",
            "id": "00080206"
        }, {"name": "梅里斯达斡尔族区", "id": "00080207"}, {"name": "龙江县", "id": "00080208"}, {
            "name": "依安县",
            "id": "00080209"
        }, {"name": "泰来县", "id": "00080210"}, {"name": "甘南县", "id": "00080211"}, {
            "name": "富裕县",
            "id": "00080212"
        }, {"name": "克山县", "id": "00080213"}, {"name": "克东县", "id": "00080214"}, {
            "name": "拜泉县",
            "id": "00080215"
        }, {"name": "讷河市", "id": "00080216"}]
    }, {
        "name": "鸡西市",
        "id": "000803",
        "childs": [{"name": "鸡冠区", "id": "00080301"}, {"name": "恒山区", "id": "00080302"}, {
            "name": "滴道区",
            "id": "00080303"
        }, {"name": "梨树区", "id": "00080304"}, {"name": "城子河区", "id": "00080305"}, {
            "name": "麻山区",
            "id": "00080306"
        }, {"name": "鸡东县", "id": "00080307"}, {"name": "虎林市", "id": "00080308"}, {"name": "密山市", "id": "00080309"}]
    }, {
        "name": "鹤岗市",
        "id": "000804",
        "childs": [{"name": "向阳区", "id": "00080401"}, {"name": "工农区", "id": "00080402"}, {
            "name": "南山区",
            "id": "00080403"
        }, {"name": "兴安区", "id": "00080404"}, {"name": "东山区", "id": "00080405"}, {
            "name": "兴山区",
            "id": "00080406"
        }, {"name": "萝北县", "id": "00080407"}, {"name": "绥滨县", "id": "00080408"}]
    }, {
        "name": "双鸭山市",
        "id": "000805",
        "childs": [{"name": "尖山区", "id": "00080501"}, {"name": "岭东区", "id": "00080502"}, {
            "name": "四方台区",
            "id": "00080503"
        }, {"name": "宝山区", "id": "00080504"}, {"name": "集贤县", "id": "00080505"}, {
            "name": "友谊县",
            "id": "00080506"
        }, {"name": "宝清县", "id": "00080507"}, {"name": "饶河县", "id": "00080508"}]
    }, {
        "name": "大庆市",
        "id": "000806",
        "childs": [{"name": "萨尔图区", "id": "00080601"}, {"name": "龙凤区", "id": "00080602"}, {
            "name": "让胡路区",
            "id": "00080603"
        }, {"name": "红岗区", "id": "00080604"}, {"name": "大同区", "id": "00080605"}, {
            "name": "肇州县",
            "id": "00080606"
        }, {"name": "肇源县", "id": "00080607"}, {"name": "林甸县", "id": "00080608"}, {
            "name": "杜尔伯特蒙古族自治县",
            "id": "00080609"
        }]
    }, {
        "name": "伊春市",
        "id": "000807",
        "childs": [{"name": "伊春区", "id": "00080701"}, {"name": "南岔区", "id": "00080702"}, {
            "name": "友好区",
            "id": "00080703"
        }, {"name": "西林区", "id": "00080704"}, {"name": "翠峦区", "id": "00080705"}, {
            "name": "新青区",
            "id": "00080706"
        }, {"name": "美溪区", "id": "00080707"}, {"name": "金山屯区", "id": "00080708"}, {
            "name": "五营区",
            "id": "00080709"
        }, {"name": "乌马河区", "id": "00080710"}, {"name": "汤旺河区", "id": "00080711"}, {
            "name": "带岭区",
            "id": "00080712"
        }, {"name": "乌伊岭区", "id": "00080713"}, {"name": "红星区", "id": "00080714"}, {
            "name": "上甘岭区",
            "id": "00080715"
        }, {"name": "嘉荫县", "id": "00080716"}, {"name": "铁力市", "id": "00080717"}]
    }, {
        "name": "佳木斯市",
        "id": "000808",
        "childs": [{"name": "向阳区", "id": "00080801"}, {"name": "前进区", "id": "00080802"}, {
            "name": "东风区",
            "id": "00080803"
        }, {"name": "郊区", "id": "00080804"}, {"name": "桦南县", "id": "00080805"}, {
            "name": "桦川县",
            "id": "00080806"
        }, {"name": "汤原县", "id": "00080807"}, {"name": "抚远县", "id": "00080808"}, {
            "name": "同江市",
            "id": "00080809"
        }, {"name": "富锦市", "id": "00080810"}]
    }, {
        "name": "七台河市",
        "id": "000809",
        "childs": [{"name": "新兴区", "id": "00080901"}, {"name": "桃山区", "id": "00080902"}, {
            "name": "茄子河区",
            "id": "00080903"
        }, {"name": "勃利县", "id": "00080904"}]
    }, {
        "name": "牡丹江市",
        "id": "000810",
        "childs": [{"name": "东安区", "id": "00081001"}, {"name": "阳明区", "id": "00081002"}, {
            "name": "爱民区",
            "id": "00081003"
        }, {"name": "西安区", "id": "00081004"}, {"name": "东宁县", "id": "00081005"}, {
            "name": "林口县",
            "id": "00081006"
        }, {"name": "绥芬河市", "id": "00081007"}, {"name": "海林市", "id": "00081008"}, {
            "name": "宁安市",
            "id": "00081009"
        }, {"name": "穆棱市", "id": "00081010"}]
    }, {
        "name": "黑河市",
        "id": "000811",
        "childs": [{"name": "爱辉区", "id": "00081101"}, {"name": "嫩江县", "id": "00081102"}, {
            "name": "逊克县",
            "id": "00081103"
        }, {"name": "孙吴县", "id": "00081104"}, {"name": "北安市", "id": "00081105"}, {"name": "五大连池市", "id": "00081106"}]
    }, {
        "name": "绥化市",
        "id": "000812",
        "childs": [{"name": "北林区", "id": "00081201"}, {"name": "望奎县", "id": "00081202"}, {
            "name": "兰西县",
            "id": "00081203"
        }, {"name": "青冈县", "id": "00081204"}, {"name": "庆安县", "id": "00081205"}, {
            "name": "明水县",
            "id": "00081206"
        }, {"name": "绥棱县", "id": "00081207"}, {"name": "安达市", "id": "00081208"}, {
            "name": "肇东市",
            "id": "00081209"
        }, {"name": "海伦市", "id": "00081210"}]
    }, {
        "name": "大兴安岭地区",
        "id": "000813",
        "childs": [{"name": "呼玛县", "id": "00081301"}, {"name": "塔河县", "id": "00081302"}, {
            "name": "漠河县",
            "id": "00081303"
        }, {"name": "加格达奇区", "id": "00081304"}]
    }]
}, {
    "name": "江苏省",
    "id": "0010",
    "childs": [{
        "name": "南京市",
        "id": "001001",
        "childs": [{"name": "玄武区", "id": "00100101"}, {"name": "秦淮区", "id": "00100102"}, {
            "name": "建邺区",
            "id": "00100103"
        }, {"name": "鼓楼区", "id": "00100104"}, {"name": "浦口区", "id": "00100105"}, {
            "name": "栖霞区",
            "id": "00100106"
        }, {"name": "雨花台区", "id": "00100107"}, {"name": "江宁区", "id": "00100108"}, {
            "name": "六合区",
            "id": "00100109"
        }, {"name": "溧水区", "id": "00100110"}, {"name": "高淳区", "id": "00100111"}]
    }, {
        "name": "无锡市",
        "id": "001002",
        "childs": [{"name": "崇安区", "id": "00100201"}, {"name": "南长区", "id": "00100202"}, {
            "name": "北塘区",
            "id": "00100203"
        }, {"name": "锡山区", "id": "00100204"}, {"name": "惠山区", "id": "00100205"}, {
            "name": "滨湖区",
            "id": "00100206"
        }, {"name": "江阴市", "id": "00100207"}, {"name": "宜兴市", "id": "00100208"}]
    }, {
        "name": "徐州市",
        "id": "001003",
        "childs": [{"name": "鼓楼区", "id": "00100301"}, {"name": "云龙区", "id": "00100302"}, {
            "name": "贾汪区",
            "id": "00100303"
        }, {"name": "泉山区", "id": "00100304"}, {"name": "铜山区", "id": "00100305"}, {
            "name": "丰县",
            "id": "00100306"
        }, {"name": "沛县", "id": "00100307"}, {"name": "睢宁县", "id": "00100308"}, {
            "name": "新沂市",
            "id": "00100309"
        }, {"name": "邳州市", "id": "00100310"}]
    }, {
        "name": "常州市",
        "id": "001004",
        "childs": [{"name": "天宁区", "id": "00100401"}, {"name": "钟楼区", "id": "00100402"}, {
            "name": "戚墅堰区",
            "id": "00100403"
        }, {"name": "新北区", "id": "00100404"}, {"name": "武进区", "id": "00100405"}, {
            "name": "溧阳市",
            "id": "00100406"
        }, {"name": "金坛市", "id": "00100407"}]
    }, {
        "name": "苏州市",
        "id": "001005",
        "childs": [{"name": "虎丘区", "id": "00100501"}, {"name": "吴中区", "id": "00100502"}, {
            "name": "相城区",
            "id": "00100503"
        }, {"name": "姑苏区", "id": "00100504"}, {"name": "吴江区", "id": "00100505"}, {
            "name": "常熟市",
            "id": "00100506"
        }, {"name": "张家港市", "id": "00100507"}, {"name": "昆山市", "id": "00100508"}, {"name": "太仓市", "id": "00100509"}]
    }, {
        "name": "南通市",
        "id": "001006",
        "childs": [{"name": "崇川区", "id": "00100601"}, {"name": "港闸区", "id": "00100602"}, {
            "name": "通州区",
            "id": "00100603"
        }, {"name": "海安县", "id": "00100604"}, {"name": "如东县", "id": "00100605"}, {
            "name": "启东市",
            "id": "00100606"
        }, {"name": "如皋市", "id": "00100607"}, {"name": "海门市", "id": "00100608"}]
    }, {
        "name": "连云港市",
        "id": "001007",
        "childs": [{"name": "连云区", "id": "00100701"}, {"name": "海州区", "id": "00100702"}, {
            "name": "赣榆区",
            "id": "00100703"
        }, {"name": "东海县", "id": "00100704"}, {"name": "灌云县", "id": "00100705"}, {"name": "灌南县", "id": "00100706"}]
    }, {
        "name": "淮安市",
        "id": "001008",
        "childs": [{"name": "清河区", "id": "00100801"}, {"name": "淮安区", "id": "00100802"}, {
            "name": "淮阴区",
            "id": "00100803"
        }, {"name": "清浦区", "id": "00100804"}, {"name": "涟水县", "id": "00100805"}, {
            "name": "洪泽县",
            "id": "00100806"
        }, {"name": "盱眙县", "id": "00100807"}, {"name": "金湖县", "id": "00100808"}]
    }, {
        "name": "盐城市",
        "id": "001009",
        "childs": [{"name": "亭湖区", "id": "00100901"}, {"name": "盐都区", "id": "00100902"}, {
            "name": "响水县",
            "id": "00100903"
        }, {"name": "滨海县", "id": "00100904"}, {"name": "阜宁县", "id": "00100905"}, {
            "name": "射阳县",
            "id": "00100906"
        }, {"name": "建湖县", "id": "00100907"}, {"name": "东台市", "id": "00100908"}, {"name": "大丰市", "id": "00100909"}]
    }, {
        "name": "扬州市",
        "id": "001010",
        "childs": [{"name": "广陵区", "id": "00101001"}, {"name": "邗江区", "id": "00101002"}, {
            "name": "江都区",
            "id": "00101003"
        }, {"name": "宝应县", "id": "00101004"}, {"name": "仪征市", "id": "00101005"}, {"name": "高邮市", "id": "00101006"}]
    }, {
        "name": "镇江市",
        "id": "001011",
        "childs": [{"name": "京口区", "id": "00101101"}, {"name": "润州区", "id": "00101102"}, {
            "name": "丹徒区",
            "id": "00101103"
        }, {"name": "丹阳市", "id": "00101104"}, {"name": "扬中市", "id": "00101105"}, {"name": "句容市", "id": "00101106"}]
    }, {
        "name": "泰州市",
        "id": "001012",
        "childs": [{"name": "海陵区", "id": "00101201"}, {"name": "高港区", "id": "00101202"}, {
            "name": "姜堰区",
            "id": "00101203"
        }, {"name": "兴化市", "id": "00101204"}, {"name": "靖江市", "id": "00101205"}, {"name": "泰兴市", "id": "00101206"}]
    }, {
        "name": "宿迁市",
        "id": "001013",
        "childs": [{"name": "宿城区", "id": "00101301"}, {"name": "宿豫区", "id": "00101302"}, {
            "name": "沭阳县",
            "id": "00101303"
        }, {"name": "泗阳县", "id": "00101304"}, {"name": "泗洪县", "id": "00101305"}]
    }]
}, {
    "name": "浙江省",
    "id": "0011",
    "childs": [{
        "name": "杭州市",
        "id": "001101",
        "childs": [{"name": "上城区", "id": "00110101"}, {"name": "下城区", "id": "00110102"}, {
            "name": "江干区",
            "id": "00110103"
        }, {"name": "拱墅区", "id": "00110104"}, {"name": "西湖区", "id": "00110105"}, {
            "name": "滨江区",
            "id": "00110106"
        }, {"name": "萧山区", "id": "00110107"}, {"name": "余杭区", "id": "00110108"}, {
            "name": "桐庐县",
            "id": "00110109"
        }, {"name": "淳安县", "id": "00110110"}, {"name": "建德市", "id": "00110111"}, {
            "name": "富阳市",
            "id": "00110112"
        }, {"name": "临安市", "id": "00110113"}]
    }, {
        "name": "宁波市",
        "id": "001102",
        "childs": [{"name": "海曙区", "id": "00110201"}, {"name": "江东区", "id": "00110202"}, {
            "name": "江北区",
            "id": "00110203"
        }, {"name": "北仑区", "id": "00110204"}, {"name": "镇海区", "id": "00110205"}, {
            "name": "鄞州区",
            "id": "00110206"
        }, {"name": "象山县", "id": "00110207"}, {"name": "宁海县", "id": "00110208"}, {
            "name": "余姚市",
            "id": "00110209"
        }, {"name": "慈溪市", "id": "00110210"}, {"name": "奉化市", "id": "00110211"}]
    }, {
        "name": "温州市",
        "id": "001103",
        "childs": [{"name": "鹿城区", "id": "00110301"}, {"name": "龙湾区", "id": "00110302"}, {
            "name": "瓯海区",
            "id": "00110303"
        }, {"name": "洞头县", "id": "00110304"}, {"name": "永嘉县", "id": "00110305"}, {
            "name": "平阳县",
            "id": "00110306"
        }, {"name": "苍南县", "id": "00110307"}, {"name": "文成县", "id": "00110308"}, {
            "name": "泰顺县",
            "id": "00110309"
        }, {"name": "瑞安市", "id": "00110310"}, {"name": "乐清市", "id": "00110311"}]
    }, {
        "name": "嘉兴市",
        "id": "001104",
        "childs": [{"name": "南湖区", "id": "00110401"}, {"name": "秀洲区", "id": "00110402"}, {
            "name": "嘉善县",
            "id": "00110403"
        }, {"name": "海盐县", "id": "00110404"}, {"name": "海宁市", "id": "00110405"}, {
            "name": "桐乡市",
            "id": "00110406"
        }, {"name": "平湖市", "id": "00110407"}]
    }, {
        "name": "湖州市",
        "id": "001105",
        "childs": [{"name": "吴兴区", "id": "00110501"}, {"name": "南浔区", "id": "00110502"}, {
            "name": "德清县",
            "id": "00110503"
        }, {"name": "长兴县", "id": "00110504"}, {"name": "安吉县", "id": "00110505"}]
    }, {
        "name": "绍兴市",
        "id": "001106",
        "childs": [{"name": "越城区", "id": "00110601"}, {"name": "柯桥区", "id": "00110602"}, {
            "name": "上虞区",
            "id": "00110603"
        }, {"name": "新昌县", "id": "00110604"}, {"name": "诸暨市", "id": "00110605"}, {"name": "嵊州市", "id": "00110606"}]
    }, {
        "name": "金华市",
        "id": "001107",
        "childs": [{"name": "婺城区", "id": "00110701"}, {"name": "金东区", "id": "00110702"}, {
            "name": "武义县",
            "id": "00110703"
        }, {"name": "浦江县", "id": "00110704"}, {"name": "磐安县", "id": "00110705"}, {
            "name": "兰溪市",
            "id": "00110706"
        }, {"name": "义乌市", "id": "00110707"}, {"name": "东阳市", "id": "00110708"}, {"name": "永康市", "id": "00110709"}]
    }, {
        "name": "衢州市",
        "id": "001108",
        "childs": [{"name": "柯城区", "id": "00110801"}, {"name": "衢江区", "id": "00110802"}, {
            "name": "常山县",
            "id": "00110803"
        }, {"name": "开化县", "id": "00110804"}, {"name": "龙游县", "id": "00110805"}, {"name": "江山市", "id": "00110806"}]
    }, {
        "name": "舟山市",
        "id": "001109",
        "childs": [{"name": "定海区", "id": "00110901"}, {"name": "普陀区", "id": "00110902"}, {
            "name": "岱山县",
            "id": "00110903"
        }, {"name": "嵊泗县", "id": "00110904"}]
    }, {
        "name": "台州市",
        "id": "001110",
        "childs": [{"name": "椒江区", "id": "00111001"}, {"name": "黄岩区", "id": "00111002"}, {
            "name": "路桥区",
            "id": "00111003"
        }, {"name": "玉环县", "id": "00111004"}, {"name": "三门县", "id": "00111005"}, {
            "name": "天台县",
            "id": "00111006"
        }, {"name": "仙居县", "id": "00111007"}, {"name": "温岭市", "id": "00111008"}, {"name": "临海市", "id": "00111009"}]
    }, {
        "name": "丽水市",
        "id": "001111",
        "childs": [{"name": "莲都区", "id": "00111101"}, {"name": "青田县", "id": "00111102"}, {
            "name": "缙云县",
            "id": "00111103"
        }, {"name": "遂昌县", "id": "00111104"}, {"name": "松阳县", "id": "00111105"}, {
            "name": "云和县",
            "id": "00111106"
        }, {"name": "庆元县", "id": "00111107"}, {"name": "景宁畲族自治县", "id": "00111108"}, {"name": "龙泉市", "id": "00111109"}]
    }]
}, {
    "name": "安徽省",
    "id": "0012",
    "childs": [{
        "name": "合肥市",
        "id": "001201",
        "childs": [{"name": "瑶海区", "id": "00120101"}, {"name": "庐阳区", "id": "00120102"}, {
            "name": "蜀山区",
            "id": "00120103"
        }, {"name": "包河区", "id": "00120104"}, {"name": "长丰县", "id": "00120105"}, {
            "name": "肥东县",
            "id": "00120106"
        }, {"name": "肥西县", "id": "00120107"}, {"name": "庐江县", "id": "00120108"}, {"name": "巢湖市", "id": "00120109"}]
    }, {
        "name": "芜湖市",
        "id": "001202",
        "childs": [{"name": "镜湖区", "id": "00120201"}, {"name": "弋江区", "id": "00120202"}, {
            "name": "鸠江区",
            "id": "00120203"
        }, {"name": "三山区", "id": "00120204"}, {"name": "芜湖县", "id": "00120205"}, {
            "name": "繁昌县",
            "id": "00120206"
        }, {"name": "南陵县", "id": "00120207"}, {"name": "无为县", "id": "00120208"}]
    }, {
        "name": "蚌埠市",
        "id": "001203",
        "childs": [{"name": "龙子湖区", "id": "00120301"}, {"name": "蚌山区", "id": "00120302"}, {
            "name": "禹会区",
            "id": "00120303"
        }, {"name": "淮上区", "id": "00120304"}, {"name": "怀远县", "id": "00120305"}, {
            "name": "五河县",
            "id": "00120306"
        }, {"name": "固镇县", "id": "00120307"}]
    }, {
        "name": "淮南市",
        "id": "001204",
        "childs": [{"name": "大通区", "id": "00120401"}, {"name": "田家庵区", "id": "00120402"}, {
            "name": "谢家集区",
            "id": "00120403"
        }, {"name": "八公山区", "id": "00120404"}, {"name": "潘集区", "id": "00120405"}, {"name": "凤台县", "id": "00120406"}]
    }, {
        "name": "马鞍山市",
        "id": "001205",
        "childs": [{"name": "花山区", "id": "00120501"}, {"name": "雨山区", "id": "00120502"}, {
            "name": "博望区",
            "id": "00120503"
        }, {"name": "当涂县", "id": "00120504"}, {"name": "含山县", "id": "00120505"}, {"name": "和县", "id": "00120506"}]
    }, {
        "name": "淮北市",
        "id": "001206",
        "childs": [{"name": "杜集区", "id": "00120601"}, {"name": "相山区", "id": "00120602"}, {
            "name": "烈山区",
            "id": "00120603"
        }, {"name": "濉溪县", "id": "00120604"}]
    }, {
        "name": "铜陵市",
        "id": "001207",
        "childs": [{"name": "铜官山区", "id": "00120701"}, {"name": "狮子山区", "id": "00120702"}, {
            "name": "郊区",
            "id": "00120703"
        }, {"name": "铜陵县", "id": "00120704"}]
    }, {
        "name": "安庆市",
        "id": "001208",
        "childs": [{"name": "迎江区", "id": "00120801"}, {"name": "大观区", "id": "00120802"}, {
            "name": "宜秀区",
            "id": "00120803"
        }, {"name": "怀宁县", "id": "00120804"}, {"name": "枞阳县", "id": "00120805"}, {
            "name": "潜山县",
            "id": "00120806"
        }, {"name": "太湖县", "id": "00120807"}, {"name": "宿松县", "id": "00120808"}, {
            "name": "望江县",
            "id": "00120809"
        }, {"name": "岳西县", "id": "00120810"}, {"name": "桐城市", "id": "00120811"}]
    }, {
        "name": "黄山市",
        "id": "001209",
        "childs": [{"name": "屯溪区", "id": "00120901"}, {"name": "黄山区", "id": "00120902"}, {
            "name": "徽州区",
            "id": "00120903"
        }, {"name": "歙县", "id": "00120904"}, {"name": "休宁县", "id": "00120905"}, {
            "name": "黟县",
            "id": "00120906"
        }, {"name": "祁门县", "id": "00120907"}]
    }, {
        "name": "滁州市",
        "id": "001210",
        "childs": [{"name": "琅琊区", "id": "00121001"}, {"name": "南谯区", "id": "00121002"}, {
            "name": "来安县",
            "id": "00121003"
        }, {"name": "全椒县", "id": "00121004"}, {"name": "定远县", "id": "00121005"}, {
            "name": "凤阳县",
            "id": "00121006"
        }, {"name": "天长市", "id": "00121007"}, {"name": "明光市", "id": "00121008"}]
    }, {
        "name": "阜阳市",
        "id": "001211",
        "childs": [{"name": "颍州区", "id": "00121101"}, {"name": "颍东区", "id": "00121102"}, {
            "name": "颍泉区",
            "id": "00121103"
        }, {"name": "临泉县", "id": "00121104"}, {"name": "太和县", "id": "00121105"}, {
            "name": "阜南县",
            "id": "00121106"
        }, {"name": "颍上县", "id": "00121107"}, {"name": "界首市", "id": "00121108"}]
    }, {
        "name": "宿州市",
        "id": "001212",
        "childs": [{"name": "埇桥区", "id": "00121201"}, {"name": "砀山县", "id": "00121202"}, {
            "name": "萧县",
            "id": "00121203"
        }, {"name": "灵璧县", "id": "00121204"}, {"name": "泗县", "id": "00121205"}]
    }, {
        "name": "六安市",
        "id": "001214",
        "childs": [{"name": "金安区", "id": "00121401"}, {"name": "裕安区", "id": "00121402"}, {
            "name": "寿县",
            "id": "00121403"
        }, {"name": "霍邱县", "id": "00121404"}, {"name": "舒城县", "id": "00121405"}, {
            "name": "金寨县",
            "id": "00121406"
        }, {"name": "霍山县", "id": "00121407"}]
    }, {
        "name": "亳州市",
        "id": "001215",
        "childs": [{"name": "谯城区", "id": "00121501"}, {"name": "涡阳县", "id": "00121502"}, {
            "name": "蒙城县",
            "id": "00121503"
        }, {"name": "利辛县", "id": "00121504"}]
    }, {
        "name": "池州市",
        "id": "001216",
        "childs": [{"name": "贵池区", "id": "00121601"}, {"name": "东至县", "id": "00121602"}, {
            "name": "石台县",
            "id": "00121603"
        }, {"name": "青阳县", "id": "00121604"}]
    }, {
        "name": "宣城市",
        "id": "001217",
        "childs": [{"name": "宣州区", "id": "00121701"}, {"name": "郎溪县", "id": "00121702"}, {
            "name": "广德县",
            "id": "00121703"
        }, {"name": "泾县", "id": "00121704"}, {"name": "绩溪县", "id": "00121705"}, {
            "name": "旌德县",
            "id": "00121706"
        }, {"name": "宁国市", "id": "00121707"}]
    }]
}, {
    "name": "福建省",
    "id": "0013",
    "childs": [{
        "name": "福州市",
        "id": "001301",
        "childs": [{"name": "鼓楼区", "id": "00130101"}, {"name": "台江区", "id": "00130102"}, {
            "name": "仓山区",
            "id": "00130103"
        }, {"name": "马尾区", "id": "00130104"}, {"name": "晋安区", "id": "00130105"}, {
            "name": "闽侯县",
            "id": "00130106"
        }, {"name": "连江县", "id": "00130107"}, {"name": "罗源县", "id": "00130108"}, {
            "name": "闽清县",
            "id": "00130109"
        }, {"name": "永泰县", "id": "00130110"}, {"name": "平潭县", "id": "00130111"}, {
            "name": "福清市",
            "id": "00130112"
        }, {"name": "长乐市", "id": "00130113"}]
    }, {
        "name": "厦门市",
        "id": "001302",
        "childs": [{"name": "思明区", "id": "00130201"}, {"name": "海沧区", "id": "00130202"}, {
            "name": "湖里区",
            "id": "00130203"
        }, {"name": "集美区", "id": "00130204"}, {"name": "同安区", "id": "00130205"}, {"name": "翔安区", "id": "00130206"}]
    }, {
        "name": "莆田市",
        "id": "001303",
        "childs": [{"name": "城厢区", "id": "00130301"}, {"name": "涵江区", "id": "00130302"}, {
            "name": "荔城区",
            "id": "00130303"
        }, {"name": "秀屿区", "id": "00130304"}, {"name": "仙游县", "id": "00130305"}]
    }, {
        "name": "三明市",
        "id": "001304",
        "childs": [{"name": "梅列区", "id": "00130401"}, {"name": "三元区", "id": "00130402"}, {
            "name": "明溪县",
            "id": "00130403"
        }, {"name": "清流县", "id": "00130404"}, {"name": "宁化县", "id": "00130405"}, {
            "name": "大田县",
            "id": "00130406"
        }, {"name": "尤溪县", "id": "00130407"}, {"name": "沙县", "id": "00130408"}, {
            "name": "将乐县",
            "id": "00130409"
        }, {"name": "泰宁县", "id": "00130410"}, {"name": "建宁县", "id": "00130411"}, {"name": "永安市", "id": "00130412"}]
    }, {
        "name": "泉州市",
        "id": "001305",
        "childs": [{"name": "鲤城区", "id": "00130501"}, {"name": "丰泽区", "id": "00130502"}, {
            "name": "洛江区",
            "id": "00130503"
        }, {"name": "泉港区", "id": "00130504"}, {"name": "惠安县", "id": "00130505"}, {
            "name": "安溪县",
            "id": "00130506"
        }, {"name": "永春县", "id": "00130507"}, {"name": "德化县", "id": "00130508"}, {
            "name": "金门县",
            "id": "00130509"
        }, {"name": "石狮市", "id": "00130510"}, {"name": "晋江市", "id": "00130511"}, {"name": "南安市", "id": "00130512"}]
    }, {
        "name": "漳州市",
        "id": "001306",
        "childs": [{"name": "芗城区", "id": "00130601"}, {"name": "龙文区", "id": "00130602"}, {
            "name": "云霄县",
            "id": "00130603"
        }, {"name": "漳浦县", "id": "00130604"}, {"name": "诏安县", "id": "00130605"}, {
            "name": "长泰县",
            "id": "00130606"
        }, {"name": "东山县", "id": "00130607"}, {"name": "南靖县", "id": "00130608"}, {
            "name": "平和县",
            "id": "00130609"
        }, {"name": "华安县", "id": "00130610"}, {"name": "龙海市", "id": "00130611"}]
    }, {
        "name": "南平市",
        "id": "001307",
        "childs": [{"name": "延平区", "id": "00130701"}, {"name": "顺昌县", "id": "00130702"}, {
            "name": "浦城县",
            "id": "00130703"
        }, {"name": "光泽县", "id": "00130704"}, {"name": "松溪县", "id": "00130705"}, {
            "name": "政和县",
            "id": "00130706"
        }, {"name": "邵武市", "id": "00130707"}, {"name": "武夷山市", "id": "00130708"}, {
            "name": "建瓯市",
            "id": "00130709"
        }, {"name": "建阳市", "id": "00130710"}]
    }, {
        "name": "龙岩市",
        "id": "001308",
        "childs": [{"name": "新罗区", "id": "00130801"}, {"name": "长汀县", "id": "00130802"}, {
            "name": "永定县",
            "id": "00130803"
        }, {"name": "上杭县", "id": "00130804"}, {"name": "武平县", "id": "00130805"}, {
            "name": "连城县",
            "id": "00130806"
        }, {"name": "漳平市", "id": "00130807"}]
    }, {
        "name": "宁德市",
        "id": "001309",
        "childs": [{"name": "蕉城区", "id": "00130901"}, {"name": "霞浦县", "id": "00130902"}, {
            "name": "古田县",
            "id": "00130903"
        }, {"name": "屏南县", "id": "00130904"}, {"name": "寿宁县", "id": "00130905"}, {
            "name": "周宁县",
            "id": "00130906"
        }, {"name": "柘荣县", "id": "00130907"}, {"name": "福安市", "id": "00130908"}, {"name": "福鼎市", "id": "00130909"}]
    }]
}, {
    "name": "江西省",
    "id": "0014",
    "childs": [{
        "name": "南昌市",
        "id": "001401",
        "childs": [{"name": "东湖区", "id": "00140101"}, {"name": "西湖区", "id": "00140102"}, {
            "name": "青云谱区",
            "id": "00140103"
        }, {"name": "湾里区", "id": "00140104"}, {"name": "青山湖区", "id": "00140105"}, {
            "name": "南昌县",
            "id": "00140106"
        }, {"name": "新建县", "id": "00140107"}, {"name": "安义县", "id": "00140108"}, {"name": "进贤县", "id": "00140109"}]
    }, {
        "name": "景德镇市",
        "id": "001402",
        "childs": [{"name": "昌江区", "id": "00140201"}, {"name": "珠山区", "id": "00140202"}, {
            "name": "浮梁县",
            "id": "00140203"
        }, {"name": "乐平市", "id": "00140204"}]
    }, {
        "name": "萍乡市",
        "id": "001403",
        "childs": [{"name": "安源区", "id": "00140301"}, {"name": "湘东区", "id": "00140302"}, {
            "name": "莲花县",
            "id": "00140303"
        }, {"name": "上栗县", "id": "00140304"}, {"name": "芦溪县", "id": "00140305"}]
    }, {
        "name": "九江市",
        "id": "001404",
        "childs": [{"name": "庐山区", "id": "00140401"}, {"name": "浔阳区", "id": "00140402"}, {
            "name": "九江县",
            "id": "00140403"
        }, {"name": "武宁县", "id": "00140404"}, {"name": "修水县", "id": "00140405"}, {
            "name": "永修县",
            "id": "00140406"
        }, {"name": "德安县", "id": "00140407"}, {"name": "星子县", "id": "00140408"}, {
            "name": "都昌县",
            "id": "00140409"
        }, {"name": "湖口县", "id": "00140410"}, {"name": "彭泽县", "id": "00140411"}, {
            "name": "瑞昌市",
            "id": "00140412"
        }, {"name": "共青城市", "id": "00140413"}]
    }, {
        "name": "新余市",
        "id": "001405",
        "childs": [{"name": "渝水区", "id": "00140501"}, {"name": "分宜县", "id": "00140502"}]
    }, {
        "name": "鹰潭市",
        "id": "001406",
        "childs": [{"name": "月湖区", "id": "00140601"}, {"name": "余江县", "id": "00140602"}, {
            "name": "贵溪市",
            "id": "00140603"
        }]
    }, {
        "name": "赣州市",
        "id": "001407",
        "childs": [{"name": "章贡区", "id": "00140701"}, {"name": "南康区", "id": "00140702"}, {
            "name": "赣县",
            "id": "00140703"
        }, {"name": "信丰县", "id": "00140704"}, {"name": "大余县", "id": "00140705"}, {
            "name": "上犹县",
            "id": "00140706"
        }, {"name": "崇义县", "id": "00140707"}, {"name": "安远县", "id": "00140708"}, {
            "name": "龙南县",
            "id": "00140709"
        }, {"name": "定南县", "id": "00140710"}, {"name": "全南县", "id": "00140711"}, {
            "name": "宁都县",
            "id": "00140712"
        }, {"name": "于都县", "id": "00140713"}, {"name": "兴国县", "id": "00140714"}, {
            "name": "会昌县",
            "id": "00140715"
        }, {"name": "寻乌县", "id": "00140716"}, {"name": "石城县", "id": "00140717"}, {"name": "瑞金市", "id": "00140718"}]
    }, {
        "name": "吉安市",
        "id": "001408",
        "childs": [{"name": "吉州区", "id": "00140801"}, {"name": "青原区", "id": "00140802"}, {
            "name": "吉安县",
            "id": "00140803"
        }, {"name": "吉水县", "id": "00140804"}, {"name": "峡江县", "id": "00140805"}, {
            "name": "新干县",
            "id": "00140806"
        }, {"name": "永丰县", "id": "00140807"}, {"name": "泰和县", "id": "00140808"}, {
            "name": "遂川县",
            "id": "00140809"
        }, {"name": "万安县", "id": "00140810"}, {"name": "安福县", "id": "00140811"}, {
            "name": "永新县",
            "id": "00140812"
        }, {"name": "井冈山市", "id": "00140813"}]
    }, {
        "name": "宜春市",
        "id": "001409",
        "childs": [{"name": "袁州区", "id": "00140901"}, {"name": "奉新县", "id": "00140902"}, {
            "name": "万载县",
            "id": "00140903"
        }, {"name": "上高县", "id": "00140904"}, {"name": "宜丰县", "id": "00140905"}, {
            "name": "靖安县",
            "id": "00140906"
        }, {"name": "铜鼓县", "id": "00140907"}, {"name": "丰城市", "id": "00140908"}, {
            "name": "樟树市",
            "id": "00140909"
        }, {"name": "高安市", "id": "00140910"}]
    }, {
        "name": "抚州市",
        "id": "001410",
        "childs": [{"name": "临川区", "id": "00141001"}, {"name": "南城县", "id": "00141002"}, {
            "name": "黎川县",
            "id": "00141003"
        }, {"name": "南丰县", "id": "00141004"}, {"name": "崇仁县", "id": "00141005"}, {
            "name": "乐安县",
            "id": "00141006"
        }, {"name": "宜黄县", "id": "00141007"}, {"name": "金溪县", "id": "00141008"}, {
            "name": "资溪县",
            "id": "00141009"
        }, {"name": "东乡县", "id": "00141010"}, {"name": "广昌县", "id": "00141011"}]
    }, {
        "name": "上饶市",
        "id": "001411",
        "childs": [{"name": "信州区", "id": "00141101"}, {"name": "上饶县", "id": "00141102"}, {
            "name": "广丰县",
            "id": "00141103"
        }, {"name": "玉山县", "id": "00141104"}, {"name": "铅山县", "id": "00141105"}, {
            "name": "横峰县",
            "id": "00141106"
        }, {"name": "弋阳县", "id": "00141107"}, {"name": "余干县", "id": "00141108"}, {
            "name": "鄱阳县",
            "id": "00141109"
        }, {"name": "万年县", "id": "00141110"}, {"name": "婺源县", "id": "00141111"}, {"name": "德兴市", "id": "00141112"}]
    }]
}, {
    "name": "山东省",
    "id": "0015",
    "childs": [{
        "name": "济南市",
        "id": "001501",
        "childs": [{"name": "历下区", "id": "00150101"}, {"name": "市中区", "id": "00150102"}, {
            "name": "槐荫区",
            "id": "00150103"
        }, {"name": "天桥区", "id": "00150104"}, {"name": "历城区", "id": "00150105"}, {
            "name": "长清区",
            "id": "00150106"
        }, {"name": "平阴县", "id": "00150107"}, {"name": "济阳县", "id": "00150108"}, {
            "name": "商河县",
            "id": "00150109"
        }, {"name": "章丘市", "id": "00150110"}]
    }, {
        "name": "青岛市",
        "id": "001502",
        "childs": [{"name": "市南区", "id": "00150201"}, {"name": "市北区", "id": "00150202"}, {
            "name": "黄岛区",
            "id": "00150203"
        }, {"name": "崂山区", "id": "00150204"}, {"name": "李沧区", "id": "00150205"}, {
            "name": "城阳区",
            "id": "00150206"
        }, {"name": "胶州市", "id": "00150207"}, {"name": "即墨市", "id": "00150208"}, {
            "name": "平度市",
            "id": "00150209"
        }, {"name": "莱西市", "id": "00150210"}]
    }, {
        "name": "淄博市",
        "id": "001503",
        "childs": [{"name": "淄川区", "id": "00150301"}, {"name": "张店区", "id": "00150302"}, {
            "name": "博山区",
            "id": "00150303"
        }, {"name": "临淄区", "id": "00150304"}, {"name": "周村区", "id": "00150305"}, {
            "name": "桓台县",
            "id": "00150306"
        }, {"name": "高青县", "id": "00150307"}, {"name": "沂源县", "id": "00150308"}]
    }, {
        "name": "枣庄市",
        "id": "001504",
        "childs": [{"name": "市中区", "id": "00150401"}, {"name": "薛城区", "id": "00150402"}, {
            "name": "峄城区",
            "id": "00150403"
        }, {"name": "台儿庄区", "id": "00150404"}, {"name": "山亭区", "id": "00150405"}, {"name": "滕州市", "id": "00150406"}]
    }, {
        "name": "东营市",
        "id": "001505",
        "childs": [{"name": "东营区", "id": "00150501"}, {"name": "河口区", "id": "00150502"}, {
            "name": "垦利县",
            "id": "00150503"
        }, {"name": "利津县", "id": "00150504"}, {"name": "广饶县", "id": "00150505"}]
    }, {
        "name": "烟台市",
        "id": "001506",
        "childs": [{"name": "芝罘区", "id": "00150601"}, {"name": "福山区", "id": "00150602"}, {
            "name": "牟平区",
            "id": "00150603"
        }, {"name": "莱山区", "id": "00150604"}, {"name": "长岛县", "id": "00150605"}, {
            "name": "龙口市",
            "id": "00150606"
        }, {"name": "莱阳市", "id": "00150607"}, {"name": "莱州市", "id": "00150608"}, {
            "name": "蓬莱市",
            "id": "00150609"
        }, {"name": "招远市", "id": "00150610"}, {"name": "栖霞市", "id": "00150611"}, {"name": "海阳市", "id": "00150612"}]
    }, {
        "name": "潍坊市",
        "id": "001507",
        "childs": [{"name": "潍城区", "id": "00150701"}, {"name": "寒亭区", "id": "00150702"}, {
            "name": "坊子区",
            "id": "00150703"
        }, {"name": "奎文区", "id": "00150704"}, {"name": "临朐县", "id": "00150705"}, {
            "name": "昌乐县",
            "id": "00150706"
        }, {"name": "青州市", "id": "00150707"}, {"name": "诸城市", "id": "00150708"}, {
            "name": "寿光市",
            "id": "00150709"
        }, {"name": "安丘市", "id": "00150710"}, {"name": "高密市", "id": "00150711"}, {"name": "昌邑市", "id": "00150712"}]
    }, {
        "name": "济宁市",
        "id": "001508",
        "childs": [{"name": "任城区", "id": "00150801"}, {"name": "兖州区", "id": "00150802"}, {
            "name": "微山县",
            "id": "00150803"
        }, {"name": "鱼台县", "id": "00150804"}, {"name": "金乡县", "id": "00150805"}, {
            "name": "嘉祥县",
            "id": "00150806"
        }, {"name": "汶上县", "id": "00150807"}, {"name": "泗水县", "id": "00150808"}, {
            "name": "梁山县",
            "id": "00150809"
        }, {"name": "曲阜市", "id": "00150810"}, {"name": "邹城市", "id": "00150811"}]
    }, {
        "name": "泰安市",
        "id": "001509",
        "childs": [{"name": "泰山区", "id": "00150901"}, {"name": "岱岳区", "id": "00150902"}, {
            "name": "宁阳县",
            "id": "00150903"
        }, {"name": "东平县", "id": "00150904"}, {"name": "新泰市", "id": "00150905"}, {"name": "肥城市", "id": "00150906"}]
    }, {
        "name": "威海市",
        "id": "001510",
        "childs": [{"name": "环翠区", "id": "00151001"}, {"name": "文登区", "id": "00151002"}, {
            "name": "荣成市",
            "id": "00151003"
        }, {"name": "乳山市", "id": "00151004"}]
    }, {
        "name": "日照市",
        "id": "001511",
        "childs": [{"name": "东港区", "id": "00151101"}, {"name": "岚山区", "id": "00151102"}, {
            "name": "五莲县",
            "id": "00151103"
        }, {"name": "莒县", "id": "00151104"}]
    }, {
        "name": "莱芜市",
        "id": "001512",
        "childs": [{"name": "莱城区", "id": "00151201"}, {"name": "钢城区", "id": "00151202"}]
    }, {
        "name": "临沂市",
        "id": "001513",
        "childs": [{"name": "兰山区", "id": "00151301"}, {"name": "罗庄区", "id": "00151302"}, {
            "name": "河东区",
            "id": "00151303"
        }, {"name": "沂南县", "id": "00151304"}, {"name": "郯城县", "id": "00151305"}, {
            "name": "沂水县",
            "id": "00151306"
        }, {"name": "兰陵县", "id": "00151307"}, {"name": "费县", "id": "00151308"}, {
            "name": "平邑县",
            "id": "00151309"
        }, {"name": "莒南县", "id": "00151310"}, {"name": "蒙阴县", "id": "00151311"}, {"name": "临沭县", "id": "00151312"}]
    }, {
        "name": "德州市",
        "id": "001514",
        "childs": [{"name": "德城区", "id": "00151401"}, {"name": "陵城区", "id": "00151402"}, {
            "name": "宁津县",
            "id": "00151403"
        }, {"name": "庆云县", "id": "00151404"}, {"name": "临邑县", "id": "00151405"}, {
            "name": "齐河县",
            "id": "00151406"
        }, {"name": "平原县", "id": "00151407"}, {"name": "夏津县", "id": "00151408"}, {
            "name": "武城县",
            "id": "00151409"
        }, {"name": "乐陵市", "id": "00151410"}, {"name": "禹城市", "id": "00151411"}]
    }, {
        "name": "聊城市",
        "id": "001515",
        "childs": [{"name": "东昌府区", "id": "00151501"}, {"name": "阳谷县", "id": "00151502"}, {
            "name": "莘县",
            "id": "00151503"
        }, {"name": "茌平县", "id": "00151504"}, {"name": "东阿县", "id": "00151505"}, {
            "name": "冠县",
            "id": "00151506"
        }, {"name": "高唐县", "id": "00151507"}, {"name": "临清市", "id": "00151508"}]
    }, {
        "name": "滨州市",
        "id": "001516",
        "childs": [{"name": "滨城区", "id": "00151601"}, {"name": "沾化区", "id": "00151602"}, {
            "name": "惠民县",
            "id": "00151603"
        }, {"name": "阳信县", "id": "00151604"}, {"name": "无棣县", "id": "00151605"}, {
            "name": "博兴县",
            "id": "00151606"
        }, {"name": "邹平县", "id": "00151607"}]
    }, {
        "name": "菏泽市",
        "id": "001517",
        "childs": [{"name": "牡丹区", "id": "00151701"}, {"name": "曹县", "id": "00151702"}, {
            "name": "单县",
            "id": "00151703"
        }, {"name": "成武县", "id": "00151704"}, {"name": "巨野县", "id": "00151705"}, {
            "name": "郓城县",
            "id": "00151706"
        }, {"name": "鄄城县", "id": "00151707"}, {"name": "定陶县", "id": "00151708"}, {"name": "东明县", "id": "00151709"}]
    }]
}, {
    "name": "河南省",
    "id": "0016",
    "childs": [{
        "name": "郑州市",
        "id": "001601",
        "childs": [{"name": "中原区", "id": "00160101"}, {"name": "二七区", "id": "00160102"}, {
            "name": "管城回族区",
            "id": "00160103"
        }, {"name": "金水区", "id": "00160104"}, {"name": "上街区", "id": "00160105"}, {
            "name": "惠济区",
            "id": "00160106"
        }, {"name": "中牟县", "id": "00160107"}, {"name": "巩义市", "id": "00160108"}, {
            "name": "荥阳市",
            "id": "00160109"
        }, {"name": "新密市", "id": "00160110"}, {"name": "新郑市", "id": "00160111"}, {"name": "登封市", "id": "00160112"}]
    }, {
        "name": "开封市",
        "id": "001602",
        "childs": [{"name": "龙亭区", "id": "00160201"}, {"name": "顺河回族区", "id": "00160202"}, {
            "name": "鼓楼区",
            "id": "00160203"
        }, {"name": "禹王台区", "id": "00160204"}, {"name": "金明区", "id": "00160205"}, {
            "name": "杞县",
            "id": "00160206"
        }, {"name": "通许县", "id": "00160207"}, {"name": "尉氏县", "id": "00160208"}, {
            "name": "开封县",
            "id": "00160209"
        }, {"name": "兰考县", "id": "00160210"}]
    }, {
        "name": "洛阳市",
        "id": "001603",
        "childs": [{"name": "老城区", "id": "00160301"}, {"name": "西工区", "id": "00160302"}, {
            "name": "瀍河回族区",
            "id": "00160303"
        }, {"name": "涧西区", "id": "00160304"}, {"name": "吉利区", "id": "00160305"}, {
            "name": "洛龙区",
            "id": "00160306"
        }, {"name": "孟津县", "id": "00160307"}, {"name": "新安县", "id": "00160308"}, {
            "name": "栾川县",
            "id": "00160309"
        }, {"name": "嵩县", "id": "00160310"}, {"name": "汝阳县", "id": "00160311"}, {
            "name": "宜阳县",
            "id": "00160312"
        }, {"name": "洛宁县", "id": "00160313"}, {"name": "伊川县", "id": "00160314"}, {"name": "偃师市", "id": "00160315"}]
    }, {
        "name": "平顶山市",
        "id": "001604",
        "childs": [{"name": "新华区", "id": "00160401"}, {"name": "卫东区", "id": "00160402"}, {
            "name": "石龙区",
            "id": "00160403"
        }, {"name": "湛河区", "id": "00160404"}, {"name": "宝丰县", "id": "00160405"}, {
            "name": "叶县",
            "id": "00160406"
        }, {"name": "鲁山县", "id": "00160407"}, {"name": "郏县", "id": "00160408"}, {
            "name": "舞钢市",
            "id": "00160409"
        }, {"name": "汝州市", "id": "00160410"}]
    }, {
        "name": "安阳市",
        "id": "001605",
        "childs": [{"name": "文峰区", "id": "00160501"}, {"name": "北关区", "id": "00160502"}, {
            "name": "殷都区",
            "id": "00160503"
        }, {"name": "龙安区", "id": "00160504"}, {"name": "安阳县", "id": "00160505"}, {
            "name": "汤阴县",
            "id": "00160506"
        }, {"name": "滑县", "id": "00160507"}, {"name": "内黄县", "id": "00160508"}, {"name": "林州市", "id": "00160509"}]
    }, {
        "name": "鹤壁市",
        "id": "001606",
        "childs": [{"name": "鹤山区", "id": "00160601"}, {"name": "山城区", "id": "00160602"}, {
            "name": "淇滨区",
            "id": "00160603"
        }, {"name": "浚县", "id": "00160604"}, {"name": "淇县", "id": "00160605"}]
    }, {
        "name": "新乡市",
        "id": "001607",
        "childs": [{"name": "红旗区", "id": "00160701"}, {"name": "卫滨区", "id": "00160702"}, {
            "name": "凤泉区",
            "id": "00160703"
        }, {"name": "牧野区", "id": "00160704"}, {"name": "新乡县", "id": "00160705"}, {
            "name": "获嘉县",
            "id": "00160706"
        }, {"name": "原阳县", "id": "00160707"}, {"name": "延津县", "id": "00160708"}, {
            "name": "封丘县",
            "id": "00160709"
        }, {"name": "长垣县", "id": "00160710"}, {"name": "卫辉市", "id": "00160711"}, {"name": "辉县市", "id": "00160712"}]
    }, {
        "name": "焦作市",
        "id": "001608",
        "childs": [{"name": "解放区", "id": "00160801"}, {"name": "中站区", "id": "00160802"}, {
            "name": "马村区",
            "id": "00160803"
        }, {"name": "山阳区", "id": "00160804"}, {"name": "修武县", "id": "00160805"}, {
            "name": "博爱县",
            "id": "00160806"
        }, {"name": "武陟县", "id": "00160807"}, {"name": "温县", "id": "00160808"}, {
            "name": "沁阳市",
            "id": "00160809"
        }, {"name": "孟州市", "id": "00160810"}]
    }, {
        "name": "濮阳市",
        "id": "001609",
        "childs": [{"name": "华龙区", "id": "00160901"}, {"name": "清丰县", "id": "00160902"}, {
            "name": "南乐县",
            "id": "00160903"
        }, {"name": "范县", "id": "00160904"}, {"name": "台前县", "id": "00160905"}, {"name": "濮阳县", "id": "00160906"}]
    }, {
        "name": "许昌市",
        "id": "001610",
        "childs": [{"name": "魏都区", "id": "00161001"}, {"name": "许昌县", "id": "00161002"}, {
            "name": "鄢陵县",
            "id": "00161003"
        }, {"name": "襄城县", "id": "00161004"}, {"name": "禹州市", "id": "00161005"}, {"name": "长葛市", "id": "00161006"}]
    }, {
        "name": "漯河市",
        "id": "001611",
        "childs": [{"name": "源汇区", "id": "00161101"}, {"name": "郾城区", "id": "00161102"}, {
            "name": "召陵区",
            "id": "00161103"
        }, {"name": "舞阳县", "id": "00161104"}, {"name": "临颍县", "id": "00161105"}]
    }, {
        "name": "三门峡市",
        "id": "001612",
        "childs": [{"name": "湖滨区", "id": "00161201"}, {"name": "渑池县", "id": "00161202"}, {
            "name": "陕县",
            "id": "00161203"
        }, {"name": "卢氏县", "id": "00161204"}, {"name": "义马市", "id": "00161205"}, {"name": "灵宝市", "id": "00161206"}]
    }, {
        "name": "南阳市",
        "id": "001613",
        "childs": [{"name": "宛城区", "id": "00161301"}, {"name": "卧龙区", "id": "00161302"}, {
            "name": "南召县",
            "id": "00161303"
        }, {"name": "方城县", "id": "00161304"}, {"name": "西峡县", "id": "00161305"}, {
            "name": "镇平县",
            "id": "00161306"
        }, {"name": "内乡县", "id": "00161307"}, {"name": "淅川县", "id": "00161308"}, {
            "name": "社旗县",
            "id": "00161309"
        }, {"name": "唐河县", "id": "00161310"}, {"name": "新野县", "id": "00161311"}, {
            "name": "桐柏县",
            "id": "00161312"
        }, {"name": "邓州市", "id": "00161313"}]
    }, {
        "name": "商丘市",
        "id": "001614",
        "childs": [{"name": "梁园区", "id": "00161401"}, {"name": "睢阳区", "id": "00161402"}, {
            "name": "民权县",
            "id": "00161403"
        }, {"name": "睢县", "id": "00161404"}, {"name": "宁陵县", "id": "00161405"}, {
            "name": "柘城县",
            "id": "00161406"
        }, {"name": "虞城县", "id": "00161407"}, {"name": "夏邑县", "id": "00161408"}, {"name": "永城市", "id": "00161409"}]
    }, {
        "name": "信阳市",
        "id": "001615",
        "childs": [{"name": "浉河区", "id": "00161501"}, {"name": "平桥区", "id": "00161502"}, {
            "name": "罗山县",
            "id": "00161503"
        }, {"name": "光山县", "id": "00161504"}, {"name": "新县", "id": "00161505"}, {
            "name": "商城县",
            "id": "00161506"
        }, {"name": "固始县", "id": "00161507"}, {"name": "潢川县", "id": "00161508"}, {
            "name": "淮滨县",
            "id": "00161509"
        }, {"name": "息县", "id": "00161510"}]
    }, {
        "name": "周口市",
        "id": "001616",
        "childs": [{"name": "川汇区", "id": "00161601"}, {"name": "扶沟县", "id": "00161602"}, {
            "name": "西华县",
            "id": "00161603"
        }, {"name": "商水县", "id": "00161604"}, {"name": "沈丘县", "id": "00161605"}, {
            "name": "郸城县",
            "id": "00161606"
        }, {"name": "淮阳县", "id": "00161607"}, {"name": "太康县", "id": "00161608"}, {
            "name": "鹿邑县",
            "id": "00161609"
        }, {"name": "项城市", "id": "00161610"}]
    }, {
        "name": "驻马店市",
        "id": "001617",
        "childs": [{"name": "驿城区", "id": "00161701"}, {"name": "西平县", "id": "00161702"}, {
            "name": "上蔡县",
            "id": "00161703"
        }, {"name": "平舆县", "id": "00161704"}, {"name": "正阳县", "id": "00161705"}, {
            "name": "确山县",
            "id": "00161706"
        }, {"name": "泌阳县", "id": "00161707"}, {"name": "汝南县", "id": "00161708"}, {
            "name": "遂平县",
            "id": "00161709"
        }, {"name": "新蔡县", "id": "00161710"}]
    }]
}, {
    "name": "湖北省",
    "id": "0017",
    "childs": [{
        "name": "武汉市",
        "id": "001701",
        "childs": [{"name": "江岸区", "id": "00170101"}, {"name": "江汉区", "id": "00170102"}, {
            "name": "硚口区",
            "id": "00170103"
        }, {"name": "汉阳区", "id": "00170104"}, {"name": "武昌区", "id": "00170105"}, {
            "name": "青山区",
            "id": "00170106"
        }, {"name": "洪山区", "id": "00170107"}, {"name": "东西湖区", "id": "00170108"}, {
            "name": "汉南区",
            "id": "00170109"
        }, {"name": "蔡甸区", "id": "00170110"}, {"name": "江夏区", "id": "00170111"}, {
            "name": "黄陂区",
            "id": "00170112"
        }, {"name": "新洲区", "id": "00170113"}]
    }, {
        "name": "黄石市",
        "id": "001702",
        "childs": [{"name": "黄石港区", "id": "00170201"}, {"name": "西塞山区", "id": "00170202"}, {
            "name": "下陆区",
            "id": "00170203"
        }, {"name": "铁山区", "id": "00170204"}, {"name": "阳新县", "id": "00170205"}, {"name": "大冶市", "id": "00170206"}]
    }, {
        "name": "十堰市",
        "id": "001703",
        "childs": [{"name": "茅箭区", "id": "00170301"}, {"name": "张湾区", "id": "00170302"}, {
            "name": "郧阳区",
            "id": "00170303"
        }, {"name": "郧西县", "id": "00170304"}, {"name": "竹山县", "id": "00170305"}, {
            "name": "竹溪县",
            "id": "00170306"
        }, {"name": "房县", "id": "00170307"}, {"name": "丹江口市", "id": "00170308"}]
    }, {
        "name": "宜昌市",
        "id": "001704",
        "childs": [{"name": "西陵区", "id": "00170401"}, {"name": "伍家岗区", "id": "00170402"}, {
            "name": "点军区",
            "id": "00170403"
        }, {"name": "猇亭区", "id": "00170404"}, {"name": "夷陵区", "id": "00170405"}, {
            "name": "远安县",
            "id": "00170406"
        }, {"name": "兴山县", "id": "00170407"}, {"name": "秭归县", "id": "00170408"}, {
            "name": "长阳土家族自治县",
            "id": "00170409"
        }, {"name": "五峰土家族自治县", "id": "00170410"}, {"name": "宜都市", "id": "00170411"}, {
            "name": "当阳市",
            "id": "00170412"
        }, {"name": "枝江市", "id": "00170413"}]
    }, {
        "name": "襄阳市",
        "id": "001705",
        "childs": [{"name": "襄城区", "id": "00170501"}, {"name": "樊城区", "id": "00170502"}, {
            "name": "襄州区",
            "id": "00170503"
        }, {"name": "南漳县", "id": "00170504"}, {"name": "谷城县", "id": "00170505"}, {
            "name": "保康县",
            "id": "00170506"
        }, {"name": "老河口市", "id": "00170507"}, {"name": "枣阳市", "id": "00170508"}, {"name": "宜城市", "id": "00170509"}]
    }, {
        "name": "鄂州市",
        "id": "001706",
        "childs": [{"name": "梁子湖区", "id": "00170601"}, {"name": "华容区", "id": "00170602"}, {
            "name": "鄂城区",
            "id": "00170603"
        }]
    }, {
        "name": "荆门市",
        "id": "001707",
        "childs": [{"name": "东宝区", "id": "00170701"}, {"name": "掇刀区", "id": "00170702"}, {
            "name": "京山县",
            "id": "00170703"
        }, {"name": "沙洋县", "id": "00170704"}, {"name": "钟祥市", "id": "00170705"}]
    }, {
        "name": "孝感市",
        "id": "001708",
        "childs": [{"name": "孝南区", "id": "00170801"}, {"name": "孝昌县", "id": "00170802"}, {
            "name": "大悟县",
            "id": "00170803"
        }, {"name": "云梦县", "id": "00170804"}, {"name": "应城市", "id": "00170805"}, {
            "name": "安陆市",
            "id": "00170806"
        }, {"name": "汉川市", "id": "00170807"}]
    }, {
        "name": "荆州市",
        "id": "001709",
        "childs": [{"name": "沙市区", "id": "00170901"}, {"name": "荆州区", "id": "00170902"}, {
            "name": "公安县",
            "id": "00170903"
        }, {"name": "监利县", "id": "00170904"}, {"name": "江陵县", "id": "00170905"}, {
            "name": "石首市",
            "id": "00170906"
        }, {"name": "洪湖市", "id": "00170907"}, {"name": "松滋市", "id": "00170908"}]
    }, {
        "name": "黄冈市",
        "id": "001710",
        "childs": [{"name": "黄州区", "id": "00171001"}, {"name": "团风县", "id": "00171002"}, {
            "name": "红安县",
            "id": "00171003"
        }, {"name": "罗田县", "id": "00171004"}, {"name": "英山县", "id": "00171005"}, {
            "name": "浠水县",
            "id": "00171006"
        }, {"name": "蕲春县", "id": "00171007"}, {"name": "黄梅县", "id": "00171008"}, {
            "name": "麻城市",
            "id": "00171009"
        }, {"name": "武穴市", "id": "00171010"}]
    }, {
        "name": "咸宁市",
        "id": "001711",
        "childs": [{"name": "咸安区", "id": "00171101"}, {"name": "嘉鱼县", "id": "00171102"}, {
            "name": "通城县",
            "id": "00171103"
        }, {"name": "崇阳县", "id": "00171104"}, {"name": "通山县", "id": "00171105"}, {"name": "赤壁市", "id": "00171106"}]
    }, {
        "name": "随州市",
        "id": "001712",
        "childs": [{"name": "曾都区", "id": "00171201"}, {"name": "随县", "id": "00171202"}, {
            "name": "广水市",
            "id": "00171203"
        }]
    }, {
        "name": "恩施土家族苗族自治州",
        "id": "001713",
        "childs": [{"name": "恩施市", "id": "00171301"}, {"name": "利川市", "id": "00171302"}, {
            "name": "建始县",
            "id": "00171303"
        }, {"name": "巴东县", "id": "00171304"}, {"name": "宣恩县", "id": "00171305"}, {
            "name": "咸丰县",
            "id": "00171306"
        }, {"name": "来凤县", "id": "00171307"}, {"name": "鹤峰县", "id": "00171308"}]
    }, {"name": "天门市", "id": "001715", "childs": [{"name": "天门地区", "id": "00171501"}]}, {
        "name": "潜江市",
        "id": "001716",
        "childs": [{"name": "潜江地区", "id": "00171601"}]
    }, {"name": "仙桃市", "id": "001717", "childs": [{"name": "仙桃地区", "id": "00171701"}]}, {
        "name": "神农架市",
        "id": "001718",
        "childs": [{"name": "神农架市地区", "id": "00171801"}]
    }]
}, {
    "name": "湖南省",
    "id": "0018",
    "childs": [{
        "name": "长沙市",
        "id": "001801",
        "childs": [{"name": "芙蓉区", "id": "00180101"}, {"name": "天心区", "id": "00180102"}, {
            "name": "岳麓区",
            "id": "00180103"
        }, {"name": "开福区", "id": "00180104"}, {"name": "雨花区", "id": "00180105"}, {
            "name": "望城区",
            "id": "00180106"
        }, {"name": "长沙县", "id": "00180107"}, {"name": "宁乡县", "id": "00180108"}, {"name": "浏阳市", "id": "00180109"}]
    }, {
        "name": "株洲市",
        "id": "001802",
        "childs": [{"name": "荷塘区", "id": "00180201"}, {"name": "芦淞区", "id": "00180202"}, {
            "name": "石峰区",
            "id": "00180203"
        }, {"name": "天元区", "id": "00180204"}, {"name": "株洲县", "id": "00180205"}, {
            "name": "攸县",
            "id": "00180206"
        }, {"name": "茶陵县", "id": "00180207"}, {"name": "炎陵县", "id": "00180208"}, {"name": "醴陵市", "id": "00180209"}]
    }, {
        "name": "湘潭市",
        "id": "001803",
        "childs": [{"name": "雨湖区", "id": "00180301"}, {"name": "岳塘区", "id": "00180302"}, {
            "name": "湘潭县",
            "id": "00180303"
        }, {"name": "湘乡市", "id": "00180304"}, {"name": "韶山市", "id": "00180305"}]
    }, {
        "name": "衡阳市",
        "id": "001804",
        "childs": [{"name": "珠晖区", "id": "00180401"}, {"name": "雁峰区", "id": "00180402"}, {
            "name": "石鼓区",
            "id": "00180403"
        }, {"name": "蒸湘区", "id": "00180404"}, {"name": "南岳区", "id": "00180405"}, {
            "name": "衡阳县",
            "id": "00180406"
        }, {"name": "衡南县", "id": "00180407"}, {"name": "衡山县", "id": "00180408"}, {
            "name": "衡东县",
            "id": "00180409"
        }, {"name": "祁东县", "id": "00180410"}, {"name": "耒阳市", "id": "00180411"}, {"name": "常宁市", "id": "00180412"}]
    }, {
        "name": "邵阳市",
        "id": "001805",
        "childs": [{"name": "双清区", "id": "00180501"}, {"name": "大祥区", "id": "00180502"}, {
            "name": "北塔区",
            "id": "00180503"
        }, {"name": "邵东县", "id": "00180504"}, {"name": "新邵县", "id": "00180505"}, {
            "name": "邵阳县",
            "id": "00180506"
        }, {"name": "隆回县", "id": "00180507"}, {"name": "洞口县", "id": "00180508"}, {
            "name": "绥宁县",
            "id": "00180509"
        }, {"name": "新宁县", "id": "00180510"}, {"name": "城步苗族自治县", "id": "00180511"}, {"name": "武冈市", "id": "00180512"}]
    }, {
        "name": "岳阳市",
        "id": "001806",
        "childs": [{"name": "岳阳楼区", "id": "00180601"}, {"name": "云溪区", "id": "00180602"}, {
            "name": "君山区",
            "id": "00180603"
        }, {"name": "岳阳县", "id": "00180604"}, {"name": "华容县", "id": "00180605"}, {
            "name": "湘阴县",
            "id": "00180606"
        }, {"name": "平江县", "id": "00180607"}, {"name": "汨罗市", "id": "00180608"}, {"name": "临湘市", "id": "00180609"}]
    }, {
        "name": "常德市",
        "id": "001807",
        "childs": [{"name": "武陵区", "id": "00180701"}, {"name": "鼎城区", "id": "00180702"}, {
            "name": "安乡县",
            "id": "00180703"
        }, {"name": "汉寿县", "id": "00180704"}, {"name": "澧县", "id": "00180705"}, {
            "name": "临澧县",
            "id": "00180706"
        }, {"name": "桃源县", "id": "00180707"}, {"name": "石门县", "id": "00180708"}, {"name": "津市市", "id": "00180709"}]
    }, {
        "name": "张家界市",
        "id": "001808",
        "childs": [{"name": "永定区", "id": "00180801"}, {"name": "武陵源区", "id": "00180802"}, {
            "name": "慈利县",
            "id": "00180803"
        }, {"name": "桑植县", "id": "00180804"}]
    }, {
        "name": "益阳市",
        "id": "001809",
        "childs": [{"name": "资阳区", "id": "00180901"}, {"name": "赫山区", "id": "00180902"}, {
            "name": "南县",
            "id": "00180903"
        }, {"name": "桃江县", "id": "00180904"}, {"name": "安化县", "id": "00180905"}, {"name": "沅江市", "id": "00180906"}]
    }, {
        "name": "郴州市",
        "id": "001810",
        "childs": [{"name": "北湖区", "id": "00181001"}, {"name": "苏仙区", "id": "00181002"}, {
            "name": "桂阳县",
            "id": "00181003"
        }, {"name": "宜章县", "id": "00181004"}, {"name": "永兴县", "id": "00181005"}, {
            "name": "嘉禾县",
            "id": "00181006"
        }, {"name": "临武县", "id": "00181007"}, {"name": "汝城县", "id": "00181008"}, {
            "name": "桂东县",
            "id": "00181009"
        }, {"name": "安仁县", "id": "00181010"}, {"name": "资兴市", "id": "00181011"}]
    }, {
        "name": "永州市",
        "id": "001811",
        "childs": [{"name": "零陵区", "id": "00181101"}, {"name": "冷水滩区", "id": "00181102"}, {
            "name": "祁阳县",
            "id": "00181103"
        }, {"name": "东安县", "id": "00181104"}, {"name": "双牌县", "id": "00181105"}, {
            "name": "道县",
            "id": "00181106"
        }, {"name": "江永县", "id": "00181107"}, {"name": "宁远县", "id": "00181108"}, {
            "name": "蓝山县",
            "id": "00181109"
        }, {"name": "新田县", "id": "00181110"}, {"name": "江华瑶族自治县", "id": "00181111"}]
    }, {
        "name": "怀化市",
        "id": "001812",
        "childs": [{"name": "鹤城区", "id": "00181201"}, {"name": "中方县", "id": "00181202"}, {
            "name": "沅陵县",
            "id": "00181203"
        }, {"name": "辰溪县", "id": "00181204"}, {"name": "溆浦县", "id": "00181205"}, {
            "name": "会同县",
            "id": "00181206"
        }, {"name": "麻阳苗族自治县", "id": "00181207"}, {"name": "新晃侗族自治县", "id": "00181208"}, {
            "name": "芷江侗族自治县",
            "id": "00181209"
        }, {"name": "靖州苗族侗族自治县", "id": "00181210"}, {"name": "通道侗族自治县", "id": "00181211"}, {
            "name": "洪江市",
            "id": "00181212"
        }]
    }, {
        "name": "娄底市",
        "id": "001813",
        "childs": [{"name": "娄星区", "id": "00181301"}, {"name": "双峰县", "id": "00181302"}, {
            "name": "新化县",
            "id": "00181303"
        }, {"name": "冷水江市", "id": "00181304"}, {"name": "涟源市", "id": "00181305"}]
    }, {
        "name": "湘西土家族苗族自治州",
        "id": "001814",
        "childs": [{"name": "吉首市", "id": "00181401"}, {"name": "泸溪县", "id": "00181402"}, {
            "name": "凤凰县",
            "id": "00181403"
        }, {"name": "花垣县", "id": "00181404"}, {"name": "保靖县", "id": "00181405"}, {
            "name": "古丈县",
            "id": "00181406"
        }, {"name": "永顺县", "id": "00181407"}, {"name": "龙山县", "id": "00181408"}]
    }]
}, {
    "name": "广东省",
    "id": "0019",
    "childs": [{
        "name": "广州市",
        "id": "001901",
        "childs": [{"name": "荔湾区", "id": "00190101"}, {"name": "越秀区", "id": "00190102"}, {
            "name": "海珠区",
            "id": "00190103"
        }, {"name": "天河区", "id": "00190104"}, {"name": "白云区", "id": "00190105"}, {
            "name": "黄埔区",
            "id": "00190106"
        }, {"name": "番禺区", "id": "00190107"}, {"name": "花都区", "id": "00190108"}, {
            "name": "南沙区",
            "id": "00190109"
        }, {"name": "萝岗区", "id": "00190110"}, {"name": "从化区", "id": "00190111"}, {"name": "增城区", "id": "00190112"}]
    }, {
        "name": "韶关市",
        "id": "001902",
        "childs": [{"name": "武江区", "id": "00190201"}, {"name": "浈江区", "id": "00190202"}, {
            "name": "曲江区",
            "id": "00190203"
        }, {"name": "始兴县", "id": "00190204"}, {"name": "仁化县", "id": "00190205"}, {
            "name": "翁源县",
            "id": "00190206"
        }, {"name": "乳源瑶族自治县", "id": "00190207"}, {"name": "新丰县", "id": "00190208"}, {
            "name": "乐昌市",
            "id": "00190209"
        }, {"name": "南雄市", "id": "00190210"}]
    }, {
        "name": "深圳市",
        "id": "001903",
        "childs": [{"name": "罗湖区", "id": "00190301"}, {"name": "福田区", "id": "00190302"}, {
            "name": "南山区",
            "id": "00190303"
        }, {"name": "宝安区", "id": "00190304"}, {"name": "龙岗区", "id": "00190305"}, {"name": "盐田区", "id": "00190306"}]
    }, {
        "name": "珠海市",
        "id": "001904",
        "childs": [{"name": "香洲区", "id": "00190401"}, {"name": "斗门区", "id": "00190402"}, {
            "name": "金湾区",
            "id": "00190403"
        }]
    }, {
        "name": "汕头市",
        "id": "001905",
        "childs": [{"name": "龙湖区", "id": "00190501"}, {"name": "金平区", "id": "00190502"}, {
            "name": "濠江区",
            "id": "00190503"
        }, {"name": "潮阳区", "id": "00190504"}, {"name": "潮南区", "id": "00190505"}, {
            "name": "澄海区",
            "id": "00190506"
        }, {"name": "南澳县", "id": "00190507"}]
    }, {
        "name": "佛山市",
        "id": "001906",
        "childs": [{"name": "禅城区", "id": "00190601"}, {"name": "南海区", "id": "00190602"}, {
            "name": "顺德区",
            "id": "00190603"
        }, {"name": "三水区", "id": "00190604"}, {"name": "高明区", "id": "00190605"}]
    }, {
        "name": "江门市",
        "id": "001907",
        "childs": [{"name": "蓬江区", "id": "00190701"}, {"name": "江海区", "id": "00190702"}, {
            "name": "新会区",
            "id": "00190703"
        }, {"name": "台山市", "id": "00190704"}, {"name": "开平市", "id": "00190705"}, {
            "name": "鹤山市",
            "id": "00190706"
        }, {"name": "恩平市", "id": "00190707"}]
    }, {
        "name": "湛江市",
        "id": "001908",
        "childs": [{"name": "赤坎区", "id": "00190801"}, {"name": "霞山区", "id": "00190802"}, {
            "name": "坡头区",
            "id": "00190803"
        }, {"name": "麻章区", "id": "00190804"}, {"name": "遂溪县", "id": "00190805"}, {
            "name": "徐闻县",
            "id": "00190806"
        }, {"name": "廉江市", "id": "00190807"}, {"name": "雷州市", "id": "00190808"}, {"name": "吴川市", "id": "00190809"}]
    }, {
        "name": "茂名市",
        "id": "001909",
        "childs": [{"name": "茂南区", "id": "00190901"}, {"name": "电白区", "id": "00190902"}, {
            "name": "高州市",
            "id": "00190903"
        }, {"name": "化州市", "id": "00190904"}, {"name": "信宜市", "id": "00190905"}]
    }, {
        "name": "肇庆市",
        "id": "001910",
        "childs": [{"name": "端州区", "id": "00191001"}, {"name": "鼎湖区", "id": "00191002"}, {
            "name": "广宁县",
            "id": "00191003"
        }, {"name": "怀集县", "id": "00191004"}, {"name": "封开县", "id": "00191005"}, {
            "name": "德庆县",
            "id": "00191006"
        }, {"name": "高要市", "id": "00191007"}, {"name": "四会市", "id": "00191008"}]
    }, {
        "name": "惠州市",
        "id": "001911",
        "childs": [{"name": "惠城区", "id": "00191101"}, {"name": "惠阳区", "id": "00191102"}, {
            "name": "博罗县",
            "id": "00191103"
        }, {"name": "惠东县", "id": "00191104"}, {"name": "龙门县", "id": "00191105"}]
    }, {
        "name": "梅州市",
        "id": "001912",
        "childs": [{"name": "梅江区", "id": "00191201"}, {"name": "梅县区", "id": "00191202"}, {
            "name": "大埔县",
            "id": "00191203"
        }, {"name": "丰顺县", "id": "00191204"}, {"name": "五华县", "id": "00191205"}, {
            "name": "平远县",
            "id": "00191206"
        }, {"name": "蕉岭县", "id": "00191207"}, {"name": "兴宁市", "id": "00191208"}]
    }, {
        "name": "汕尾市",
        "id": "001913",
        "childs": [{"name": "城区", "id": "00191301"}, {"name": "海丰县", "id": "00191302"}, {
            "name": "陆河县",
            "id": "00191303"
        }, {"name": "陆丰市", "id": "00191304"}]
    }, {
        "name": "河源市",
        "id": "001914",
        "childs": [{"name": "源城区", "id": "00191401"}, {"name": "紫金县", "id": "00191402"}, {
            "name": "龙川县",
            "id": "00191403"
        }, {"name": "连平县", "id": "00191404"}, {"name": "和平县", "id": "00191405"}, {"name": "东源县", "id": "00191406"}]
    }, {
        "name": "阳江市",
        "id": "001915",
        "childs": [{"name": "江城区", "id": "00191501"}, {"name": "阳西县", "id": "00191502"}, {
            "name": "阳东县",
            "id": "00191503"
        }, {"name": "阳春市", "id": "00191504"}]
    }, {
        "name": "清远市",
        "id": "001916",
        "childs": [{"name": "清城区", "id": "00191601"}, {"name": "清新区", "id": "00191602"}, {
            "name": "佛冈县",
            "id": "00191603"
        }, {"name": "阳山县", "id": "00191604"}, {"name": "连山壮族瑶族自治县", "id": "00191605"}, {
            "name": "连南瑶族自治县",
            "id": "00191606"
        }, {"name": "英德市", "id": "00191607"}, {"name": "连州市", "id": "00191608"}]
    }, {"name": "东莞市", "id": "001917", "childs": [{"name": "东莞市区", "id": "00191701"}]}, {
        "name": "中山市",
        "id": "001918",
        "childs": [{"name": "中山市区", "id": "00191801"}]
    }, {
        "name": "潮州市",
        "id": "001919",
        "childs": [{"name": "湘桥区", "id": "00191901"}, {"name": "潮安区", "id": "00191902"}, {
            "name": "饶平县",
            "id": "00191903"
        }]
    }, {
        "name": "揭阳市",
        "id": "001920",
        "childs": [{"name": "榕城区", "id": "00192001"}, {"name": "揭东区", "id": "00192002"}, {
            "name": "揭西县",
            "id": "00192003"
        }, {"name": "惠来县", "id": "00192004"}, {"name": "普宁市", "id": "00192005"}]
    }, {
        "name": "云浮市",
        "id": "001921",
        "childs": [{"name": "云城区", "id": "00192101"}, {"name": "云安区", "id": "00192102"}, {
            "name": "新兴县",
            "id": "00192103"
        }, {"name": "郁南县", "id": "00192104"}, {"name": "罗定市", "id": "00192105"}]
    }]
}, {
    "name": "广西壮族自治区",
    "id": "0020",
    "childs": [{
        "name": "南宁市",
        "id": "002001",
        "childs": [{"name": "兴宁区", "id": "00200101"}, {"name": "青秀区", "id": "00200102"}, {
            "name": "江南区",
            "id": "00200103"
        }, {"name": "西乡塘区", "id": "00200104"}, {"name": "良庆区", "id": "00200105"}, {
            "name": "邕宁区",
            "id": "00200106"
        }, {"name": "武鸣县", "id": "00200107"}, {"name": "隆安县", "id": "00200108"}, {
            "name": "马山县",
            "id": "00200109"
        }, {"name": "上林县", "id": "00200110"}, {"name": "宾阳县", "id": "00200111"}, {"name": "横县", "id": "00200112"}]
    }, {
        "name": "柳州市",
        "id": "002002",
        "childs": [{"name": "城中区", "id": "00200201"}, {"name": "鱼峰区", "id": "00200202"}, {
            "name": "柳南区",
            "id": "00200203"
        }, {"name": "柳北区", "id": "00200204"}, {"name": "柳江县", "id": "00200205"}, {
            "name": "柳城县",
            "id": "00200206"
        }, {"name": "鹿寨县", "id": "00200207"}, {"name": "融安县", "id": "00200208"}, {
            "name": "融水苗族自治县",
            "id": "00200209"
        }, {"name": "三江侗族自治县", "id": "00200210"}]
    }, {
        "name": "桂林市",
        "id": "002003",
        "childs": [{"name": "秀峰区", "id": "00200301"}, {"name": "叠彩区", "id": "00200302"}, {
            "name": "象山区",
            "id": "00200303"
        }, {"name": "七星区", "id": "00200304"}, {"name": "雁山区", "id": "00200305"}, {
            "name": "临桂区",
            "id": "00200306"
        }, {"name": "阳朔县", "id": "00200307"}, {"name": "灵川县", "id": "00200308"}, {
            "name": "全州县",
            "id": "00200309"
        }, {"name": "兴安县", "id": "00200310"}, {"name": "永福县", "id": "00200311"}, {
            "name": "灌阳县",
            "id": "00200312"
        }, {"name": "龙胜各族自治县", "id": "00200313"}, {"name": "资源县", "id": "00200314"}, {
            "name": "平乐县",
            "id": "00200315"
        }, {"name": "荔浦县", "id": "00200316"}, {"name": "恭城瑶族自治县", "id": "00200317"}]
    }, {
        "name": "梧州市",
        "id": "002004",
        "childs": [{"name": "万秀区", "id": "00200401"}, {"name": "长洲区", "id": "00200402"}, {
            "name": "龙圩区",
            "id": "00200403"
        }, {"name": "苍梧县", "id": "00200404"}, {"name": "藤县", "id": "00200405"}, {
            "name": "蒙山县",
            "id": "00200406"
        }, {"name": "岑溪市", "id": "00200407"}]
    }, {
        "name": "北海市",
        "id": "002005",
        "childs": [{"name": "海城区", "id": "00200501"}, {"name": "银海区", "id": "00200502"}, {
            "name": "铁山港区",
            "id": "00200503"
        }, {"name": "合浦县", "id": "00200504"}]
    }, {
        "name": "防城港市",
        "id": "002006",
        "childs": [{"name": "港口区", "id": "00200601"}, {"name": "防城区", "id": "00200602"}, {
            "name": "上思县",
            "id": "00200603"
        }, {"name": "东兴市", "id": "00200604"}]
    }, {
        "name": "钦州市",
        "id": "002007",
        "childs": [{"name": "钦南区", "id": "00200701"}, {"name": "钦北区", "id": "00200702"}, {
            "name": "灵山县",
            "id": "00200703"
        }, {"name": "浦北县", "id": "00200704"}]
    }, {
        "name": "贵港市",
        "id": "002008",
        "childs": [{"name": "港北区", "id": "00200801"}, {"name": "港南区", "id": "00200802"}, {
            "name": "覃塘区",
            "id": "00200803"
        }, {"name": "平南县", "id": "00200804"}, {"name": "桂平市", "id": "00200805"}]
    }, {
        "name": "玉林市",
        "id": "002009",
        "childs": [{"name": "玉州区", "id": "00200901"}, {"name": "福绵区", "id": "00200902"}, {
            "name": "容县",
            "id": "00200903"
        }, {"name": "陆川县", "id": "00200904"}, {"name": "博白县", "id": "00200905"}, {
            "name": "兴业县",
            "id": "00200906"
        }, {"name": "北流市", "id": "00200907"}]
    }, {"name": "南宁地区", "id": "002010", "childs": [{"name": "南宁地区", "id": "00201001"}]}, {
        "name": "柳州地区",
        "id": "002011",
        "childs": [{"name": "柳州地区", "id": "00201101"}]
    }, {
        "name": "贺州市",
        "id": "002012",
        "childs": [{"name": "八步区", "id": "00201201"}, {"name": "昭平县", "id": "00201202"}, {
            "name": "钟山县",
            "id": "00201203"
        }, {"name": "富川瑶族自治县", "id": "00201204"}]
    }, {
        "name": "百色市",
        "id": "002013",
        "childs": [{"name": "右江区", "id": "00201301"}, {"name": "田阳县", "id": "00201302"}, {
            "name": "田东县",
            "id": "00201303"
        }, {"name": "平果县", "id": "00201304"}, {"name": "德保县", "id": "00201305"}, {
            "name": "靖西县",
            "id": "00201306"
        }, {"name": "那坡县", "id": "00201307"}, {"name": "凌云县", "id": "00201308"}, {
            "name": "乐业县",
            "id": "00201309"
        }, {"name": "田林县", "id": "00201310"}, {"name": "西林县", "id": "00201311"}, {"name": "隆林各族自治县", "id": "00201312"}]
    }, {
        "name": "河池市",
        "id": "002014",
        "childs": [{"name": "金城江区", "id": "00201401"}, {"name": "南丹县", "id": "00201402"}, {
            "name": "天峨县",
            "id": "00201403"
        }, {"name": "凤山县", "id": "00201404"}, {"name": "东兰县", "id": "00201405"}, {
            "name": "罗城仫佬族自治县",
            "id": "00201406"
        }, {"name": "环江毛南族自治县", "id": "00201407"}, {"name": "巴马瑶族自治县", "id": "00201408"}, {
            "name": "都安瑶族自治县",
            "id": "00201409"
        }, {"name": "大化瑶族自治县", "id": "00201410"}, {"name": "宜州市", "id": "00201411"}]
    }, {
        "name": "来宾市",
        "id": "002015",
        "childs": [{"name": "兴宾区", "id": "00201501"}, {"name": "忻城县", "id": "00201502"}, {
            "name": "象州县",
            "id": "00201503"
        }, {"name": "武宣县", "id": "00201504"}, {"name": "金秀瑶族自治县", "id": "00201505"}, {"name": "合山市", "id": "00201506"}]
    }, {
        "name": "崇左市",
        "id": "002016",
        "childs": [{"name": "江州区", "id": "00201601"}, {"name": "扶绥县", "id": "00201602"}, {
            "name": "宁明县",
            "id": "00201603"
        }, {"name": "龙州县", "id": "00201604"}, {"name": "大新县", "id": "00201605"}, {
            "name": "天等县",
            "id": "00201606"
        }, {"name": "凭祥市", "id": "00201607"}]
    }]
}, {
    "name": "海南省",
    "id": "0021",
    "childs": [{
        "name": "海口市",
        "id": "002101",
        "childs": [{"name": "秀英区", "id": "00210101"}, {"name": "龙华区", "id": "00210102"}, {
            "name": "琼山区",
            "id": "00210103"
        }, {"name": "美兰区", "id": "00210104"}]
    }, {
        "name": "三亚市",
        "id": "002102",
        "childs": [{"name": "海棠区", "id": "00210201"}, {"name": "吉阳区", "id": "00210202"}, {
            "name": "天涯区",
            "id": "00210203"
        }, {"name": "崖州区", "id": "00210204"}]
    }, {
        "name": "儋州",
        "id": "002103",
        "childs": [{"name": "那大镇", "id": "00210301"}, {"name": "和庆镇", "id": "00210302"}, {
            "name": "南丰镇",
            "id": "00210303"
        }, {"name": "大成镇", "id": "00210304"}, {"name": "雅星镇", "id": "00210305"}, {
            "name": "兰洋镇",
            "id": "00210306"
        }, {"name": "光村镇", "id": "00210307"}, {"name": "木棠镇", "id": "00210308"}, {
            "name": "海头镇",
            "id": "00210309"
        }, {"name": "峨蔓镇", "id": "00210310"}, {"name": "三都镇", "id": "00210311"}, {
            "name": "王五镇",
            "id": "00210312"
        }, {"name": "白马井镇", "id": "00210313"}, {"name": "中和镇", "id": "00210314"}, {
            "name": "排浦镇",
            "id": "00210315"
        }, {"name": "东成镇", "id": "00210316"}, {"name": "新州镇", "id": "00210317"}]
    }, {
        "name": "五指山",
        "id": "002104",
        "childs": [{"name": "通什镇", "id": "00210401"}, {"name": "南圣镇", "id": "00210402"}, {
            "name": "毛阳镇",
            "id": "00210403"
        }, {"name": "番阳镇", "id": "00210404"}, {"name": "畅好乡", "id": "00210405"}, {
            "name": "毛道乡",
            "id": "00210406"
        }, {"name": "水满乡", "id": "00210407"}]
    }, {
        "name": "琼海",
        "id": "002105",
        "childs": [{"name": "嘉积镇", "id": "00210501"}, {"name": "万泉镇", "id": "00210502"}, {
            "name": "石壁镇",
            "id": "00210503"
        }, {"name": "中原镇", "id": "00210504"}, {"name": "博鳌镇", "id": "00210505"}, {
            "name": "阳江镇",
            "id": "00210506"
        }, {"name": "龙江镇", "id": "00210507"}, {"name": "潭门镇", "id": "00210508"}, {
            "name": "塔洋镇",
            "id": "00210509"
        }, {"name": "长坡镇", "id": "00210510"}, {"name": "大路镇", "id": "00210511"}, {"name": "会山镇", "id": "00210512"}]
    }, {
        "name": "琼山",
        "id": "002106",
        "childs": [{"name": "府城街道", "id": "00210601"}, {"name": "滨江街道", "id": "00210602"}, {
            "name": "凤翔街道",
            "id": "00210603"
        }, {"name": "国兴街道", "id": "00210604"}, {"name": "龙塘镇", "id": "00210605"}, {
            "name": "云龙镇",
            "id": "00210606"
        }, {"name": "红旗镇", "id": "00210607"}, {"name": "旧州镇", "id": "00210608"}, {
            "name": "三门坡镇",
            "id": "00210609"
        }, {"name": "甲子镇", "id": "00210610"}, {"name": "大坡镇", "id": "00210611"}]
    }, {
        "name": "文昌",
        "id": "002107",
        "childs": [{"name": "文城镇", "id": "00210701"}, {"name": "重兴镇", "id": "00210702"}, {
            "name": "蓬莱镇",
            "id": "00210703"
        }, {"name": "会文镇", "id": "00210704"}, {"name": "东路镇", "id": "00210705"}, {
            "name": "潭牛镇",
            "id": "00210706"
        }, {"name": "东阁镇", "id": "00210707"}, {"name": "文教镇", "id": "00210708"}, {
            "name": "东郊镇",
            "id": "00210709"
        }, {"name": "龙楼镇", "id": "00210710"}, {"name": "昌洒镇", "id": "00210711"}, {
            "name": "翁田镇",
            "id": "00210712"
        }, {"name": "抱罗镇", "id": "00210713"}, {"name": "冯坡镇", "id": "00210714"}, {
            "name": "锦山镇",
            "id": "00210715"
        }, {"name": "铺前镇", "id": "00210716"}, {"name": "公坡镇", "id": "00210717"}]
    }, {
        "name": "万宁",
        "id": "002108",
        "childs": [{"name": "万城镇", "id": "00210801"}, {"name": "龙滚镇", "id": "00210802"}, {
            "name": "山根镇",
            "id": "00210803"
        }, {"name": "后安镇", "id": "00210804"}, {"name": "大茂镇", "id": "00210805"}, {
            "name": "东澳镇",
            "id": "00210806"
        }, {"name": "礼纪镇", "id": "00210807"}, {"name": "长丰镇", "id": "00210808"}, {
            "name": "北大镇",
            "id": "00210809"
        }, {"name": "南桥镇", "id": "00210810"}, {"name": "三更罗镇", "id": "00210811"}, {"name": "和乐镇", "id": "00210812"}]
    }, {
        "name": "东方",
        "id": "002109",
        "childs": [{"name": "八所镇", "id": "00210901"}, {"name": "东河镇", "id": "00210902"}, {
            "name": "大田镇",
            "id": "00210903"
        }, {"name": "感城镇", "id": "00210904"}, {"name": "板桥镇", "id": "00210905"}, {
            "name": "三家镇",
            "id": "00210906"
        }, {"name": "四更镇", "id": "00210907"}, {"name": "新龙镇", "id": "00210908"}, {
            "name": "天安乡",
            "id": "00210909"
        }, {"name": "江边乡", "id": "00210910"}]
    }, {"name": "其他", "id": "002110", "childs": [{"name": "其他地区", "id": "00211001"}]}]
}, {
    "name": "四川省",
    "id": "0023",
    "childs": [{
        "name": "成都市",
        "id": "002301",
        "childs": [{"name": "锦江区", "id": "00230101"}, {"name": "青羊区", "id": "00230102"}, {
            "name": "金牛区",
            "id": "00230103"
        }, {"name": "武侯区", "id": "00230104"}, {"name": "成华区", "id": "00230105"}, {
            "name": "龙泉驿区",
            "id": "00230106"
        }, {"name": "青白江区", "id": "00230107"}, {"name": "新都区", "id": "00230108"}, {
            "name": "温江区",
            "id": "00230109"
        }, {"name": "金堂县", "id": "00230110"}, {"name": "双流县", "id": "00230111"}, {
            "name": "郫县",
            "id": "00230112"
        }, {"name": "大邑县", "id": "00230113"}, {"name": "蒲江县", "id": "00230114"}, {
            "name": "新津县",
            "id": "00230115"
        }, {"name": "都江堰市", "id": "00230116"}, {"name": "彭州市", "id": "00230117"}, {
            "name": "邛崃市",
            "id": "00230118"
        }, {"name": "崇州市", "id": "00230119"}]
    }, {
        "name": "自贡市",
        "id": "002302",
        "childs": [{"name": "自流井区", "id": "00230201"}, {"name": "贡井区", "id": "00230202"}, {
            "name": "大安区",
            "id": "00230203"
        }, {"name": "沿滩区", "id": "00230204"}, {"name": "荣县", "id": "00230205"}, {"name": "富顺县", "id": "00230206"}]
    }, {
        "name": "攀枝花市",
        "id": "002303",
        "childs": [{"name": "东区", "id": "00230301"}, {"name": "西区", "id": "00230302"}, {
            "name": "仁和区",
            "id": "00230303"
        }, {"name": "米易县", "id": "00230304"}, {"name": "盐边县", "id": "00230305"}]
    }, {
        "name": "泸州市",
        "id": "002304",
        "childs": [{"name": "江阳区", "id": "00230401"}, {"name": "纳溪区", "id": "00230402"}, {
            "name": "龙马潭区",
            "id": "00230403"
        }, {"name": "泸县", "id": "00230404"}, {"name": "合江县", "id": "00230405"}, {
            "name": "叙永县",
            "id": "00230406"
        }, {"name": "古蔺县", "id": "00230407"}]
    }, {
        "name": "德阳市",
        "id": "002305",
        "childs": [{"name": "旌阳区", "id": "00230501"}, {"name": "中江县", "id": "00230502"}, {
            "name": "罗江县",
            "id": "00230503"
        }, {"name": "广汉市", "id": "00230504"}, {"name": "什邡市", "id": "00230505"}, {"name": "绵竹市", "id": "00230506"}]
    }, {
        "name": "绵阳市",
        "id": "002306",
        "childs": [{"name": "涪城区", "id": "00230601"}, {"name": "游仙区", "id": "00230602"}, {
            "name": "三台县",
            "id": "00230603"
        }, {"name": "盐亭县", "id": "00230604"}, {"name": "安县", "id": "00230605"}, {
            "name": "梓潼县",
            "id": "00230606"
        }, {"name": "北川羌族自治县", "id": "00230607"}, {"name": "平武县", "id": "00230608"}, {"name": "江油市", "id": "00230609"}]
    }, {
        "name": "广元市",
        "id": "002307",
        "childs": [{"name": "利州区", "id": "00230701"}, {"name": "昭化区", "id": "00230702"}, {
            "name": "朝天区",
            "id": "00230703"
        }, {"name": "旺苍县", "id": "00230704"}, {"name": "青川县", "id": "00230705"}, {
            "name": "剑阁县",
            "id": "00230706"
        }, {"name": "苍溪县", "id": "00230707"}]
    }, {
        "name": "遂宁市",
        "id": "002308",
        "childs": [{"name": "船山区", "id": "00230801"}, {"name": "安居区", "id": "00230802"}, {
            "name": "蓬溪县",
            "id": "00230803"
        }, {"name": "射洪县", "id": "00230804"}, {"name": "大英县", "id": "00230805"}]
    }, {
        "name": "内江市",
        "id": "002309",
        "childs": [{"name": "市中区", "id": "00230901"}, {"name": "东兴区", "id": "00230902"}, {
            "name": "威远县",
            "id": "00230903"
        }, {"name": "资中县", "id": "00230904"}, {"name": "隆昌县", "id": "00230905"}]
    }, {
        "name": "乐山市",
        "id": "002310",
        "childs": [{"name": "市中区", "id": "00231001"}, {"name": "沙湾区", "id": "00231002"}, {
            "name": "五通桥区",
            "id": "00231003"
        }, {"name": "金口河区", "id": "00231004"}, {"name": "犍为县", "id": "00231005"}, {
            "name": "井研县",
            "id": "00231006"
        }, {"name": "夹江县", "id": "00231007"}, {"name": "沐川县", "id": "00231008"}, {
            "name": "峨边彝族自治县",
            "id": "00231009"
        }, {"name": "马边彝族自治县", "id": "00231010"}, {"name": "峨眉山市", "id": "00231011"}]
    }, {
        "name": "南充市",
        "id": "002311",
        "childs": [{"name": "顺庆区", "id": "00231101"}, {"name": "高坪区", "id": "00231102"}, {
            "name": "嘉陵区",
            "id": "00231103"
        }, {"name": "南部县", "id": "00231104"}, {"name": "营山县", "id": "00231105"}, {
            "name": "蓬安县",
            "id": "00231106"
        }, {"name": "仪陇县", "id": "00231107"}, {"name": "西充县", "id": "00231108"}, {"name": "阆中市", "id": "00231109"}]
    }, {
        "name": "眉山市",
        "id": "002312",
        "childs": [{"name": "东坡区", "id": "00231201"}, {"name": "仁寿县", "id": "00231202"}, {
            "name": "彭山县",
            "id": "00231203"
        }, {"name": "洪雅县", "id": "00231204"}, {"name": "丹棱县", "id": "00231205"}, {"name": "青神县", "id": "00231206"}]
    }, {
        "name": "宜宾市",
        "id": "002313",
        "childs": [{"name": "翠屏区", "id": "00231301"}, {"name": "南溪区", "id": "00231302"}, {
            "name": "宜宾县",
            "id": "00231303"
        }, {"name": "江安县", "id": "00231304"}, {"name": "长宁县", "id": "00231305"}, {
            "name": "高县",
            "id": "00231306"
        }, {"name": "珙县", "id": "00231307"}, {"name": "筠连县", "id": "00231308"}, {
            "name": "兴文县",
            "id": "00231309"
        }, {"name": "屏山县", "id": "00231310"}]
    }, {
        "name": "广安市",
        "id": "002314",
        "childs": [{"name": "广安区", "id": "00231401"}, {"name": "前锋区", "id": "00231402"}, {
            "name": "岳池县",
            "id": "00231403"
        }, {"name": "武胜县", "id": "00231404"}, {"name": "邻水县", "id": "00231405"}, {"name": "华蓥市", "id": "00231406"}]
    }, {
        "name": "达州市",
        "id": "002315",
        "childs": [{"name": "通川区", "id": "00231501"}, {"name": "达川区", "id": "00231502"}, {
            "name": "宣汉县",
            "id": "00231503"
        }, {"name": "开江县", "id": "00231504"}, {"name": "大竹县", "id": "00231505"}, {
            "name": "渠县",
            "id": "00231506"
        }, {"name": "万源市", "id": "00231507"}]
    }, {
        "name": "雅安市",
        "id": "002316",
        "childs": [{"name": "雨城区", "id": "00231601"}, {"name": "名山区", "id": "00231602"}, {
            "name": "荥经县",
            "id": "00231603"
        }, {"name": "汉源县", "id": "00231604"}, {"name": "石棉县", "id": "00231605"}, {
            "name": "天全县",
            "id": "00231606"
        }, {"name": "芦山县", "id": "00231607"}, {"name": "宝兴县", "id": "00231608"}]
    }, {
        "name": "巴中市",
        "id": "002317",
        "childs": [{"name": "巴州区", "id": "00231701"}, {"name": "恩阳区", "id": "00231702"}, {
            "name": "通江县",
            "id": "00231703"
        }, {"name": "南江县", "id": "00231704"}, {"name": "平昌县", "id": "00231705"}]
    }, {
        "name": "资阳市",
        "id": "002318",
        "childs": [{"name": "雁江区", "id": "00231801"}, {"name": "安岳县", "id": "00231802"}, {
            "name": "乐至县",
            "id": "00231803"
        }, {"name": "简阳市", "id": "00231804"}]
    }, {
        "name": "阿坝藏族羌族自治州",
        "id": "002319",
        "childs": [{"name": "汶川县", "id": "00231901"}, {"name": "理县", "id": "00231902"}, {
            "name": "茂县",
            "id": "00231903"
        }, {"name": "松潘县", "id": "00231904"}, {"name": "九寨沟县", "id": "00231905"}, {
            "name": "金川县",
            "id": "00231906"
        }, {"name": "小金县", "id": "00231907"}, {"name": "黑水县", "id": "00231908"}, {
            "name": "马尔康县",
            "id": "00231909"
        }, {"name": "壤塘县", "id": "00231910"}, {"name": "阿坝县", "id": "00231911"}, {
            "name": "若尔盖县",
            "id": "00231912"
        }, {"name": "红原县", "id": "00231913"}]
    }, {
        "name": "甘孜藏族自治州",
        "id": "002320",
        "childs": [{"name": "康定县", "id": "00232001"}, {"name": "泸定县", "id": "00232002"}, {
            "name": "丹巴县",
            "id": "00232003"
        }, {"name": "九龙县", "id": "00232004"}, {"name": "雅江县", "id": "00232005"}, {
            "name": "道孚县",
            "id": "00232006"
        }, {"name": "炉霍县", "id": "00232007"}, {"name": "甘孜县", "id": "00232008"}, {
            "name": "新龙县",
            "id": "00232009"
        }, {"name": "德格县", "id": "00232010"}, {"name": "白玉县", "id": "00232011"}, {
            "name": "石渠县",
            "id": "00232012"
        }, {"name": "色达县", "id": "00232013"}, {"name": "理塘县", "id": "00232014"}, {
            "name": "巴塘县",
            "id": "00232015"
        }, {"name": "乡城县", "id": "00232016"}, {"name": "稻城县", "id": "00232017"}, {"name": "得荣县", "id": "00232018"}]
    }, {
        "name": "凉山彝族自治州",
        "id": "002321",
        "childs": [{"name": "西昌市", "id": "00232101"}, {"name": "木里藏族自治县", "id": "00232102"}, {
            "name": "盐源县",
            "id": "00232103"
        }, {"name": "德昌县", "id": "00232104"}, {"name": "会理县", "id": "00232105"}, {
            "name": "会东县",
            "id": "00232106"
        }, {"name": "宁南县", "id": "00232107"}, {"name": "普格县", "id": "00232108"}, {
            "name": "布拖县",
            "id": "00232109"
        }, {"name": "金阳县", "id": "00232110"}, {"name": "昭觉县", "id": "00232111"}, {
            "name": "喜德县",
            "id": "00232112"
        }, {"name": "冕宁县", "id": "00232113"}, {"name": "越西县", "id": "00232114"}, {
            "name": "甘洛县",
            "id": "00232115"
        }, {"name": "美姑县", "id": "00232116"}, {"name": "雷波县", "id": "00232117"}]
    }]
}, {
    "name": "贵州省",
    "id": "0024",
    "childs": [{
        "name": "贵阳市",
        "id": "002401",
        "childs": [{"name": "南明区", "id": "00240101"}, {"name": "云岩区", "id": "00240102"}, {
            "name": "花溪区",
            "id": "00240103"
        }, {"name": "乌当区", "id": "00240104"}, {"name": "白云区", "id": "00240105"}, {
            "name": "观山湖区",
            "id": "00240106"
        }, {"name": "开阳县", "id": "00240107"}, {"name": "息烽县", "id": "00240108"}, {
            "name": "修文县",
            "id": "00240109"
        }, {"name": "清镇市", "id": "00240110"}]
    }, {
        "name": "六盘水市",
        "id": "002402",
        "childs": [{"name": "钟山区", "id": "00240201"}, {"name": "六枝特区", "id": "00240202"}, {
            "name": "水城县",
            "id": "00240203"
        }, {"name": "盘县", "id": "00240204"}]
    }, {
        "name": "遵义市",
        "id": "002403",
        "childs": [{"name": "红花岗区", "id": "00240301"}, {"name": "汇川区", "id": "00240302"}, {
            "name": "遵义县",
            "id": "00240303"
        }, {"name": "桐梓县", "id": "00240304"}, {"name": "绥阳县", "id": "00240305"}, {
            "name": "正安县",
            "id": "00240306"
        }, {"name": "道真仡佬族苗族自治县", "id": "00240307"}, {"name": "务川仡佬族苗族自治县", "id": "00240308"}, {
            "name": "凤冈县",
            "id": "00240309"
        }, {"name": "湄潭县", "id": "00240310"}, {"name": "余庆县", "id": "00240311"}, {
            "name": "习水县",
            "id": "00240312"
        }, {"name": "赤水市", "id": "00240313"}, {"name": "仁怀市", "id": "00240314"}]
    }, {
        "name": "安顺市",
        "id": "002404",
        "childs": [{"name": "西秀区", "id": "00240401"}, {"name": "平坝县", "id": "00240402"}, {
            "name": "普定县",
            "id": "00240403"
        }, {"name": "镇宁布依族苗族自治县", "id": "00240404"}, {"name": "关岭布依族苗族自治县", "id": "00240405"}, {
            "name": "紫云苗族布依族自治县",
            "id": "00240406"
        }]
    }, {
        "name": "铜仁市",
        "id": "002405",
        "childs": [{"name": "碧江区", "id": "00240501"}, {"name": "万山区", "id": "00240502"}, {
            "name": "江口县",
            "id": "00240503"
        }, {"name": "玉屏侗族自治县", "id": "00240504"}, {"name": "石阡县", "id": "00240505"}, {
            "name": "思南县",
            "id": "00240506"
        }, {"name": "印江土家族苗族自治县", "id": "00240507"}, {"name": "德江县", "id": "00240508"}, {
            "name": "沿河土家族自治县",
            "id": "00240509"
        }, {"name": "松桃苗族自治县", "id": "00240510"}]
    }, {
        "name": "黔西南布依族苗族自治州",
        "id": "002406",
        "childs": [{"name": "兴义市", "id": "00240601"}, {"name": "兴仁县", "id": "00240602"}, {
            "name": "普安县",
            "id": "00240603"
        }, {"name": "晴隆县", "id": "00240604"}, {"name": "贞丰县", "id": "00240605"}, {
            "name": "望谟县",
            "id": "00240606"
        }, {"name": "册亨县", "id": "00240607"}, {"name": "安龙县", "id": "00240608"}]
    }, {
        "name": "毕节市",
        "id": "002407",
        "childs": [{"name": "七星关区", "id": "00240701"}, {"name": "大方县", "id": "00240702"}, {
            "name": "黔西县",
            "id": "00240703"
        }, {"name": "金沙县", "id": "00240704"}, {"name": "织金县", "id": "00240705"}, {
            "name": "纳雍县",
            "id": "00240706"
        }, {"name": "威宁彝族回族苗族自治县", "id": "00240707"}, {"name": "赫章县", "id": "00240708"}]
    }, {
        "name": "黔东南苗族侗族自治州",
        "id": "002408",
        "childs": [{"name": "凯里市", "id": "00240801"}, {"name": "黄平县", "id": "00240802"}, {
            "name": "施秉县",
            "id": "00240803"
        }, {"name": "三穗县", "id": "00240804"}, {"name": "镇远县", "id": "00240805"}, {
            "name": "岑巩县",
            "id": "00240806"
        }, {"name": "天柱县", "id": "00240807"}, {"name": "锦屏县", "id": "00240808"}, {
            "name": "剑河县",
            "id": "00240809"
        }, {"name": "台江县", "id": "00240810"}, {"name": "黎平县", "id": "00240811"}, {
            "name": "榕江县",
            "id": "00240812"
        }, {"name": "从江县", "id": "00240813"}, {"name": "雷山县", "id": "00240814"}, {
            "name": "麻江县",
            "id": "00240815"
        }, {"name": "丹寨县", "id": "00240816"}]
    }, {
        "name": "黔南布依族苗族自治州",
        "id": "002409",
        "childs": [{"name": "都匀市", "id": "00240901"}, {"name": "福泉市", "id": "00240902"}, {
            "name": "荔波县",
            "id": "00240903"
        }, {"name": "贵定县", "id": "00240904"}, {"name": "瓮安县", "id": "00240905"}, {
            "name": "独山县",
            "id": "00240906"
        }, {"name": "平塘县", "id": "00240907"}, {"name": "罗甸县", "id": "00240908"}, {
            "name": "长顺县",
            "id": "00240909"
        }, {"name": "龙里县", "id": "00240910"}, {"name": "惠水县", "id": "00240911"}, {"name": "三都水族自治县", "id": "00240912"}]
    }]
}, {
    "name": "云南省",
    "id": "0025",
    "childs": [{
        "name": "昆明市",
        "id": "002501",
        "childs": [{"name": "五华区", "id": "00250101"}, {"name": "盘龙区", "id": "00250102"}, {
            "name": "官渡区",
            "id": "00250103"
        }, {"name": "西山区", "id": "00250104"}, {"name": "东川区", "id": "00250105"}, {
            "name": "呈贡区",
            "id": "00250106"
        }, {"name": "晋宁县", "id": "00250107"}, {"name": "富民县", "id": "00250108"}, {
            "name": "宜良县",
            "id": "00250109"
        }, {"name": "石林彝族自治县", "id": "00250110"}, {"name": "嵩明县", "id": "00250111"}, {
            "name": "禄劝彝族苗族自治县",
            "id": "00250112"
        }, {"name": "寻甸回族彝族自治县", "id": "00250113"}, {"name": "安宁市", "id": "00250114"}]
    }, {
        "name": "曲靖市",
        "id": "002502",
        "childs": [{"name": "麒麟区", "id": "00250201"}, {"name": "马龙县", "id": "00250202"}, {
            "name": "陆良县",
            "id": "00250203"
        }, {"name": "师宗县", "id": "00250204"}, {"name": "罗平县", "id": "00250205"}, {
            "name": "富源县",
            "id": "00250206"
        }, {"name": "会泽县", "id": "00250207"}, {"name": "沾益县", "id": "00250208"}, {"name": "宣威市", "id": "00250209"}]
    }, {
        "name": "玉溪市",
        "id": "002503",
        "childs": [{"name": "红塔区", "id": "00250301"}, {"name": "江川县", "id": "00250302"}, {
            "name": "澄江县",
            "id": "00250303"
        }, {"name": "通海县", "id": "00250304"}, {"name": "华宁县", "id": "00250305"}, {
            "name": "易门县",
            "id": "00250306"
        }, {"name": "峨山彝族自治县", "id": "00250307"}, {"name": "新平彝族傣族自治县", "id": "00250308"}, {
            "name": "元江哈尼族彝族傣族自治县",
            "id": "00250309"
        }]
    }, {
        "name": "保山市",
        "id": "002504",
        "childs": [{"name": "隆阳区", "id": "00250401"}, {"name": "施甸县", "id": "00250402"}, {
            "name": "腾冲县",
            "id": "00250403"
        }, {"name": "龙陵县", "id": "00250404"}, {"name": "昌宁县", "id": "00250405"}]
    }, {
        "name": "昭通市",
        "id": "002505",
        "childs": [{"name": "昭阳区", "id": "00250501"}, {"name": "鲁甸县", "id": "00250502"}, {
            "name": "巧家县",
            "id": "00250503"
        }, {"name": "盐津县", "id": "00250504"}, {"name": "大关县", "id": "00250505"}, {
            "name": "永善县",
            "id": "00250506"
        }, {"name": "绥江县", "id": "00250507"}, {"name": "镇雄县", "id": "00250508"}, {
            "name": "彝良县",
            "id": "00250509"
        }, {"name": "威信县", "id": "00250510"}, {"name": "水富县", "id": "00250511"}]
    }, {
        "name": "楚雄彝族自治州",
        "id": "002506",
        "childs": [{"name": "楚雄市", "id": "00250601"}, {"name": "双柏县", "id": "00250602"}, {
            "name": "牟定县",
            "id": "00250603"
        }, {"name": "南华县", "id": "00250604"}, {"name": "姚安县", "id": "00250605"}, {
            "name": "大姚县",
            "id": "00250606"
        }, {"name": "永仁县", "id": "00250607"}, {"name": "元谋县", "id": "00250608"}, {
            "name": "武定县",
            "id": "00250609"
        }, {"name": "禄丰县", "id": "00250610"}]
    }, {
        "name": "红河哈尼族彝族自治州",
        "id": "002507",
        "childs": [{"name": "个旧市", "id": "00250701"}, {"name": "开远市", "id": "00250702"}, {
            "name": "蒙自市",
            "id": "00250703"
        }, {"name": "弥勒市", "id": "00250704"}, {"name": "屏边苗族自治县", "id": "00250705"}, {
            "name": "建水县",
            "id": "00250706"
        }, {"name": "石屏县", "id": "00250707"}, {"name": "泸西县", "id": "00250708"}, {
            "name": "元阳县",
            "id": "00250709"
        }, {"name": "红河县", "id": "00250710"}, {"name": "金平苗族瑶族傣族自治县", "id": "00250711"}, {
            "name": "绿春县",
            "id": "00250712"
        }, {"name": "河口瑶族自治县", "id": "00250713"}]
    }, {
        "name": "文山壮族苗族自治州",
        "id": "002508",
        "childs": [{"name": "文山市", "id": "00250801"}, {"name": "砚山县", "id": "00250802"}, {
            "name": "西畴县",
            "id": "00250803"
        }, {"name": "麻栗坡县", "id": "00250804"}, {"name": "马关县", "id": "00250805"}, {
            "name": "丘北县",
            "id": "00250806"
        }, {"name": "广南县", "id": "00250807"}, {"name": "富宁县", "id": "00250808"}]
    }, {
        "name": "普洱市",
        "id": "002509",
        "childs": [{"name": "思茅区", "id": "00250901"}, {"name": "宁洱哈尼族彝族自治县", "id": "00250902"}, {
            "name": "墨江哈尼族自治县",
            "id": "00250903"
        }, {"name": "景东彝族自治县", "id": "00250904"}, {"name": "镇沅彝族哈尼族拉祜族自治县", "id": "00250905"}, {
            "name": "江城哈尼族彝族自治县",
            "id": "00250906"
        }, {"name": "孟连傣族拉祜族佤族自治县", "id": "00250907"}, {"name": "澜沧拉祜族自治县", "id": "00250908"}, {
            "name": "西盟佤族自治县",
            "id": "00250909"
        }, {"name": "景谷傣族彝族自治县", "id": "00250910"}]
    }, {
        "name": "西双版纳傣族自治州",
        "id": "002510",
        "childs": [{"name": "景洪市", "id": "00251001"}, {"name": "勐海县", "id": "00251002"}, {
            "name": "勐腊县",
            "id": "00251003"
        }]
    }, {
        "name": "大理白族自治州",
        "id": "002511",
        "childs": [{"name": "大理市", "id": "00251101"}, {"name": "漾濞彝族自治县", "id": "00251102"}, {
            "name": "祥云县",
            "id": "00251103"
        }, {"name": "宾川县", "id": "00251104"}, {"name": "弥渡县", "id": "00251105"}, {
            "name": "南涧彝族自治县",
            "id": "00251106"
        }, {"name": "巍山彝族回族自治县", "id": "00251107"}, {"name": "永平县", "id": "00251108"}, {
            "name": "云龙县",
            "id": "00251109"
        }, {"name": "洱源县", "id": "00251110"}, {"name": "剑川县", "id": "00251111"}, {"name": "鹤庆县", "id": "00251112"}]
    }, {
        "name": "德宏傣族景颇族自治州",
        "id": "002512",
        "childs": [{"name": "瑞丽市", "id": "00251201"}, {"name": "芒市", "id": "00251202"}, {
            "name": "梁河县",
            "id": "00251203"
        }, {"name": "盈江县", "id": "00251204"}, {"name": "陇川县", "id": "00251205"}]
    }, {
        "name": "丽江市",
        "id": "002513",
        "childs": [{"name": "古城区", "id": "00251301"}, {"name": "玉龙纳西族自治县", "id": "00251302"}, {
            "name": "永胜县",
            "id": "00251303"
        }, {"name": "华坪县", "id": "00251304"}, {"name": "宁蒗彝族自治县", "id": "00251305"}]
    }, {
        "name": "怒江傈僳族自治州",
        "id": "002514",
        "childs": [{"name": "泸水县", "id": "00251401"}, {"name": "福贡县", "id": "00251402"}, {
            "name": "贡山独龙族怒族自治县",
            "id": "00251403"
        }, {"name": "兰坪白族普米族自治县", "id": "00251404"}]
    }, {
        "name": "迪庆藏族自治州",
        "id": "002515",
        "childs": [{"name": "香格里拉县", "id": "00251501"}, {"name": "德钦县", "id": "00251502"}, {
            "name": "维西傈僳族自治县",
            "id": "00251503"
        }]
    }, {
        "name": "临沧市",
        "id": "002516",
        "childs": [{"name": "临翔区", "id": "00251601"}, {"name": "凤庆县", "id": "00251602"}, {
            "name": "云县",
            "id": "00251603"
        }, {"name": "永德县", "id": "00251604"}, {"name": "镇康县", "id": "00251605"}, {
            "name": "双江拉祜族佤族布朗族傣族自治县",
            "id": "00251606"
        }, {"name": "耿马傣族佤族自治县", "id": "00251607"}, {"name": "沧源佤族自治县", "id": "00251608"}]
    }]
}, {
    "name": "西藏自治区",
    "id": "0026",
    "childs": [{
        "name": "拉萨市",
        "id": "002601",
        "childs": [{"name": "城关区", "id": "00260101"}, {"name": "林周县", "id": "00260102"}, {
            "name": "当雄县",
            "id": "00260103"
        }, {"name": "尼木县", "id": "00260104"}, {"name": "曲水县", "id": "00260105"}, {
            "name": "堆龙德庆县",
            "id": "00260106"
        }, {"name": "达孜县", "id": "00260107"}, {"name": "墨竹工卡县", "id": "00260108"}]
    }, {
        "name": "昌都地区",
        "id": "002602",
        "childs": [{"name": "昌都县", "id": "00260201"}, {"name": "江达县", "id": "00260202"}, {
            "name": "贡觉县",
            "id": "00260203"
        }, {"name": "类乌齐县", "id": "00260204"}, {"name": "丁青县", "id": "00260205"}, {
            "name": "察雅县",
            "id": "00260206"
        }, {"name": "八宿县", "id": "00260207"}, {"name": "左贡县", "id": "00260208"}, {
            "name": "芒康县",
            "id": "00260209"
        }, {"name": "洛隆县", "id": "00260210"}, {"name": "边坝县", "id": "00260211"}]
    }, {
        "name": "山南地区",
        "id": "002603",
        "childs": [{"name": "乃东县", "id": "00260301"}, {"name": "扎囊县", "id": "00260302"}, {
            "name": "贡嘎县",
            "id": "00260303"
        }, {"name": "桑日县", "id": "00260304"}, {"name": "琼结县", "id": "00260305"}, {
            "name": "曲松县",
            "id": "00260306"
        }, {"name": "措美县", "id": "00260307"}, {"name": "洛扎县", "id": "00260308"}, {
            "name": "加查县",
            "id": "00260309"
        }, {"name": "隆子县", "id": "00260310"}, {"name": "错那县", "id": "00260311"}, {"name": "浪卡子县", "id": "00260312"}]
    }, {
        "name": "日喀则市",
        "id": "002604",
        "childs": [{"name": "桑珠孜区", "id": "00260401"}, {"name": "南木林县", "id": "00260402"}, {
            "name": "江孜县",
            "id": "00260403"
        }, {"name": "定日县", "id": "00260404"}, {"name": "萨迦县", "id": "00260405"}, {
            "name": "拉孜县",
            "id": "00260406"
        }, {"name": "昂仁县", "id": "00260407"}, {"name": "谢通门县", "id": "00260408"}, {
            "name": "白朗县",
            "id": "00260409"
        }, {"name": "仁布县", "id": "00260410"}, {"name": "康马县", "id": "00260411"}, {
            "name": "定结县",
            "id": "00260412"
        }, {"name": "仲巴县", "id": "00260413"}, {"name": "亚东县", "id": "00260414"}, {
            "name": "吉隆县",
            "id": "00260415"
        }, {"name": "聂拉木县", "id": "00260416"}, {"name": "萨嘎县", "id": "00260417"}, {"name": "岗巴县", "id": "00260418"}]
    }, {
        "name": "那曲地区",
        "id": "002605",
        "childs": [{"name": "那曲县", "id": "00260501"}, {"name": "嘉黎县", "id": "00260502"}, {
            "name": "比如县",
            "id": "00260503"
        }, {"name": "聂荣县", "id": "00260504"}, {"name": "安多县", "id": "00260505"}, {
            "name": "申扎县",
            "id": "00260506"
        }, {"name": "索县", "id": "00260507"}, {"name": "班戈县", "id": "00260508"}, {
            "name": "巴青县",
            "id": "00260509"
        }, {"name": "尼玛县", "id": "00260510"}, {"name": "双湖县", "id": "00260511"}]
    }, {
        "name": "阿里地区",
        "id": "002606",
        "childs": [{"name": "普兰县", "id": "00260601"}, {"name": "札达县", "id": "00260602"}, {
            "name": "噶尔县",
            "id": "00260603"
        }, {"name": "日土县", "id": "00260604"}, {"name": "革吉县", "id": "00260605"}, {
            "name": "改则县",
            "id": "00260606"
        }, {"name": "措勤县", "id": "00260607"}]
    }, {
        "name": "林芝地区",
        "id": "002607",
        "childs": [{"name": "林芝县", "id": "00260701"}, {"name": "工布江达县", "id": "00260702"}, {
            "name": "米林县",
            "id": "00260703"
        }, {"name": "墨脱县", "id": "00260704"}, {"name": "波密县", "id": "00260705"}, {
            "name": "察隅县",
            "id": "00260706"
        }, {"name": "朗县", "id": "00260707"}]
    }]
}, {
    "name": "陕西省",
    "id": "0027",
    "childs": [{
        "name": "西安市",
        "id": "002701",
        "childs": [{"name": "新城区", "id": "00270101"}, {"name": "碑林区", "id": "00270102"}, {
            "name": "莲湖区",
            "id": "00270103"
        }, {"name": "灞桥区", "id": "00270104"}, {"name": "未央区", "id": "00270105"}, {
            "name": "雁塔区",
            "id": "00270106"
        }, {"name": "阎良区", "id": "00270107"}, {"name": "临潼区", "id": "00270108"}, {
            "name": "长安区",
            "id": "00270109"
        }, {"name": "蓝田县", "id": "00270110"}, {"name": "周至县", "id": "00270111"}, {
            "name": "户县",
            "id": "00270112"
        }, {"name": "高陵县", "id": "00270113"}]
    }, {
        "name": "铜川市",
        "id": "002702",
        "childs": [{"name": "王益区", "id": "00270201"}, {"name": "印台区", "id": "00270202"}, {
            "name": "耀州区",
            "id": "00270203"
        }, {"name": "宜君县", "id": "00270204"}]
    }, {
        "name": "宝鸡市",
        "id": "002703",
        "childs": [{"name": "渭滨区", "id": "00270301"}, {"name": "金台区", "id": "00270302"}, {
            "name": "陈仓区",
            "id": "00270303"
        }, {"name": "凤翔县", "id": "00270304"}, {"name": "岐山县", "id": "00270305"}, {
            "name": "扶风县",
            "id": "00270306"
        }, {"name": "眉县", "id": "00270307"}, {"name": "陇县", "id": "00270308"}, {
            "name": "千阳县",
            "id": "00270309"
        }, {"name": "麟游县", "id": "00270310"}, {"name": "凤县", "id": "00270311"}, {"name": "太白县", "id": "00270312"}]
    }, {
        "name": "咸阳市",
        "id": "002704",
        "childs": [{"name": "秦都区", "id": "00270401"}, {"name": "杨陵区", "id": "00270402"}, {
            "name": "渭城区",
            "id": "00270403"
        }, {"name": "三原县", "id": "00270404"}, {"name": "泾阳县", "id": "00270405"}, {
            "name": "乾县",
            "id": "00270406"
        }, {"name": "礼泉县", "id": "00270407"}, {"name": "永寿县", "id": "00270408"}, {
            "name": "彬县",
            "id": "00270409"
        }, {"name": "长武县", "id": "00270410"}, {"name": "旬邑县", "id": "00270411"}, {
            "name": "淳化县",
            "id": "00270412"
        }, {"name": "武功县", "id": "00270413"}, {"name": "兴平市", "id": "00270414"}]
    }, {
        "name": "渭南市",
        "id": "002705",
        "childs": [{"name": "临渭区", "id": "00270501"}, {"name": "华县", "id": "00270502"}, {
            "name": "潼关县",
            "id": "00270503"
        }, {"name": "大荔县", "id": "00270504"}, {"name": "合阳县", "id": "00270505"}, {
            "name": "澄城县",
            "id": "00270506"
        }, {"name": "蒲城县", "id": "00270507"}, {"name": "白水县", "id": "00270508"}, {
            "name": "富平县",
            "id": "00270509"
        }, {"name": "韩城市", "id": "00270510"}, {"name": "华阴市", "id": "00270511"}]
    }, {
        "name": "延安市",
        "id": "002706",
        "childs": [{"name": "宝塔区", "id": "00270601"}, {"name": "延长县", "id": "00270602"}, {
            "name": "延川县",
            "id": "00270603"
        }, {"name": "子长县", "id": "00270604"}, {"name": "安塞县", "id": "00270605"}, {
            "name": "志丹县",
            "id": "00270606"
        }, {"name": "吴起县", "id": "00270607"}, {"name": "甘泉县", "id": "00270608"}, {
            "name": "富县",
            "id": "00270609"
        }, {"name": "洛川县", "id": "00270610"}, {"name": "宜川县", "id": "00270611"}, {
            "name": "黄龙县",
            "id": "00270612"
        }, {"name": "黄陵县", "id": "00270613"}]
    }, {
        "name": "汉中市",
        "id": "002707",
        "childs": [{"name": "汉台区", "id": "00270701"}, {"name": "南郑县", "id": "00270702"}, {
            "name": "城固县",
            "id": "00270703"
        }, {"name": "洋县", "id": "00270704"}, {"name": "西乡县", "id": "00270705"}, {
            "name": "勉县",
            "id": "00270706"
        }, {"name": "宁强县", "id": "00270707"}, {"name": "略阳县", "id": "00270708"}, {
            "name": "镇巴县",
            "id": "00270709"
        }, {"name": "留坝县", "id": "00270710"}, {"name": "佛坪县", "id": "00270711"}]
    }, {
        "name": "榆林市",
        "id": "002708",
        "childs": [{"name": "榆阳区", "id": "00270801"}, {"name": "神木县", "id": "00270802"}, {
            "name": "府谷县",
            "id": "00270803"
        }, {"name": "横山县", "id": "00270804"}, {"name": "靖边县", "id": "00270805"}, {
            "name": "定边县",
            "id": "00270806"
        }, {"name": "绥德县", "id": "00270807"}, {"name": "米脂县", "id": "00270808"}, {
            "name": "佳县",
            "id": "00270809"
        }, {"name": "吴堡县", "id": "00270810"}, {"name": "清涧县", "id": "00270811"}, {"name": "子洲县", "id": "00270812"}]
    }, {
        "name": "安康市",
        "id": "002709",
        "childs": [{"name": "汉滨区", "id": "00270901"}, {"name": "汉阴县", "id": "00270902"}, {
            "name": "石泉县",
            "id": "00270903"
        }, {"name": "宁陕县", "id": "00270904"}, {"name": "紫阳县", "id": "00270905"}, {
            "name": "岚皋县",
            "id": "00270906"
        }, {"name": "平利县", "id": "00270907"}, {"name": "镇坪县", "id": "00270908"}, {
            "name": "旬阳县",
            "id": "00270909"
        }, {"name": "白河县", "id": "00270910"}]
    }, {
        "name": "商洛市",
        "id": "002710",
        "childs": [{"name": "商州区", "id": "00271001"}, {"name": "洛南县", "id": "00271002"}, {
            "name": "丹凤县",
            "id": "00271003"
        }, {"name": "商南县", "id": "00271004"}, {"name": "山阳县", "id": "00271005"}, {
            "name": "镇安县",
            "id": "00271006"
        }, {"name": "柞水县", "id": "00271007"}]
    }]
}, {
    "name": "甘肃省",
    "id": "0028",
    "childs": [{
        "name": "兰州市",
        "id": "002801",
        "childs": [{"name": "城关区", "id": "00280101"}, {"name": "七里河区", "id": "00280102"}, {
            "name": "西固区",
            "id": "00280103"
        }, {"name": "安宁区", "id": "00280104"}, {"name": "红古区", "id": "00280105"}, {
            "name": "永登县",
            "id": "00280106"
        }, {"name": "皋兰县", "id": "00280107"}, {"name": "榆中县", "id": "00280108"}]
    }, {
        "name": "嘉峪关市",
        "id": "002802",
        "childs": [{"name": "雄关区", "id": "00280201"}, {"name": "长城区", "id": "00280202"}, {
            "name": "镜铁区",
            "id": "00280203"
        }]
    }, {
        "name": "金昌市",
        "id": "002803",
        "childs": [{"name": "金川区", "id": "00280301"}, {"name": "永昌县", "id": "00280302"}]
    }, {
        "name": "白银市",
        "id": "002804",
        "childs": [{"name": "白银区", "id": "00280401"}, {"name": "平川区", "id": "00280402"}, {
            "name": "靖远县",
            "id": "00280403"
        }, {"name": "会宁县", "id": "00280404"}, {"name": "景泰县", "id": "00280405"}]
    }, {
        "name": "天水市",
        "id": "002805",
        "childs": [{"name": "秦州区", "id": "00280501"}, {"name": "麦积区", "id": "00280502"}, {
            "name": "清水县",
            "id": "00280503"
        }, {"name": "秦安县", "id": "00280504"}, {"name": "甘谷县", "id": "00280505"}, {
            "name": "武山县",
            "id": "00280506"
        }, {"name": "张家川回族自治县", "id": "00280507"}]
    }, {
        "name": "武威市",
        "id": "002806",
        "childs": [{"name": "凉州区", "id": "00280601"}, {"name": "民勤县", "id": "00280602"}, {
            "name": "古浪县",
            "id": "00280603"
        }, {"name": "天祝藏族自治县", "id": "00280604"}]
    }, {
        "name": "酒泉市",
        "id": "002807",
        "childs": [{"name": "肃州区", "id": "00280701"}, {"name": "金塔县", "id": "00280702"}, {
            "name": "瓜州县",
            "id": "00280703"
        }, {"name": "肃北蒙古族自治县", "id": "00280704"}, {"name": "阿克塞哈萨克族自治县", "id": "00280705"}, {
            "name": "玉门市",
            "id": "00280706"
        }, {"name": "敦煌市", "id": "00280707"}]
    }, {
        "name": "张掖市",
        "id": "002808",
        "childs": [{"name": "甘州区", "id": "00280801"}, {"name": "肃南裕固族自治县", "id": "00280802"}, {
            "name": "民乐县",
            "id": "00280803"
        }, {"name": "临泽县", "id": "00280804"}, {"name": "高台县", "id": "00280805"}, {"name": "山丹县", "id": "00280806"}]
    }, {
        "name": "定西市",
        "id": "002809",
        "childs": [{"name": "安定区", "id": "00280901"}, {"name": "通渭县", "id": "00280902"}, {
            "name": "陇西县",
            "id": "00280903"
        }, {"name": "渭源县", "id": "00280904"}, {"name": "临洮县", "id": "00280905"}, {
            "name": "漳县",
            "id": "00280906"
        }, {"name": "岷县", "id": "00280907"}]
    }, {
        "name": "陇南市",
        "id": "002810",
        "childs": [{"name": "武都区", "id": "00281001"}, {"name": "成县", "id": "00281002"}, {
            "name": "文县",
            "id": "00281003"
        }, {"name": "宕昌县", "id": "00281004"}, {"name": "康县", "id": "00281005"}, {
            "name": "西和县",
            "id": "00281006"
        }, {"name": "礼县", "id": "00281007"}, {"name": "徽县", "id": "00281008"}, {"name": "两当县", "id": "00281009"}]
    }, {
        "name": "平凉市",
        "id": "002811",
        "childs": [{"name": "崆峒区", "id": "00281101"}, {"name": "泾川县", "id": "00281102"}, {
            "name": "灵台县",
            "id": "00281103"
        }, {"name": "崇信县", "id": "00281104"}, {"name": "华亭县", "id": "00281105"}, {
            "name": "庄浪县",
            "id": "00281106"
        }, {"name": "静宁县", "id": "00281107"}]
    }, {
        "name": "庆阳市",
        "id": "002812",
        "childs": [{"name": "西峰区", "id": "00281201"}, {"name": "庆城县", "id": "00281202"}, {
            "name": "环县",
            "id": "00281203"
        }, {"name": "华池县", "id": "00281204"}, {"name": "合水县", "id": "00281205"}, {
            "name": "正宁县",
            "id": "00281206"
        }, {"name": "宁县", "id": "00281207"}, {"name": "镇原县", "id": "00281208"}]
    }, {
        "name": "临夏回族自治州",
        "id": "002813",
        "childs": [{"name": "临夏市", "id": "00281301"}, {"name": "临夏县", "id": "00281302"}, {
            "name": "康乐县",
            "id": "00281303"
        }, {"name": "永靖县", "id": "00281304"}, {"name": "广河县", "id": "00281305"}, {
            "name": "和政县",
            "id": "00281306"
        }, {"name": "东乡族自治县", "id": "00281307"}, {"name": "积石山保安族东乡族撒拉族自治县", "id": "00281308"}]
    }, {
        "name": "甘南藏族自治州",
        "id": "002814",
        "childs": [{"name": "合作市", "id": "00281401"}, {"name": "临潭县", "id": "00281402"}, {
            "name": "卓尼县",
            "id": "00281403"
        }, {"name": "舟曲县", "id": "00281404"}, {"name": "迭部县", "id": "00281405"}, {
            "name": "玛曲县",
            "id": "00281406"
        }, {"name": "碌曲县", "id": "00281407"}, {"name": "夏河县", "id": "00281408"}]
    }]
}, {
    "name": "青海省",
    "id": "0029",
    "childs": [{
        "name": "西宁市",
        "id": "002901",
        "childs": [{"name": "城东区", "id": "00290101"}, {"name": "城中区", "id": "00290102"}, {
            "name": "城西区",
            "id": "00290103"
        }, {"name": "城北区", "id": "00290104"}, {"name": "大通回族土族自治县", "id": "00290105"}, {
            "name": "湟中县",
            "id": "00290106"
        }, {"name": "湟源县", "id": "00290107"}]
    }, {
        "name": "海东市",
        "id": "002902",
        "childs": [{"name": "乐都区", "id": "00290201"}, {"name": "平安县", "id": "00290202"}, {
            "name": "民和回族土族自治县",
            "id": "00290203"
        }, {"name": "互助土族自治县", "id": "00290204"}, {"name": "化隆回族自治县", "id": "00290205"}, {
            "name": "循化撒拉族自治县",
            "id": "00290206"
        }]
    }, {
        "name": "海北藏族自治州",
        "id": "002903",
        "childs": [{"name": "门源回族自治县", "id": "00290301"}, {"name": "祁连县", "id": "00290302"}, {
            "name": "海晏县",
            "id": "00290303"
        }, {"name": "刚察县", "id": "00290304"}]
    }, {
        "name": "黄南藏族自治州",
        "id": "002904",
        "childs": [{"name": "同仁县", "id": "00290401"}, {"name": "尖扎县", "id": "00290402"}, {
            "name": "泽库县",
            "id": "00290403"
        }, {"name": "河南蒙古族自治县", "id": "00290404"}]
    }, {
        "name": "海南藏族自治州",
        "id": "002905",
        "childs": [{"name": "共和县", "id": "00290501"}, {"name": "同德县", "id": "00290502"}, {
            "name": "贵德县",
            "id": "00290503"
        }, {"name": "兴海县", "id": "00290504"}, {"name": "贵南县", "id": "00290505"}]
    }, {
        "name": "果洛藏族自治州",
        "id": "002906",
        "childs": [{"name": "玛沁县", "id": "00290601"}, {"name": "班玛县", "id": "00290602"}, {
            "name": "甘德县",
            "id": "00290603"
        }, {"name": "达日县", "id": "00290604"}, {"name": "久治县", "id": "00290605"}, {"name": "玛多县", "id": "00290606"}]
    }, {
        "name": "玉树藏族自治州",
        "id": "002907",
        "childs": [{"name": "玉树市", "id": "00290701"}, {"name": "杂多县", "id": "00290702"}, {
            "name": "称多县",
            "id": "00290703"
        }, {"name": "治多县", "id": "00290704"}, {"name": "囊谦县", "id": "00290705"}, {"name": "曲麻莱县", "id": "00290706"}]
    }, {
        "name": "海西蒙古族藏族自治州",
        "id": "002908",
        "childs": [{"name": "格尔木市", "id": "00290801"}, {"name": "德令哈市", "id": "00290802"}, {
            "name": "乌兰县",
            "id": "00290803"
        }, {"name": "都兰县", "id": "00290804"}, {"name": "天峻县", "id": "00290805"}]
    }]
}, {
    "name": "宁夏回族自治区",
    "id": "0030",
    "childs": [{
        "name": "银川市",
        "id": "003001",
        "childs": [{"name": "兴庆区", "id": "00300101"}, {"name": "西夏区", "id": "00300102"}, {
            "name": "金凤区",
            "id": "00300103"
        }, {"name": "永宁县", "id": "00300104"}, {"name": "贺兰县", "id": "00300105"}, {"name": "灵武市", "id": "00300106"}]
    }, {
        "name": "石嘴山市",
        "id": "003002",
        "childs": [{"name": "大武口区", "id": "00300201"}, {"name": "惠农区", "id": "00300202"}, {
            "name": "平罗县",
            "id": "00300203"
        }]
    }, {
        "name": "吴忠市",
        "id": "003003",
        "childs": [{"name": "利通区", "id": "00300301"}, {"name": "红寺堡区", "id": "00300302"}, {
            "name": "盐池县",
            "id": "00300303"
        }, {"name": "同心县", "id": "00300304"}, {"name": "青铜峡市", "id": "00300305"}]
    }, {
        "name": "固原市",
        "id": "003004",
        "childs": [{"name": "原州区", "id": "00300401"}, {"name": "西吉县", "id": "00300402"}, {
            "name": "隆德县",
            "id": "00300403"
        }, {"name": "泾源县", "id": "00300404"}, {"name": "彭阳县", "id": "00300405"}]
    }, {
        "name": "中卫",
        "id": "003007",
        "childs": [{"name": "沙坡头区", "id": "00300701"}, {"name": "中宁县", "id": "00300702"}, {
            "name": "海原县",
            "id": "00300703"
        }]
    }]
}, {
    "name": "新疆维吾尔自治区",
    "id": "0031",
    "childs": [{
        "name": "乌鲁木齐市",
        "id": "003101",
        "childs": [{"name": "天山区", "id": "00310101"}, {"name": "沙依巴克区", "id": "00310102"}, {
            "name": "新市区",
            "id": "00310103"
        }, {"name": "水磨沟区", "id": "00310104"}, {"name": "头屯河区", "id": "00310105"}, {
            "name": "达坂城区",
            "id": "00310106"
        }, {"name": "米东区", "id": "00310107"}, {"name": "乌鲁木齐县", "id": "00310108"}]
    }, {
        "name": "克拉玛依市",
        "id": "003102",
        "childs": [{"name": "独山子区", "id": "00310201"}, {"name": "克拉玛依区", "id": "00310202"}, {
            "name": "白碱滩区",
            "id": "00310203"
        }, {"name": "乌尔禾区", "id": "00310204"}]
    }, {
        "name": "吐鲁番地区",
        "id": "003103",
        "childs": [{"name": "吐鲁番市", "id": "00310301"}, {"name": "鄯善县", "id": "00310302"}, {
            "name": "托克逊县",
            "id": "00310303"
        }]
    }, {
        "name": "哈密地区",
        "id": "003104",
        "childs": [{"name": "哈密市", "id": "00310401"}, {"name": "巴里坤哈萨克自治县", "id": "00310402"}, {
            "name": "伊吾县",
            "id": "00310403"
        }]
    }, {
        "name": "昌吉回族自治州",
        "id": "003105",
        "childs": [{"name": "昌吉市", "id": "00310501"}, {"name": "阜康市", "id": "00310502"}, {
            "name": "呼图壁县",
            "id": "00310503"
        }, {"name": "玛纳斯县", "id": "00310504"}, {"name": "奇台县", "id": "00310505"}, {
            "name": "吉木萨尔县",
            "id": "00310506"
        }, {"name": "木垒哈萨克自治县", "id": "00310507"}]
    }, {
        "name": "博尔塔拉蒙古自治州",
        "id": "003106",
        "childs": [{"name": "博乐市", "id": "00310601"}, {"name": "阿拉山口市", "id": "00310602"}, {
            "name": "精河县",
            "id": "00310603"
        }, {"name": "温泉县", "id": "00310604"}]
    }, {
        "name": "巴音郭楞蒙古自治州",
        "id": "003107",
        "childs": [{"name": "库尔勒市", "id": "00310701"}, {"name": "轮台县", "id": "00310702"}, {
            "name": "尉犁县",
            "id": "00310703"
        }, {"name": "若羌县", "id": "00310704"}, {"name": "且末县", "id": "00310705"}, {
            "name": "焉耆回族自治县",
            "id": "00310706"
        }, {"name": "和静县", "id": "00310707"}, {"name": "和硕县", "id": "00310708"}, {"name": "博湖县", "id": "00310709"}]
    }, {
        "name": "阿克苏地区",
        "id": "003108",
        "childs": [{"name": "阿克苏市", "id": "00310801"}, {"name": "温宿县", "id": "00310802"}, {
            "name": "库车县",
            "id": "00310803"
        }, {"name": "沙雅县", "id": "00310804"}, {"name": "新和县", "id": "00310805"}, {
            "name": "拜城县",
            "id": "00310806"
        }, {"name": "乌什县", "id": "00310807"}, {"name": "阿瓦提县", "id": "00310808"}, {"name": "柯坪县", "id": "00310809"}]
    }, {
        "name": "克孜勒苏柯尔克孜自治州",
        "id": "003109",
        "childs": [{"name": "阿图什市", "id": "00310901"}, {"name": "阿克陶县", "id": "00310902"}, {
            "name": "阿合奇县",
            "id": "00310903"
        }, {"name": "乌恰县", "id": "00310904"}]
    }, {
        "name": "喀什地区",
        "id": "003110",
        "childs": [{"name": "喀什市", "id": "00311001"}, {"name": "疏附县", "id": "00311002"}, {
            "name": "疏勒县",
            "id": "00311003"
        }, {"name": "英吉沙县", "id": "00311004"}, {"name": "泽普县", "id": "00311005"}, {
            "name": "莎车县",
            "id": "00311006"
        }, {"name": "叶城县", "id": "00311007"}, {"name": "麦盖提县", "id": "00311008"}, {
            "name": "岳普湖县",
            "id": "00311009"
        }, {"name": "伽师县", "id": "00311010"}, {"name": "巴楚县", "id": "00311011"}, {
            "name": "塔什库尔干塔吉克自治县",
            "id": "00311012"
        }]
    }, {
        "name": "和田地区",
        "id": "003111",
        "childs": [{"name": "和田市", "id": "00311101"}, {"name": "和田县", "id": "00311102"}, {
            "name": "墨玉县",
            "id": "00311103"
        }, {"name": "皮山县", "id": "00311104"}, {"name": "洛浦县", "id": "00311105"}, {
            "name": "策勒县",
            "id": "00311106"
        }, {"name": "于田县", "id": "00311107"}, {"name": "民丰县", "id": "00311108"}]
    }, {
        "name": "伊犁哈萨克自治州",
        "id": "003112",
        "childs": [{"name": "伊宁市", "id": "00311201"}, {"name": "奎屯市", "id": "00311202"}, {
            "name": "伊宁县",
            "id": "00311203"
        }, {"name": "察布查尔锡伯自治县", "id": "00311204"}, {"name": "霍城县", "id": "00311205"}, {
            "name": "巩留县",
            "id": "00311206"
        }, {"name": "新源县", "id": "00311207"}, {"name": "昭苏县", "id": "00311208"}, {
            "name": "特克斯县",
            "id": "00311209"
        }, {"name": "尼勒克县", "id": "00311210"}]
    }, {
        "name": "塔城地区",
        "id": "003113",
        "childs": [{"name": "塔城市", "id": "00311301"}, {"name": "乌苏市", "id": "00311302"}, {
            "name": "额敏县",
            "id": "00311303"
        }, {"name": "沙湾县", "id": "00311304"}, {"name": "托里县", "id": "00311305"}, {
            "name": "裕民县",
            "id": "00311306"
        }, {"name": "和布克赛尔蒙古自治县", "id": "00311307"}]
    }, {
        "name": "阿勒泰地区",
        "id": "003114",
        "childs": [{"name": "阿勒泰市", "id": "00311401"}, {"name": "布尔津县", "id": "00311402"}, {
            "name": "富蕴县",
            "id": "00311403"
        }, {"name": "福海县", "id": "00311404"}, {"name": "哈巴河县", "id": "00311405"}, {
            "name": "青河县",
            "id": "00311406"
        }, {"name": "吉木乃县", "id": "00311407"}]
    }, {"name": "石河子", "id": "003116", "childs": [{"name": "石河子地区", "id": "00311601"}]}, {
        "name": "图木舒克市",
        "id": "003119",
        "childs": [{"name": "图木舒克市地区", "id": "00311901"}]
    }, {"name": "五家渠市", "id": "003120", "childs": [{"name": "五家渠市地区", "id": "00312001"}]}, {
        "name": "阿拉尔市",
        "id": "003123",
        "childs": [{"name": "阿拉尔市地区", "id": "00312301"}]
    }]
}, {
    "name": "台湾省",
    "id": "0032",
    "childs": [{
        "name": "台北市",
        "id": "003201",
        "childs": [{"name": "内湖区", "id": "00320101"}, {"name": "南港区", "id": "00320102"}, {
            "name": "中正区",
            "id": "00320103"
        }, {"name": "万华区", "id": "00320104"}, {"name": "大同区", "id": "00320105"}, {
            "name": "中山区",
            "id": "00320106"
        }, {"name": "松山区", "id": "00320107"}, {"name": "大安区", "id": "00320108"}, {
            "name": "信义区",
            "id": "00320109"
        }, {"name": "文山区", "id": "00320110"}, {"name": "士林区", "id": "00320111"}, {"name": "北投区", "id": "00320112"}]
    }, {
        "name": "高雄市",
        "id": "003202",
        "childs": [{"name": "旧高雄市区", "id": "00320201"}, {"name": "凤山地区", "id": "00320202"}, {
            "name": "冈山地区",
            "id": "00320203"
        }, {"name": "旗山地区", "id": "00320204"}]
    }, {
        "name": "基隆市",
        "id": "003203",
        "childs": [{"name": "仁爱区", "id": "00320301"}, {"name": "中正区", "id": "00320302"}, {
            "name": "信义区",
            "id": "00320303"
        }, {"name": "中山区", "id": "00320304"}, {"name": "安乐区", "id": "00320305"}, {
            "name": "七堵区",
            "id": "00320306"
        }, {"name": "暖暖区", "id": "00320307"}]
    }, {
        "name": "台中市",
        "id": "003204",
        "childs": [{"name": "中区", "id": "00320401"}, {"name": "东区", "id": "00320402"}, {
            "name": "南区",
            "id": "00320403"
        }, {"name": "西区", "id": "00320404"}, {"name": "北区", "id": "00320405"}, {
            "name": "北屯区",
            "id": "00320406"
        }, {"name": "西屯区", "id": "00320407"}, {"name": "南屯区", "id": "00320408"}, {
            "name": "太平区",
            "id": "00320409"
        }, {"name": "大里区", "id": "00320410"}, {"name": "雾峰区", "id": "00320411"}, {
            "name": "乌日区",
            "id": "00320412"
        }, {"name": "丰原区", "id": "00320413"}, {"name": "后里区", "id": "00320414"}, {
            "name": "潭子区",
            "id": "00320415"
        }, {"name": "大雅区", "id": "00320416"}, {"name": "神冈区", "id": "00320417"}, {
            "name": "石冈区",
            "id": "00320418"
        }, {"name": "东势区", "id": "00320419"}, {"name": "新社区", "id": "00320420"}, {
            "name": "和平区",
            "id": "00320421"
        }, {"name": "大肚区", "id": "00320422"}, {"name": "龙井区", "id": "00320423"}, {
            "name": "梧栖区",
            "id": "00320424"
        }, {"name": "清水区", "id": "00320425"}, {"name": "大甲区", "id": "00320426"}, {
            "name": "外埔区",
            "id": "00320427"
        }, {"name": "大安区", "id": "00320428"}, {"name": "沙鹿区", "id": "00320429"}]
    }, {
        "name": "台南市",
        "id": "003205",
        "childs": [{"name": "中西区", "id": "00320501"}, {"name": "东区", "id": "00320502"}, {
            "name": "南区",
            "id": "00320503"
        }, {"name": "北区", "id": "00320504"}, {"name": "安平区", "id": "00320505"}, {
            "name": "安南区",
            "id": "00320506"
        }, {"name": "永康区", "id": "00320507"}]
    }, {
        "name": "新竹市",
        "id": "003206",
        "childs": [{"name": "东区", "id": "00320601"}, {"name": "北区", "id": "00320602"}, {
            "name": "香山区",
            "id": "00320603"
        }]
    }, {
        "name": "嘉义市",
        "id": "003207",
        "childs": [{"name": "东区", "id": "00320701"}, {"name": "西区", "id": "00320702"}]
    }, {"name": "其他市", "id": "003208", "childs": [{"name": "其他地区", "id": "00320801"}]}]
}, {
    "name": "香港",
    "id": "0033",
    "childs": [{
        "name": "香港市",
        "id": "003301",
        "childs": [{"name": "中西区", "id": "00330101"}, {"name": "湾仔区", "id": "00330102"}, {
            "name": "东区",
            "id": "00330103"
        }, {"name": "南区", "id": "00330104"}]
    }, {
        "name": "九龙",
        "id": "003302",
        "childs": [{"name": "油尖旺区", "id": "00330201"}, {"name": "深水埗区", "id": "00330202"}, {
            "name": "九龙城区",
            "id": "00330203"
        }, {"name": "黄大仙区", "id": "00330204"}, {"name": "观塘区", "id": "00330205"}]
    }, {
        "name": "新界",
        "id": "003303",
        "childs": [{"name": "北区", "id": "00330301"}, {"name": "大埔区", "id": "00330302"}, {
            "name": "沙田区",
            "id": "00330303"
        }, {"name": "西贡区", "id": "00330304"}, {"name": "荃湾区", "id": "00330305"}, {
            "name": "屯门区",
            "id": "00330306"
        }, {"name": "元朗区", "id": "00330307"}, {"name": "葵青区", "id": "00330308"}, {"name": "离岛区", "id": "00330309"}]
    }]
}, {
    "name": "澳门",
    "id": "0034",
    "childs": [{
        "name": "澳门市",
        "id": "003401",
        "childs": [{"name": "花地玛堂区", "id": "00340101"}, {"name": "圣安多尼堂区", "id": "00340102"}, {
            "name": "大堂区",
            "id": "00340103"
        }, {"name": "望德堂区", "id": "00340104"}, {"name": "风顺堂区", "id": "00340105"}, {
            "name": "嘉模堂区",
            "id": "00340106"
        }, {"name": "圣方济各堂区", "id": "00340107"}]
    }]
}]