var areaList = [{
    "name": "北京市",
    "id": "145",
    "childs": [{"name": "东城区", "id": "146"}, {"name": "西城区", "id": "147"}, {"name": "崇文区", "id": "148"}, {
        "name": "宣武区",
        "id": "149"
    }, {"name": "朝阳区", "id": "150"}, {"name": "丰台区", "id": "151"}, {"name": "石景山区", "id": "152"}, {
        "name": "海淀区",
        "id": "153"
    }, {"name": "门头沟区", "id": "154"}, {"name": "房山区", "id": "155"}, {"name": "通州区", "id": "156"}, {
        "name": "顺义区",
        "id": "157"
    }, {"name": "昌平区", "id": "158"}, {"name": "大兴区", "id": "159"}, {"name": "怀柔区", "id": "160"}, {
        "name": "平谷区",
        "id": "161"
    }, {"name": "密云县", "id": "162"}, {"name": "延庆县", "id": "163"}]
}, {
    "name": "天津市",
    "id": "164",
    "childs": [{"name": "和平区", "id": "165"}, {"name": "河东区", "id": "166"}, {"name": "河西区", "id": "167"}, {
        "name": "南开区",
        "id": "168"
    }, {"name": "河北区", "id": "169"}, {"name": "红桥区", "id": "170"}, {"name": "东丽区", "id": "171"}, {
        "name": "西青区",
        "id": "172"
    }, {"name": "津南区", "id": "173"}, {"name": "北辰区", "id": "174"}, {"name": "武清区", "id": "175"}, {
        "name": "宝坻区",
        "id": "176"
    }, {"name": "滨海新区", "id": "177"}, {"name": "宁河县", "id": "178"}, {"name": "静海县", "id": "179"}, {
        "name": "蓟县",
        "id": "180"
    }]
}, {
    "name": "河北省",
    "id": "181",
    "childs": [{"name": "石家庄市", "id": "182"}, {"name": "唐山市", "id": "206"}, {
        "name": "秦皇岛市",
        "id": "221"
    }, {"name": "邯郸市", "id": "229"}, {"name": "邢台市", "id": "249"}, {"name": "保定市", "id": "269"}, {
        "name": "张家口市",
        "id": "295"
    }, {"name": "承德市", "id": "313"}, {"name": "沧州市", "id": "325"}, {"name": "廊坊市", "id": "342"}, {
        "name": "衡水市",
        "id": "353"
    }]
}, {
    "name": "山西省",
    "id": "365",
    "childs": [{"name": "太原市", "id": "366"}, {"name": "大同市", "id": "377"}, {"name": "阳泉市", "id": "389"}, {
        "name": "长治市",
        "id": "395"
    }, {"name": "晋城市", "id": "409"}, {"name": "朔州市", "id": "416"}, {"name": "晋中市", "id": "423"}, {
        "name": "运城市",
        "id": "435"
    }, {"name": "忻州市", "id": "449"}, {"name": "临汾市", "id": "464"}, {"name": "吕梁市", "id": "482"}]
}, {
    "name": "内蒙古自治区",
    "id": "496",
    "childs": [{"name": "呼和浩特市", "id": "497"}, {"name": "包头市", "id": "507"}, {
        "name": "乌海市",
        "id": "517"
    }, {"name": "赤峰市", "id": "521"}, {"name": "通辽市", "id": "534"}, {"name": "鄂尔多斯市", "id": "543"}, {
        "name": "呼伦贝尔市",
        "id": "552"
    }, {"name": "巴彦淖尔市", "id": "566"}, {"name": "乌兰察布市", "id": "574"}, {"name": "兴安盟", "id": "586"}, {
        "name": "锡林郭勒盟",
        "id": "593"
    }, {"name": "阿拉善盟", "id": "606"}]
}, {
    "name": "辽宁省",
    "id": "610",
    "childs": [{"name": "沈阳市", "id": "611"}, {"name": "大连市", "id": "625"}, {"name": "鞍山市", "id": "636"}, {
        "name": "抚顺市",
        "id": "644"
    }, {"name": "本溪市", "id": "652"}, {"name": "丹东市", "id": "659"}, {"name": "锦州市", "id": "666"}, {
        "name": "营口市",
        "id": "674"
    }, {"name": "阜新市", "id": "681"}, {"name": "辽阳市", "id": "689"}, {"name": "盘锦市", "id": "697"}, {
        "name": "铁岭市",
        "id": "702"
    }, {"name": "朝阳市", "id": "710"}, {"name": "葫芦岛市", "id": "718"}]
}, {
    "name": "吉林省",
    "id": "725",
    "childs": [{"name": "长春市", "id": "726"}, {"name": "吉林市", "id": "737"}, {"name": "四平市", "id": "747"}, {
        "name": "辽源市",
        "id": "754"
    }, {"name": "通化市", "id": "759"}, {"name": "白山市", "id": "767"}, {"name": "松原市", "id": "774"}, {
        "name": "白城市",
        "id": "780"
    }, {"name": "延边朝鲜族自治州", "id": "786"}]
}, {
    "name": "黑龙江省",
    "id": "795",
    "childs": [{"name": "哈尔滨市", "id": "796"}, {"name": "齐齐哈尔市", "id": "815"}, {
        "name": "鸡西市",
        "id": "832"
    }, {"name": "鹤岗市", "id": "842"}, {"name": "双鸭山市", "id": "851"}, {"name": "大庆市", "id": "860"}, {
        "name": "伊春市",
        "id": "870"
    }, {"name": "佳木斯市", "id": "888"}, {"name": "七台河市", "id": "899"}, {"name": "牡丹江市", "id": "904"}, {
        "name": "黑河市",
        "id": "915"
    }, {"name": "绥化市", "id": "922"}, {"name": "大兴安岭地区", "id": "933"}]
}, {
    "name": "上海市",
    "id": "937",
    "childs": [{"name": "黄浦区", "id": "938"}, {"name": "卢湾区", "id": "939"}, {"name": "徐汇区", "id": "940"}, {
        "name": "长宁区",
        "id": "941"
    }, {"name": "静安区", "id": "942"}, {"name": "普陀区", "id": "943"}, {"name": "闸北区", "id": "944"}, {
        "name": "虹口区",
        "id": "945"
    }, {"name": "杨浦区", "id": "946"}, {"name": "闵行区", "id": "947"}, {"name": "宝山区", "id": "948"}, {
        "name": "嘉定区",
        "id": "949"
    }, {"name": "浦东新区", "id": "950"}, {"name": "金山区", "id": "951"}, {"name": "松江区", "id": "952"}, {
        "name": "青浦区",
        "id": "953"
    }, {"name": "奉贤区", "id": "954"}, {"name": "崇明县", "id": "955"}]
}, {
    "name": "江苏省",
    "id": "1",
    "childs": [{"name": "南京市", "id": "15"}, {"name": "无锡市", "id": "16"}, {"name": "徐州市", "id": "17"}, {
        "name": "常州市",
        "id": "18"
    }, {"name": "苏州市", "id": "19"}, {"name": "南通市", "id": "20"}, {"name": "连云港市", "id": "21"}, {
        "name": "淮安市",
        "id": "22"
    }, {"name": "盐城市", "id": "23"}, {"name": "扬州市", "id": "24"}, {"name": "镇江市", "id": "25"}, {
        "name": "泰州市",
        "id": "26"
    }, {"name": "宿迁市", "id": "27"}]
}, {
    "name": "浙江省",
    "id": "956",
    "childs": [{"name": "杭州市", "id": "957"}, {"name": "宁波市", "id": "971"}, {"name": "温州市", "id": "983"}, {
        "name": "嘉兴市",
        "id": "995"
    }, {"name": "湖州市", "id": "1003"}, {"name": "绍兴市", "id": "1009"}, {"name": "金华市", "id": "1016"}, {
        "name": "衢州市",
        "id": "1026"
    }, {"name": "舟山市", "id": "1033"}, {"name": "台州市", "id": "1038"}, {"name": "丽水市", "id": "1048"}]
}, {
    "name": "安徽省",
    "id": "1058",
    "childs": [{"name": "合肥市", "id": "1059"}, {"name": "芜湖市", "id": "1067"}, {
        "name": "蚌埠市",
        "id": "1075"
    }, {"name": "淮南市", "id": "1083"}, {"name": "马鞍山市", "id": "1090"}, {"name": "淮北市", "id": "1095"}, {
        "name": "铜陵市",
        "id": "1100"
    }, {"name": "安庆市", "id": "1105"}, {"name": "黄山市", "id": "1117"}, {"name": "滁州市", "id": "1125"}, {
        "name": "阜阳市",
        "id": "1134"
    }, {"name": "宿州市", "id": "1143"}, {"name": "巢湖市", "id": "1149"}, {"name": "六安市", "id": "1155"}, {
        "name": "亳州市",
        "id": "1163"
    }, {"name": "池州市", "id": "1168"}, {"name": "宣城市", "id": "1173"}]
}, {
    "name": "福建省",
    "id": "1181",
    "childs": [{"name": "福州市", "id": "1182"}, {"name": "厦门市", "id": "1196"}, {
        "name": "莆田市",
        "id": "1203"
    }, {"name": "三明市", "id": "1209"}, {"name": "泉州市", "id": "1222"}, {"name": "漳州市", "id": "1235"}, {
        "name": "南平市",
        "id": "1247"
    }, {"name": "龙岩市", "id": "1258"}, {"name": "宁德市", "id": "1266"}]
}, {
    "name": "江西省",
    "id": "1276",
    "childs": [{"name": "南昌市", "id": "1277"}, {"name": "景德镇市", "id": "1287"}, {
        "name": "萍乡市",
        "id": "1292"
    }, {"name": "九江市", "id": "1298"}, {"name": "新余市", "id": "1311"}, {"name": "鹰潭市", "id": "1314"}, {
        "name": "赣州市",
        "id": "1318"
    }, {"name": "吉安市", "id": "1337"}, {"name": "宜春市", "id": "1351"}, {"name": "抚州市", "id": "1362"}, {
        "name": "上饶市",
        "id": "1374"
    }]
}, {
    "name": "山东省",
    "id": "1387",
    "childs": [{"name": "济南市", "id": "1388"}, {"name": "青岛市", "id": "1399"}, {
        "name": "淄博市",
        "id": "1412"
    }, {"name": "枣庄市", "id": "1421"}, {"name": "东营市", "id": "1428"}, {"name": "烟台市", "id": "1434"}, {
        "name": "潍坊市",
        "id": "1447"
    }, {"name": "济宁市", "id": "1460"}, {"name": "泰安市", "id": "1473"}, {"name": "威海市", "id": "1480"}, {
        "name": "日照市",
        "id": "1485"
    }, {"name": "莱芜市", "id": "1490"}, {"name": "临沂市", "id": "1493"}, {"name": "德州市", "id": "1506"}, {
        "name": "聊城市",
        "id": "1518"
    }, {"name": "滨州市", "id": "1527"}, {"name": "菏泽市", "id": "1535"}]
}, {
    "name": "河南省",
    "id": "1545",
    "childs": [{"name": "郑州市", "id": "1546"}, {"name": "开封市", "id": "1559"}, {
        "name": "洛阳市",
        "id": "1570"
    }, {"name": "平顶山市", "id": "1586"}, {"name": "安阳市", "id": "1597"}, {"name": "鹤壁市", "id": "1607"}, {
        "name": "新乡市",
        "id": "1613"
    }, {"name": "焦作市", "id": "1626"}, {"name": "濮阳市", "id": "1637"}, {"name": "许昌市", "id": "1644"}, {
        "name": "漯河市",
        "id": "1651"
    }, {"name": "三门峡市", "id": "1657"}, {"name": "南阳市", "id": "1664"}, {"name": "商丘市", "id": "1678"}, {
        "name": "信阳市",
        "id": "1688"
    }, {"name": "周口市", "id": "1699"}, {"name": "驻马店市", "id": "1710"}]
}, {
    "name": "湖北省",
    "id": "1723",
    "childs": [{"name": "武汉市", "id": "1724"}, {"name": "黄石市", "id": "1738"}, {
        "name": "十堰市",
        "id": "1745"
    }, {"name": "宜昌市", "id": "1754"}, {"name": "襄樊市", "id": "1768"}, {"name": "鄂州市", "id": "1778"}, {
        "name": "荆门市",
        "id": "1782"
    }, {"name": "孝感市", "id": "1788"}, {"name": "荆州市", "id": "1796"}, {"name": "黄冈市", "id": "1805"}, {
        "name": "咸宁市",
        "id": "1816"
    }, {"name": "随州市", "id": "1823"}, {"name": "恩施土家族苗族自治州", "id": "1827"}]
}, {
    "name": "湖南省",
    "id": "1841",
    "childs": [{"name": "长沙市", "id": "1842"}, {"name": "株洲市", "id": "1852"}, {
        "name": "湘潭市",
        "id": "1862"
    }, {"name": "衡阳市", "id": "1868"}, {"name": "邵阳市", "id": "1881"}, {"name": "岳阳市", "id": "1894"}, {
        "name": "常德市",
        "id": "1904"
    }, {"name": "张家界市", "id": "1914"}, {"name": "益阳市", "id": "1919"}, {"name": "郴州市", "id": "1926"}, {
        "name": "永州市",
        "id": "1938"
    }, {"name": "怀化市", "id": "1950"}, {"name": "娄底市", "id": "1963"}, {"name": "湘西土家族苗族自治州", "id": "1969"}]
}, {
    "name": "广东省",
    "id": "1978",
    "childs": [{"name": "广州市", "id": "1979"}, {"name": "韶关市", "id": "1992"}, {
        "name": "深圳市",
        "id": "2003"
    }, {"name": "珠海市", "id": "2010"}, {"name": "汕头市", "id": "2014"}, {"name": "佛山市", "id": "2022"}, {
        "name": "江门市",
        "id": "2028"
    }, {"name": "湛江市", "id": "2036"}, {"name": "茂名市", "id": "2046"}, {"name": "肇庆市", "id": "2053"}, {
        "name": "惠州市",
        "id": "2062"
    }, {"name": "梅州市", "id": "2068"}, {"name": "汕尾市", "id": "2077"}, {"name": "河源市", "id": "2082"}, {
        "name": "阳江市",
        "id": "2089"
    }, {"name": "清远市", "id": "2094"}, {"name": "东莞市", "id": "2103"}, {"name": "中山市", "id": "2104"}, {
        "name": "潮州市",
        "id": "2105"
    }, {"name": "揭阳市", "id": "2109"}, {"name": "云浮市", "id": "2115"}]
}, {
    "name": "广西自治区",
    "id": "2121",
    "childs": [{"name": "南宁市", "id": "2122"}, {"name": "柳州市", "id": "2135"}, {
        "name": "桂林市",
        "id": "2146"
    }, {"name": "梧州市", "id": "2164"}, {"name": "北海市", "id": "2172"}, {"name": "防城港市", "id": "2177"}, {
        "name": "钦州市",
        "id": "2182"
    }, {"name": "贵港市", "id": "2187"}, {"name": "玉林市", "id": "2193"}, {"name": "百色市", "id": "2200"}, {
        "name": "贺州市",
        "id": "2213"
    }, {"name": "河池市", "id": "2218"}, {"name": "来宾市", "id": "2230"}, {"name": "崇左市", "id": "2237"}]
}, {
    "name": "海南省",
    "id": "2245",
    "childs": [{"name": "海口市", "id": "2246"}, {"name": "三亚市", "id": "2251"}]
}, {
    "name": "重庆市",
    "id": "2272",
    "childs": [{"name": "万州区", "id": "2273"}, {"name": "涪陵区", "id": "2274"}, {
        "name": "渝中区",
        "id": "2275"
    }, {"name": "大渡口区", "id": "2276"}, {"name": "江北区", "id": "2277"}, {"name": "沙坪坝区", "id": "2278"}, {
        "name": "九龙坡区",
        "id": "2279"
    }, {"name": "南岸区", "id": "2280"}, {"name": "北碚区", "id": "2281"}, {"name": "万盛区", "id": "2282"}, {
        "name": "双桥区",
        "id": "2283"
    }, {"name": "渝北区", "id": "2284"}, {"name": "巴南区", "id": "2285"}, {"name": "黔江区", "id": "2286"}, {
        "name": "长寿区",
        "id": "2287"
    }, {"name": "江津区", "id": "2288"}, {"name": "合川区", "id": "2289"}, {"name": "永川区", "id": "2290"}, {
        "name": "南川区",
        "id": "2291"
    }, {"name": "綦江县", "id": "2292"}, {"name": "潼南县", "id": "2293"}, {"name": "铜梁县", "id": "2294"}, {
        "name": "大足县",
        "id": "2295"
    }, {"name": "荣昌县", "id": "2296"}, {"name": "璧山县", "id": "2297"}, {"name": "梁平县", "id": "2298"}, {
        "name": "城口县",
        "id": "2299"
    }, {"name": "丰都县", "id": "2300"}, {"name": "垫江县", "id": "2301"}, {"name": "武隆县", "id": "2302"}, {
        "name": "忠县",
        "id": "2303"
    }, {"name": "开县", "id": "2304"}, {"name": "云阳县", "id": "2305"}, {"name": "奉节县", "id": "2306"}, {
        "name": "巫山县",
        "id": "2307"
    }, {"name": "巫溪县", "id": "2308"}, {"name": "石柱土家族自治县", "id": "2309"}, {
        "name": "秀山土家族苗族自治县",
        "id": "2310"
    }, {"name": "酉阳土家族苗族自治县", "id": "2311"}, {"name": "彭水苗族土家族自治县", "id": "2312"}]
}, {
    "name": "四川省",
    "id": "2313",
    "childs": [{"name": "成都市", "id": "2314"}, {"name": "自贡市", "id": "2334"}, {
        "name": "攀枝花市",
        "id": "2341"
    }, {"name": "泸州市", "id": "2347"}, {"name": "德阳市", "id": "2355"}, {"name": "绵阳市", "id": "2362"}, {
        "name": "广元市",
        "id": "2372"
    }, {"name": "遂宁市", "id": "2380"}, {"name": "内江市", "id": "2386"}, {"name": "乐山市", "id": "2392"}, {
        "name": "南充市",
        "id": "2404"
    }, {"name": "眉山市", "id": "2414"}, {"name": "宜宾市", "id": "2421"}, {"name": "广安市", "id": "2432"}, {
        "name": "达州市",
        "id": "2438"
    }, {"name": "雅安市", "id": "2446"}, {"name": "巴中市", "id": "2455"}, {
        "name": "资阳市",
        "id": "2460"
    }, {"name": "阿坝藏族羌族自治州", "id": "2465"}, {"name": "甘孜藏族自治州", "id": "2479"}, {"name": "凉山彝族自治州", "id": "2498"}]
}, {
    "name": "贵州省",
    "id": "2516",
    "childs": [{"name": "贵阳市", "id": "2517"}, {"name": "六盘水市", "id": "2528"}, {
        "name": "遵义市",
        "id": "2533"
    }, {"name": "安顺市", "id": "2548"}, {"name": "铜仁地区", "id": "2555"}, {
        "name": "黔西南布依族苗族自治州",
        "id": "2566"
    }, {"name": "毕节地区", "id": "2575"}, {"name": "黔东南苗族侗族自治州", "id": "2584"}, {"name": "黔南布依族苗族自治州", "id": "2601"}]
}, {
    "name": "云南省",
    "id": "2614",
    "childs": [{"name": "昆明市", "id": "2615"}, {"name": "曲靖市", "id": "2630"}, {
        "name": "玉溪市",
        "id": "2640"
    }, {"name": "保山市", "id": "2650"}, {"name": "昭通市", "id": "2656"}, {"name": "丽江市", "id": "2668"}, {
        "name": "普洱市",
        "id": "2674"
    }, {"name": "临沧市", "id": "2685"}, {"name": "楚雄彝族自治州", "id": "2694"}, {
        "name": "红河哈尼族彝族自治州",
        "id": "2705"
    }, {"name": "文山壮族苗族自治州", "id": "2719"}, {"name": "西双版纳傣族自治州", "id": "2728"}, {
        "name": "大理白族自治州",
        "id": "2732"
    }, {"name": "德宏傣族景颇族自治州", "id": "2745"}, {"name": "怒江傈僳族自治州", "id": "2751"}, {"name": "迪庆藏族自治州", "id": "2756"}]
}, {
    "name": "西藏自治区",
    "id": "2760",
    "childs": [{"name": "拉萨市", "id": "2761"}, {"name": "昌都地区", "id": "2770"}, {
        "name": "山南地区",
        "id": "2782"
    }, {"name": "日喀则地区", "id": "2795"}, {"name": "那曲地区", "id": "2814"}, {"name": "阿里地区", "id": "2825"}, {
        "name": "林芝地区",
        "id": "2833"
    }]
}, {
    "name": "陕西省",
    "id": "2841",
    "childs": [{"name": "西安市", "id": "2842"}, {"name": "铜川市", "id": "2856"}, {
        "name": "宝鸡市",
        "id": "2861"
    }, {"name": "咸阳市", "id": "2874"}, {"name": "渭南市", "id": "2889"}, {"name": "延安市", "id": "2901"}, {
        "name": "汉中市",
        "id": "2915"
    }, {"name": "榆林市", "id": "2927"}, {"name": "安康市", "id": "2940"}, {"name": "商洛市", "id": "2951"}]
}, {
    "name": "甘肃省",
    "id": "2959",
    "childs": [{"name": "兰州市", "id": "2960"}, {"name": "嘉峪关市", "id": "2969"}, {
        "name": "金昌市",
        "id": "2970"
    }, {"name": "白银市", "id": "2973"}, {"name": "天水市", "id": "2979"}, {"name": "武威市", "id": "2987"}, {
        "name": "张掖市",
        "id": "2992"
    }, {"name": "平凉市", "id": "2999"}, {"name": "酒泉市", "id": "3007"}, {"name": "庆阳市", "id": "3015"}, {
        "name": "定西市",
        "id": "3024"
    }, {"name": "陇南市", "id": "3032"}, {"name": "临夏回族自治州", "id": "3042"}, {"name": "甘南藏族自治州", "id": "3051"}]
}, {
    "name": "青海省",
    "id": "3060",
    "childs": [{"name": "西宁市", "id": "3061"}, {"name": "海东地区", "id": "3069"}, {
        "name": "海北藏族自治州",
        "id": "3076"
    }, {"name": "黄南藏族自治州", "id": "3081"}, {"name": "海南藏族自治州", "id": "3086"}, {
        "name": "果洛藏族自治州",
        "id": "3092"
    }, {"name": "玉树藏族自治州", "id": "3099"}, {"name": "海西蒙古族藏族自治州", "id": "3106"}]
}, {
    "name": "宁夏自治区",
    "id": "3112",
    "childs": [{"name": "银川市", "id": "3113"}, {"name": "石嘴山市", "id": "3120"}, {
        "name": "吴忠市",
        "id": "3124"
    }, {"name": "固原市", "id": "3130"}, {"name": "中卫市", "id": "3136"}]
}, {
    "name": "新疆自治区",
    "id": "3140",
    "childs": [{"name": "乌鲁木齐市", "id": "3141"}, {"name": "克拉玛依市", "id": "3150"}, {
        "name": "吐鲁番地区",
        "id": "3155"
    }, {"name": "哈密地区", "id": "3159"}, {"name": "昌吉回族自治州", "id": "3163"}, {
        "name": "博尔塔拉蒙古自治州",
        "id": "3171"
    }, {"name": "巴音郭楞蒙古自治州", "id": "3175"}, {"name": "阿克苏地区", "id": "3185"}, {
        "name": "克孜勒苏柯尔克孜自治州",
        "id": "3195"
    }, {"name": "喀什地区", "id": "3200"}, {"name": "和田地区", "id": "3213"}, {
        "name": "伊犁哈萨克自治州",
        "id": "3222"
    }, {"name": "塔城地区", "id": "3233"}, {"name": "阿勒泰地区", "id": "3241"}, {"name": "自治区直辖县级行政区划", "id": "3249"}]
}]